{"id":26525,"date":"2012-11-28T08:00:12","date_gmt":"2012-11-28T00:00:12","guid":{"rendered":"http:\/\/www.yankay.com\/?p=26525"},"modified":"2012-11-28T08:00:12","modified_gmt":"2012-11-28T00:00:12","slug":"go-clear-concurreny","status":"publish","type":"post","link":"http:\/\/yankay.com\/go-clear-concurreny\/","title":{"rendered":"Go-\u7b80\u6d01\u7684\u5e76\u53d1"},"content":{"rendered":"<p>\u591a\u6838\u5904\u7406\u5668\u8d8a\u6765\u8d8a\u666e\u53ca\u3002\u6709\u6ca1\u6709\u4e00\u79cd\u7b80\u5355\u7684\u529e\u6cd5\uff0c\u80fd\u591f\u8ba9\u6211\u4eec\u5199\u7684\u8f6f\u4ef6\u91ca\u653e\u591a\u6838\u7684\u5a01\u529b\uff1f\u662f\u6709\u7684\u3002\u968f\u7740Golang, Erlang, Scala\u7b49\u4e3a\u5e76\u53d1\u8bbe\u8ba1\u7684\u7a0b\u5e8f\u8bed\u8a00\u7684\u5174\u8d77\uff0c\u65b0\u7684\u5e76\u53d1\u6a21\u5f0f\u9010\u6e10\u6e05\u6670\u3002\u6b63\u5982\u8fc7\u7a0b\u5f0f\u7f16\u7a0b\u548c\u9762\u5411\u5bf9\u8c61\u4e00\u6837\uff0c\u4e00\u4e2a\u597d\u7684\u7f16\u7a0b\u6a21\u5f0f\u6709\u4e00\u4e2a\u6781\u5176\u7b80\u6d01\u7684\u5185\u6838\uff0c\u8fd8\u6709\u5728\u6b64\u4e4b\u4e0a\u4e30\u5bcc\u7684\u5916\u5ef6\u3002\u53ef\u4ee5\u89e3\u51b3\u73b0\u5b9e\u4e16\u754c\u4e2d\u5404\u79cd\u5404\u6837\u7684\u95ee\u9898\u3002\u672c\u6587\u4ee5GO\u8bed\u8a00\u4e3a\u4f8b\uff0c\u89e3\u91ca\u5176\u4e2d\u5185\u6838\u3001\u5916\u5ef6\u3002<\/p>\n<h3>\u5e76\u53d1\u6a21\u5f0f\u4e4b\u5185\u6838<\/h3>\n<p>\u8fd9\u79cd\u5e76\u53d1\u6a21\u5f0f\u7684\u5185\u6838\u53ea\u9700\u8981<strong>\u534f\u7a0b<\/strong>\u548c<strong>\u901a\u9053<\/strong>\u5c31\u591f\u4e86\u3002\u534f\u7a0b\u8d1f\u8d23\u6267\u884c\u4ee3\u7801\uff0c\u901a\u9053\u8d1f\u8d23\u5728\u534f\u7a0b\u4e4b\u95f4\u4f20\u9012\u4e8b\u4ef6\u3002<\/p>\n<p><a href=\"http:\/\/yankaycom-wordpress.stor.sinaapp.com\/uploads\/2012\/12\/8221722709_681613f47b_b.jpg\"><img decoding=\"async\" alt=\"\" src=\"http:\/\/yankaycom-wordpress.stor.sinaapp.com\/uploads\/2012\/12\/8221722709_681613f47b_b.jpg\" title=\"\u6982\u5ff5\" class=\"alignnone\"\/><\/a><\/p>\n<p>\u4e0d\u4e45\u524d\uff0c\u5e76\u53d1\u7f16\u7a0b\u662f\u4e2a\u975e\u5e38\u56f0\u96be\u7684\u4e8b\u3002\u8981\u60f3\u7f16\u5199\u4e00\u4e2a\u826f\u597d\u7684\u5e76\u53d1\u7a0b\u5e8f\uff0c\u6211\u4eec\u4e0d\u5f97\u4e0d\u4e86\u89e3\u7ebf\u7a0b\uff0c\u9501\uff0csemaphore\uff0cbarrier\u751a\u81f3CPU\u66f4\u65b0\u9ad8\u901f\u7f13\u5b58\u7684\u65b9\u5f0f\uff0c\u800c\u4e14\u4ed6\u4eec\u4e2a\u4e2a\u90fd\u6709\u602a\u813e\u6c14\uff0c\u5904\u5904\u662f\u9677\u9631\u3002\u7b14\u8005\u9664\u975e\u4e07\u4e0d\u5f97\u4ee5\uff0c\u51b3\u4e0d\u4f1a\u81ea\u5df1\u64cd\u4f5c\u8fd9\u4e9b\u5e95\u5c42\u5e76\u53d1\u5143\u7d20\u3002\u4e00\u4e2a\u7b80\u6d01\u7684\u5e76\u53d1\u6a21\u5f0f\u4e0d\u9700\u8981\u8fd9\u4e9b\u590d\u6742\u7684\u5e95\u5c42\u5143\u7d20\uff0c\u534f\u7a0b\u548c\u901a\u9053\u5c31\u591f\u4e86\u3002<\/p>\n<p>\u534f\u7a0b\u662f\u8f7b\u91cf\u7ea7\u7684\u7ebf\u7a0b\u3002\u5728\u8fc7\u7a0b\u5f0f\u7f16\u7a0b\u4e2d\uff0c\u5f53\u8c03\u7528\u4e00\u4e2a\u8fc7\u7a0b\u7684\u65f6\u5019\uff0c\u9700\u8981\u7b49\u5f85\u5176\u6267\u884c\u5b8c\u624d\u8fd4\u56de\u3002\u800c\u8c03\u7528\u4e00\u4e2a\u534f\u7a0b\u7684\u65f6\u5019\uff0c\u4e0d\u9700\u8981\u7b49\u5f85\u5176\u6267\u884c\u5b8c\uff0c\u4f1a\u7acb\u5373\u8fd4\u56de\u3002\u534f\u7a0b\u5341\u5206\u8f7b\u91cf\uff0cGo\u8bed\u8a00\u53ef\u4ee5\u5728\u4e00\u4e2a\u8fdb\u7a0b\u4e2d\u6267\u884c\u6709\u6570\u4ee5\u5341\u4e07\u8ba1\u7684\u534f\u7a0b\uff0c\u4f9d\u65e7\u4fdd\u6301\u9ad8\u6027\u80fd\u3002\u800c\u5bf9\u4e8e\u666e\u901a\u7684\u5e73\u53f0\uff0c\u4e00\u4e2a\u8fdb\u7a0b\u6709\u6570\u5343\u4e2a\u7ebf\u7a0b\uff0c\u5176CPU\u4f1a\u5fd9\u4e8e\u4e0a\u4e0b\u6587\u5207\u6362\uff0c\u6027\u80fd\u6025\u5267\u4e0b\u964d\u3002\u968f\u610f\u521b\u5efa\u7ebf\u7a0b\u53ef\u4e0d\u662f\u4e00\u4e2a\u597d\u4e3b\u610f\uff0c\u4f46\u662f\u6211\u4eec\u53ef\u4ee5\u5927\u91cf\u4f7f\u7528\u7684\u534f\u7a0b\u3002<\/p>\n<p>\u901a\u9053\u662f\u534f\u7a0b\u4e4b\u95f4\u7684\u6570\u636e\u4f20\u8f93\u901a\u9053\u3002\u901a\u9053\u53ef\u4ee5\u5728\u4f17\u591a\u7684\u534f\u7a0b\u4e4b\u95f4\u4f20\u9012\u6570\u636e\uff0c\u5177\u4f53\u53ef\u4ee5\u503c\u4e5f\u53ef\u4ee5\u662f\u4e2a\u5f15\u7528\u3002\u901a\u9053\u6709\u4e24\u79cd\u4f7f\u7528\u65b9\u5f0f\u3002<\/p>\n<ul>\n<li>\u534f\u7a0b\u53ef\u4ee5\u8bd5\u56fe\u5411\u901a\u9053\u653e\u5165\u6570\u636e\uff0c\u5982\u679c\u901a\u9053\u6ee1\u4e86\uff0c\u4f1a\u6302\u8d77\u534f\u7a0b\uff0c\u76f4\u5230\u901a\u9053\u53ef\u4ee5\u4e3a\u4ed6\u653e\u5165\u6570\u636e\u4e3a\u6b62\u3002\n<\/li>\n<li>\u534f\u7a0b\u53ef\u4ee5\u8bd5\u56fe\u5411\u901a\u9053\u7d22\u53d6\u6570\u636e\uff0c\u5982\u679c\u901a\u9053\u6ca1\u6709\u6570\u636e\uff0c\u4f1a\u6302\u8d77\u534f\u7a0b\uff0c\u76f4\u5230\u901a\u9053\u8fd4\u56de\u6570\u636e\u4e3a\u6b62\u3002<\/li>\n<\/ul>\n<p>\u5982\u6b64\uff0c\u901a\u9053\u5c31\u53ef\u4ee5\u5728\u4f20\u9012\u6570\u636e\u7684\u540c\u65f6\uff0c\u63a7\u5236\u534f\u7a0b\u7684\u8fd0\u884c\u3002\u6709\u70b9\u50cf\u4e8b\u4ef6\u9a71\u52a8\uff0c\u4e5f\u6709\u70b9\u50cf\u963b\u585e\u961f\u5217\u3002<\/p>\n<p>\u8fd9\u4e24\u4e2a\u6982\u5ff5\u975e\u5e38\u7684\u7b80\u5355\uff0c\u5404\u4e2a\u8bed\u8a00\u5e73\u53f0\u90fd\u4f1a\u6709\u76f8\u5e94\u7684\u5b9e\u73b0\u3002\u5728Java\u548cC\u4e0a\u4e5f\u5404\u6709\u5e93\u53ef\u4ee5\u5b9e\u73b0\u4e24\u8005\u3002<\/p>\n<table border=\"1\" cellspacing=\"0\" cellpadding=\"0\">\n<thead>\n<tr>\n<td><strong><\/strong><\/td>\n<td><strong>Golang<\/strong><\/td>\n<td><strong>Erlang<\/strong><\/td>\n<td><strong>Scala(Actor)<\/strong><\/td>\n<\/tr>\n<\/thead>\n<tbody>\n<tr>\n<td><strong>\u534f\u7a0b<\/strong><strong><\/strong><\/td>\n<td>goroutines<\/td>\n<td>process<\/td>\n<td>actor<\/td>\n<\/tr>\n<tr>\n<td><strong>\u6d88\u606f\u961f\u5217<\/strong><strong><\/strong><\/td>\n<td>channel<\/td>\n<td>mailbox<\/td>\n<td>channel<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>\u53ea\u8981\u6709\u534f\u7a0b\u548c\u901a\u9053\uff0c\u5c31\u53ef\u4ee5\u4f18\u96c5\u7684\u89e3\u51b3\u5e76\u53d1\u7684\u95ee\u9898\u3002\u4e0d\u5fc5\u4f7f\u7528\u5176\u4ed6\u548c\u5e76\u53d1\u6709\u5173\u7684\u6982\u5ff5\u3002\u90a3\u5982\u4f55\u7528\u8fd9\u4e24\u628a\u5229\u5203\u89e3\u51b3\u5404\u5f0f\u5404\u6837\u7684\u5b9e\u9645\u95ee\u9898\u5462\uff1f<\/p>\n<h3>\u5e76\u53d1\u6a21\u5f0f\u4e4b\u5916\u5ef6<\/h3>\n<p>\u534f\u7a0b\u76f8\u8f83\u4e8e\u7ebf\u7a0b\uff0c\u53ef\u4ee5\u5927\u91cf\u521b\u5efa\u3002\u6253\u5f00\u8fd9\u6247\u95e8\uff0c\u6211\u4eec\u62d3\u5c55\u51fa\u65b0\u7684\u7528\u6cd5\uff0c\u53ef\u4ee5\u505a\u751f\u6210\u5668\uff0c\u53ef\u4ee5\u8ba9\u51fd\u6570\u8fd4\u56de\u201c\u670d\u52a1\u201d\uff0c\u53ef\u4ee5\u8ba9\u5faa\u73af\u5e76\u53d1\u6267\u884c\uff0c\u8fd8\u80fd\u5171\u4eab\u53d8\u91cf\u3002\u4f46\u662f\u51fa\u73b0\u65b0\u7684\u7528\u6cd5\u7684\u540c\u65f6\uff0c\u4e5f\u5e26\u6765\u4e86\u65b0\u7684\u68d8\u624b\u95ee\u9898\uff0c\u534f\u7a0b\u4e5f\u4f1a\u6cc4\u6f0f\uff0c\u4e0d\u6070\u5f53\u7684\u4f7f\u7528\u4f1a\u5f71\u54cd\u6027\u80fd\u3002\u4e0b\u9762\u4f1a\u9010\u4e00\u4ecb\u7ecd\u5404\u79cd\u7528\u6cd5\u548c\u95ee\u9898\u3002\u6f14\u793a\u7684\u4ee3\u7801\u7528GO\u8bed\u8a00\u5199\u6210\uff0c\u56e0\u4e3a\u5176\u7b80\u6d01\u660e\u4e86\uff0c\u800c\u4e14\u652f\u6301\u5168\u90e8\u529f\u80fd\u3002<\/p>\n<h4>\u751f\u6210\u5668<\/h4>\n<p>\u6709\u7684\u65f6\u5019\uff0c\u6211\u4eec\u9700\u8981\u6709\u4e00\u4e2a\u51fd\u6570\u80fd\u4e0d\u65ad\u751f\u6210\u6570\u636e\u3002\u6bd4\u65b9\u8bf4\u8fd9\u4e2a\u51fd\u6570\u53ef\u4ee5\u8bfb\u6587\u4ef6\uff0c\u8bfb\u7f51\u7edc\uff0c\u751f\u6210\u81ea\u589e\u957f\u5e8f\u5217\uff0c\u751f\u6210\u968f\u673a\u6570\u3002\u8fd9\u4e9b\u884c\u4e3a\u7684\u7279\u70b9\u5c31\u662f\uff0c\u51fd\u6570\u7684\u5df2\u77e5\u4e00\u4e9b\u53d8\u91cf\uff0c\u5982\u6587\u4ef6\u8def\u5f84\u3002\u7136\u540e\u4e0d\u65ad\u8c03\u7528\uff0c\u8fd4\u56de\u65b0\u7684\u6570\u636e\u3002<\/p>\n<p><a href=\"http:\/\/yankaycom-wordpress.stor.sinaapp.com\/uploads\/2012\/12\/8221722807_a204295475_b.jpg\"><img decoding=\"async\" alt=\"\" src=\"http:\/\/yankaycom-wordpress.stor.sinaapp.com\/uploads\/2012\/12\/8221722807_a204295475_b.jpg\" title=\"\u751f\u6210\u5668\" class=\"alignnone\" \/><\/a><\/p>\n<p>\u4e0b\u9762\u751f\u6210\u968f\u673a\u6570\u4e3a\u4f8b\uff0c \u4ee5\u8ba9\u6211\u4eec\u505a\u4e00\u4e2a\u4f1a\u5e76\u53d1\u6267\u884c\u7684\u968f\u673a\u6570\u751f\u6210\u5668\u3002<\/p>\n<p>\u975e\u5e76\u53d1\u7684\u505a\u6cd5\u662f\u8fd9\u6837\u7684\uff1a<\/p>\n<pre lang=\"go\">\/\/ \u51fd\u6570 rand_generator_1 \uff0c\u8fd4\u56de int\nfunc rand_generator_1() int {\n\treturn rand.Int()\n}<\/pre>\n<p>\u4e0a\u9762\u662f\u4e00\u4e2a\u51fd\u6570\uff0c\u8fd4\u56de\u4e00\u4e2aint\u3002\u5047\u5982rand.Int()\u8fd9\u4e2a\u51fd\u6570\u8c03\u7528\u9700\u8981\u5f88\u957f\u65f6\u95f4\u7b49\u5f85\uff0c\u90a3\u8be5\u51fd\u6570\u7684\u8c03\u7528\u8005\u4e5f\u4f1a\u56e0\u6b64\u800c\u6302\u8d77\u3002\u6240\u4ee5\u6211\u4eec\u53ef\u4ee5\u521b\u5efa\u4e00\u4e2a\u534f\u7a0b\uff0c\u4e13\u95e8\u6267\u884crand.Int()\u3002<\/p>\n<pre lang=\"go\">\/\/ \u51fd\u6570 rand_generator_2\uff0c\u8fd4\u56de \u901a\u9053(Channel)\nfunc rand_generator_2() chan int {\n\t\/\/ \u521b\u5efa\u901a\u9053\n\tout := make(chan int)\n\t\/\/ \u521b\u5efa\u534f\u7a0b\n\tgo func() {\n\t\tfor {\n\t\t\t\/\/\u5411\u901a\u9053\u5185\u5199\u5165\u6570\u636e\uff0c\u5982\u679c\u65e0\u4eba\u8bfb\u53d6\u4f1a\u7b49\u5f85\n\t\t\tout <- rand.Int()\n\t\t}\n\t}()\n\treturn out\n}\n\nfunc main() {\n\t\/\/ \u751f\u6210\u968f\u673a\u6570\u4f5c\u4e3a\u4e00\u4e2a\u670d\u52a1\n\trand_service_handler := rand_generator_2()\n\t\/\/ \u4ece\u670d\u52a1\u4e2d\u8bfb\u53d6\u968f\u673a\u6570\u5e76\u6253\u5370\n\tfmt.Printf(\"%dn\", <-rand_service_handler)\n}<\/pre>\n<p>\u4e0a\u9762\u7684\u8fd9\u6bb5\u51fd\u6570\u5c31\u53ef\u4ee5\u5e76\u53d1\u6267\u884c\u4e86rand.Int()\u3002\u6709\u4e00\u70b9\u503c\u5f97\u6ce8\u610f\u5230\u51fd\u6570\u7684\u8fd4\u56de\u53ef\u4ee5\u7406\u89e3\u4e3a\u4e00\u4e2a\u201c\u670d\u52a1\u201d\u3002\u4f46\u6211\u4eec\u9700\u8981\u83b7\u53d6\u968f\u673a\u6570\u636e \u65f6\u5019\uff0c\u53ef\u4ee5\u968f\u65f6\u5411\u8fd9\u4e2a\u670d\u52a1\u53d6\u7528\uff0c\u4ed6\u5df2\u7ecf\u4e3a\u6211\u4eec\u51c6\u5907\u597d\u4e86\u76f8\u5e94\u7684\u6570\u636e\uff0c\u65e0\u9700\u7b49\u5f85\uff0c\u968f\u8981\u968f\u5230\u3002\u5982\u679c\u6211\u4eec\u8c03\u7528\u8fd9\u4e2a\u670d\u52a1\u4e0d\u662f\u5f88\u9891\u7e41\uff0c\u4e00\u4e2a\u534f\u7a0b\u8db3\u591f\u6ee1\u8db3\u6211\u4eec\u7684\u9700\u6c42\u4e86\u3002\u4f46\u5982\u679c\u6211\u4eec\u9700\u8981\u5927\u91cf\u8bbf\u95ee\uff0c\u600e\u4e48\u529e\uff1f\u6211\u4eec\u53ef\u4ee5\u7528\u4e0b\u9762\u4ecb\u7ecd\u7684\u591a\u8def\u590d\u7528\u6280\u672f\uff0c\u542f\u52a8\u82e5\u5e72\u751f\u6210\u5668\uff0c\u518d\u5c06\u5176\u6574\u5408\u6210\u4e00\u4e2a\u5927\u7684\u670d\u52a1\u3002<\/p>\n<p>\u8c03\u7528\u751f\u6210\u5668\uff0c\u53ef\u4ee5\u8fd4\u56de\u4e00\u4e2a\u201c\u670d\u52a1\u201d\u3002\u53ef\u4ee5\u7528\u5728\u6301\u7eed\u83b7\u53d6\u6570\u636e\u7684\u573a\u5408\u3002\u7528\u9014\u5f88\u5e7f\u6cdb\uff0c\u8bfb\u53d6\u6570\u636e\uff0c\u751f\u6210ID\uff0c\u751a\u81f3\u5b9a\u65f6\u5668\u3002\u8fd9\u662f\u4e00\u79cd\u975e\u5e38\u7b80\u6d01\u7684\u601d\u8def\uff0c\u5c06\u7a0b\u5e8f\u5e76\u53d1\u5316\u3002<\/p>\n<h4>\u591a\u8def\u590d\u7528<\/h4>\n<p>\u591a\u8def\u590d\u7528\u662f\u8ba9\u4e00\u6b21\u5904\u7406\u591a\u4e2a\u961f\u5217\u7684\u6280\u672f\u3002Apache\u4f7f\u7528\u5904\u7406\u6bcf\u4e2a\u8fde\u63a5\u90fd\u9700\u8981\u4e00\u4e2a\u8fdb\u7a0b\uff0c\u6240\u4ee5\u5176\u5e76\u53d1\u6027\u80fd\u4e0d\u662f\u5f88\u597d\u3002\u800cNighx\u4f7f\u7528\u591a\u8def\u590d\u7528\u7684\u6280\u672f\uff0c\u8ba9\u4e00\u4e2a\u8fdb\u7a0b\u5904\u7406\u591a\u4e2a\u8fde\u63a5\uff0c\u6240\u4ee5\u5e76\u53d1\u6027\u80fd\u6bd4\u8f83\u597d\u3002\u540c\u6837\uff0c\u5728\u534f\u7a0b\u7684\u573a\u5408\uff0c\u591a\u8def\u590d\u7528\u4e5f\u662f\u9700\u8981\u7684\uff0c\u4f46\u53c8\u6709\u6240\u4e0d\u540c\u3002\u591a\u8def\u590d\u7528\u53ef\u4ee5\u5c06\u82e5\u5e72\u4e2a\u76f8\u4f3c\u7684\u5c0f\u670d\u52a1\u6574\u5408\u6210\u4e00\u4e2a\u5927\u670d\u52a1\u3002<\/p>\n<p><a href=\"http:\/\/yankaycom-wordpress.stor.sinaapp.com\/uploads\/2012\/12\/8222798490_6d6eb1a602_b.jpg\"><img decoding=\"async\" alt=\"\" src=\"http:\/\/yankaycom-wordpress.stor.sinaapp.com\/uploads\/2012\/12\/8222798490_6d6eb1a602_b.jpg\" title=\"\u591a\u8def\u590d\u7528\" class=\"alignnone\"  \/><\/a><\/p>\n<p>\u90a3\u4e48\u8ba9\u6211\u4eec\u7528\u591a\u8def\u590d\u7528\u6280\u672f\u505a\u4e00\u4e2a\u66f4\u9ad8\u5e76\u53d1\u7684\u968f\u673a\u6570\u751f\u6210\u5668\u5427\u3002<\/p>\n<pre lang=\"go\">\/\/ \u51fd\u6570 rand_generator_3 \uff0c\u8fd4\u56de\u901a\u9053(Channel)\nfunc rand_generator_3() chan int {\n\t\/\/ \u521b\u5efa\u4e24\u4e2a\u968f\u673a\u6570\u751f\u6210\u5668\u670d\u52a1\n\trand_generator_1 := rand_generator_2()\n\trand_generator_2 := rand_generator_2()\n\n\t\/\/\u521b\u5efa\u901a\u9053\n\tout := make(chan int)\n\n\t\/\/\u521b\u5efa\u534f\u7a0b\n\tgo func() {\n\t\tfor {\n\t\t\t\/\/\u8bfb\u53d6\u751f\u6210\u56681\u4e2d\u7684\u6570\u636e\uff0c\u6574\u5408\n\t\t\tout <- <-rand_generator_1\n\t\t}\n\t}()\n\tgo func() {\n\t\tfor {\n\t\t\t\/\/\u8bfb\u53d6\u751f\u6210\u56682\u4e2d\u7684\u6570\u636e\uff0c\u6574\u5408\n\t\t\tout <- <-rand_generator_2\n\t\t}\n\t}()\n\treturn out\n}<\/pre>\n<p>\u4e0a\u9762\u662f\u4f7f\u7528\u4e86\u591a\u8def\u590d\u7528\u6280\u672f\u7684\u9ad8\u5e76\u53d1\u7248\u7684\u968f\u673a\u6570\u751f\u6210\u5668\u3002\u901a\u8fc7\u6574\u5408\u4e24\u4e2a\u968f\u673a\u6570\u751f\u6210\u5668\uff0c\u8fd9\u4e2a\u7248\u672c\u7684\u80fd\u529b\u662f\u521a\u624d\u7684\u4e24\u500d\u3002\u867d\u7136\u534f\u7a0b\u53ef\u4ee5\u5927\u91cf\u521b\u5efa\uff0c\u4f46\u662f\u4f17\u591a\u534f\u7a0b\u8fd8\u662f\u4f1a\u4e89\u62a2\u8f93\u51fa\u7684\u901a\u9053\u3002Go\u8bed\u8a00\u63d0\u4f9b\u4e86Select\u5173\u952e\u5b57\u6765\u89e3\u51b3\uff0c\u5404\u5bb6\u4e5f\u6709\u5404\u5bb6\u7a8d\u95e8\u3002\u52a0\u5927\u8f93\u51fa\u901a\u9053\u7684\u7f13\u51b2\u5927\u5c0f\u662f\u4e2a\u901a\u7528\u7684\u89e3\u51b3\u65b9\u6cd5\u3002<\/p>\n<p>\u591a\u8def\u590d\u7528\u6280\u672f\u53ef\u4ee5\u7528\u6765\u6574\u5408\u591a\u4e2a\u901a\u9053\u3002\u63d0\u5347\u6027\u80fd\u548c\u64cd\u4f5c\u7684\u4fbf\u6377\u3002\u914d\u5408\u5176\u4ed6\u7684\u6a21\u5f0f\u4f7f\u7528\u6709\u5f88\u5927\u7684\u5a01\u529b\u3002<\/p>\n<h4>Furture\u6280\u672f<\/h4>\n<p>Furture\u662f\u4e00\u4e2a\u5f88\u6709\u7528\u7684\u6280\u672f\uff0c\u6211\u4eec\u5e38\u5e38\u4f7f\u7528Furture\u6765\u64cd\u4f5c\u7ebf\u7a0b\u3002\u6211\u4eec\u53ef\u4ee5\u5728\u4f7f\u7528\u7ebf\u7a0b\u7684\u65f6\u5019\uff0c\u53ef\u4ee5\u521b\u5efa\u4e00\u4e2a\u7ebf\u7a0b\uff0c\u8fd4\u56deFurture\uff0c\u4e4b\u540e\u53ef\u4ee5\u901a\u8fc7\u5b83\u7b49\u5f85\u7ed3\u679c\u3002 \u4f46\u662f\u5728\u534f\u7a0b\u73af\u5883\u4e0b\u7684Furtue\u53ef\u4ee5\u66f4\u52a0\u5f7b\u5e95\uff0c\u8f93\u5165\u53c2\u6570\u540c\u6837\u53ef\u4ee5\u662fFurture\u7684\u3002<\/p>\n<p><a href=\"http:\/\/yankaycom-wordpress.stor.sinaapp.com\/uploads\/2012\/12\/8221722849_4462fd152f_b.jpg\"><img decoding=\"async\" alt=\"\" src=\"http:\/\/yankaycom-wordpress.stor.sinaapp.com\/uploads\/2012\/12\/8221722849_4462fd152f_b.jpg\" title=\"future\" class=\"alignnone\" \/><\/a><\/p>\n<p>\u8c03\u7528\u4e00\u4e2a\u51fd\u6570\u7684\u65f6\u5019\uff0c\u5f80\u5f80\u662f\u53c2\u6570\u5df2\u7ecf\u51c6\u5907\u597d\u4e86\u3002\u8c03\u7528\u534f\u7a0b\u7684\u65f6\u5019\u4e5f\u540c\u6837\u5982\u6b64\u3002\u4f46\u662f\u5982\u679c\u6211\u4eec\u5c06\u4f20\u5165\u7684\u53c2\u6570\u8bbe\u4e3a\u901a\u9053\uff0c\u8fd9\u6837\u6211\u4eec\u5c31\u53ef\u4ee5\u5728\u4e0d\u51c6\u5907\u597d\u53c2\u6570\u7684\u60c5\u51b5\u4e0b\u8c03\u7528\u51fd\u6570\u3002\u8fd9\u6837\u7684\u8bbe\u8ba1\u53ef\u4ee5\u63d0\u4f9b\u5f88\u5927\u7684\u81ea\u7531\u5ea6\u548c\u5e76\u53d1\u5ea6\u3002\u51fd\u6570\u8c03\u7528\u548c\u51fd\u6570\u53c2\u6570\u51c6\u5907\u8fd9\u4e24\u4e2a\u8fc7\u7a0b\u53ef\u4ee5\u5b8c\u5168\u89e3\u8026\u3002\u4e0b\u9762\u4e3e\u4e00\u4e2a\u7528\u8be5\u6280\u672f\u8bbf\u95ee\u6570\u636e\u5e93\u7684\u4f8b\u5b50\u3002<\/p>\n<pre lang=\"go\">\/\/\u4e00\u4e2a\u67e5\u8be2\u7ed3\u6784\u4f53\ntype query struct {\n\t\/\/\u53c2\u6570Channel\n\tsql chan string\n\t\/\/\u7ed3\u679cChannel\n\tresult chan string\n}\n\n\/\/\u6267\u884cQuery\nfunc execQuery(q query) {\n\t\/\/\u542f\u52a8\u534f\u7a0b\n\tgo func() {\n\t\t\/\/\u83b7\u53d6\u8f93\u5165\n\t\tsql := <-q.sql\n\t\t\/\/\u8bbf\u95ee\u6570\u636e\u5e93\uff0c\u8f93\u51fa\u7ed3\u679c\u901a\u9053\n\t\tq.result <- \"get \" + sql\n\t}()\n\n}\n\nfunc main() {\n\t\/\/\u521d\u59cb\u5316Query\n\tq :=\n\t\tquery{make(chan string, 1), make(chan string, 1)}\n\t\/\/\u6267\u884cQuery\uff0c\u6ce8\u610f\u6267\u884c\u7684\u65f6\u5019\u65e0\u9700\u51c6\u5907\u53c2\u6570\n\texecQuery(q)\n\n\t\/\/\u51c6\u5907\u53c2\u6570\n\tq.sql <- \"select * from table\"\n\t\/\/\u83b7\u53d6\u7ed3\u679c\n\tfmt.Println(<-q.result)\n}<\/pre>\n<p>\u4e0a\u9762\u5229\u7528Furture\u6280\u672f\uff0c\u4e0d\u5355\u8ba9\u7ed3\u679c\u5728Furture\u83b7\u5f97\uff0c\u53c2\u6570\u4e5f\u662f\u5728Furture\u83b7\u53d6\u3002\u51c6\u5907\u597d\u53c2\u6570\u540e\uff0c\u81ea\u52a8\u6267\u884c\u3002Furture\u548c\u751f\u6210\u5668\u7684\u533a\u522b\u5728\u4e8e\uff0cFurture\u8fd4\u56de\u4e00\u4e2a\u7ed3\u679c\uff0c\u800c\u751f\u6210\u5668\u53ef\u4ee5\u91cd\u590d\u8c03\u7528\u3002\u8fd8\u6709\u4e00\u4e2a\u503c\u5f97\u6ce8\u610f\u7684\u5730\u65b9\uff0c\u5c31\u662f\u5c06\u53c2\u6570Channel\u548c\u7ed3\u679cChannel\u5b9a\u4e49\u5728\u4e00\u4e2a\u7ed3\u6784\u4f53\u91cc\u9762\u4f5c\u4e3a\u53c2\u6570\uff0c\u800c\u4e0d\u662f\u8fd4\u56de\u7ed3\u679cChannel\u3002\u8fd9\u6837\u505a\u53ef\u4ee5\u589e\u52a0\u805a\u5408\u5ea6\uff0c\u597d\u5904\u5c31\u662f\u53ef\u4ee5\u548c\u591a\u8def\u590d\u7528\u6280\u672f\u7ed3\u5408\u8d77\u6765\u4f7f\u7528\u3002<\/p>\n<p>Furture\u6280\u672f\u53ef\u4ee5\u548c\u5404\u4e2a\u5176\u4ed6\u6280\u672f\u7ec4\u5408\u8d77\u6765\u7528\u3002\u53ef\u4ee5\u901a\u8fc7\u591a\u8def\u590d\u7528\u6280\u672f\uff0c\u76d1\u542c\u591a\u4e2a\u7ed3\u679cChannel\uff0c\u5f53\u6709\u7ed3\u679c\u540e\uff0c\u81ea\u52a8\u8fd4\u56de\u3002\u4e5f\u53ef\u4ee5\u548c\u751f\u6210\u5668\u7ec4\u5408\u4f7f\u7528\uff0c\u751f\u6210\u5668\u4e0d\u65ad\u751f\u4ea7\u6570\u636e\uff0cFurture\u6280\u672f\u9010\u4e2a\u5904\u7406\u6570\u636e\u3002Furture\u6280\u672f\u81ea\u8eab\u8fd8\u53ef\u4ee5\u9996\u5c3e\u76f8\u8fde\uff0c\u5f62\u6210\u4e00\u4e2a\u5e76\u53d1\u7684pipe filter\u3002\u8fd9\u4e2apipe filter\u53ef\u4ee5\u7528\u4e8e\u8bfb\u5199\u6570\u636e\u6d41\uff0c\u64cd\u4f5c\u6570\u636e\u6d41\u3002<\/p>\n<p>Future\u662f\u4e00\u4e2a\u975e\u5e38\u5f3a\u5927\u7684\u6280\u672f\u624b\u6bb5\u3002\u53ef\u4ee5\u5728\u8c03\u7528\u7684\u65f6\u5019\u4e0d\u5173\u5fc3\u6570\u636e\u662f\u5426\u51c6\u5907\u597d\uff0c\u8fd4\u56de\u503c\u662f\u5426\u8ba1\u7b97\u597d\u7684\u95ee\u9898\u3002\u8ba9\u7a0b\u5e8f\u4e2d\u7684\u7ec4\u4ef6\u5728\u51c6\u5907\u597d\u6570\u636e\u7684\u65f6\u5019\u81ea\u52a8\u8dd1\u8d77\u6765\u3002<\/p>\n<h4>\u5e76\u53d1\u5faa\u73af<\/h4>\n<p>\u5faa\u73af\u5f80\u5f80\u662f\u6027\u80fd\u4e0a\u7684\u70ed\u70b9\u3002\u5982\u679c\u6027\u80fd\u74f6\u9888\u51fa\u73b0\u5728CPU\u4e0a\u7684\u8bdd\uff0c\u90a3\u4e48\u4e5d\u6210\u53ef\u80fd\u6027\u70ed\u70b9\u662f\u5728\u4e00\u4e2a\u5faa\u73af\u4f53\u5185\u90e8\u3002\u6240\u4ee5\u5982\u679c\u80fd\u8ba9\u5faa\u73af\u4f53\u5e76\u53d1\u6267\u884c\uff0c\u90a3\u4e48\u6027\u80fd\u5c31\u4f1a\u63d0\u9ad8\u5f88\u591a\u3002<\/p>\n<p><a href=\"http:\/\/yankaycom-wordpress.stor.sinaapp.com\/uploads\/2012\/12\/8222798782_fde085e7e5_b.jpg\"><img decoding=\"async\" alt=\"\" src=\"http:\/\/yankaycom-wordpress.stor.sinaapp.com\/uploads\/2012\/12\/8222798782_fde085e7e5_b.jpg\" title=\"\u5e76\u53d1\u5faa\u73af\" class=\"alignnone\"\/><\/a><\/p>\n<p>\u8981\u5e76\u53d1\u5faa\u73af\u5f88\u7b80\u5355\uff0c\u53ea\u6709\u5728\u6bcf\u4e2a\u5faa\u73af\u4f53\u5185\u90e8\u542f\u52a8\u534f\u7a0b\u3002\u534f\u7a0b\u4f5c\u4e3a\u5faa\u73af\u4f53\u53ef\u4ee5\u5e76\u53d1\u6267\u884c\u3002\u8c03\u7528\u542f\u52a8\u524d\u8bbe\u7f6e\u4e00\u4e2a\u8ba1\u6570\u5668\uff0c\u6bcf\u4e00\u4e2a\u5faa\u73af\u4f53\u6267\u884c\u5b8c\u6bd5\u5c31\u5728\u8ba1\u6570\u5668\u4e0a\u52a0\u4e00\u4e2a\u5143\u7d20\uff0c\u8c03\u7528\u5b8c\u6210\u540e\u901a\u8fc7\u76d1\u542c\u8ba1\u6570\u5668\u7b49\u5f85\u5faa\u73af\u534f\u7a0b\u5168\u90e8\u5b8c\u6210\u3002<\/p>\n<pre lang=\"go\">\/\/\u5efa\u7acb\u8ba1\u6570\u5668\nsem := make(chan int, N); \n\/\/FOR\u5faa\u73af\u4f53\nfor i,xi := range data {\n\t\/\/\u5efa\u7acb\u534f\u7a0b\n    go func (i int, xi float) {\n        doSomething(i,xi);\n\t\t\/\/\u8ba1\u6570\n        sem <- 0;\n    } (i, xi);\n}\n\/\/ \u7b49\u5f85\u5faa\u73af\u7ed3\u675f\nfor i := 0; i < N; ++i { <-sem }<\/pre>\n<p>\u4e0a\u9762\u662f\u4e00\u4e2a\u5e76\u53d1\u5faa\u73af\u4f8b\u5b50\u3002\u901a\u8fc7\u8ba1\u6570\u5668\u6765\u7b49\u5f85\u5faa\u73af\u5168\u90e8\u5b8c\u6210\u3002\u5982\u679c\u7ed3\u5408\u4e0a\u9762\u63d0\u5230\u7684Future\u6280\u672f\u7684\u8bdd\uff0c\u5219\u4e0d\u5fc5\u7b49\u5f85\u3002\u53ef\u4ee5\u7b49\u5230\u771f\u6b63\u9700\u8981\u7684\u7ed3\u679c\u7684\u5730\u65b9\uff0c\u518d\u53bb\u68c0\u67e5\u6570\u636e\u662f\u5426\u5b8c\u6210\u3002<\/p>\n<p>\u901a\u8fc7\u5e76\u53d1\u5faa\u73af\u53ef\u4ee5\u63d0\u4f9b\u6027\u80fd\uff0c\u5229\u7528\u591a\u6838\uff0c\u89e3\u51b3CPU\u70ed\u70b9\u3002\u6b63\u56e0\u4e3a\u534f\u7a0b\u53ef\u4ee5\u5927\u91cf\u521b\u5efa\uff0c\u624d\u80fd\u5728\u5faa\u73af\u4f53\u4e2d\u5982\u6b64\u4f7f\u7528\uff0c\u5982\u679c\u662f\u4f7f\u7528\u7ebf\u7a0b\u7684\u8bdd\uff0c\u5c31\u9700\u8981\u5f15\u5165\u7ebf\u7a0b\u6c60\u4e4b\u7c7b\u7684\u4e1c\u897f\uff0c\u9632\u6b62\u521b\u5efa\u8fc7\u591a\u7ebf\u7a0b\uff0c\u800c\u534f\u7a0b\u5219\u7b80\u5355\u7684\u591a\u3002<\/p>\n<h4>Chain Filter\u6280\u672f<\/h4>\n<p>\u524d\u9762\u63d0\u5230\u4e86Future\u6280\u672f\u9996\u5c3e\u76f8\u8fde\uff0c\u53ef\u4ee5\u5f62\u6210\u4e00\u4e2a\u5e76\u53d1\u7684pipe filter\u3002\u8fd9\u79cd\u65b9\u5f0f\u53ef\u4ee5\u505a\u5f88\u591a\u4e8b\u60c5\uff0c\u5982\u679c\u6bcf\u4e2aFilter\u90fd\u7531\u540c\u4e00\u4e2a\u51fd\u6570\u7ec4\u6210\uff0c\u8fd8\u53ef\u4ee5\u6709\u4e00\u79cd\u7b80\u5355\u7684\u529e\u6cd5\u628a\u4ed6\u4eec\u8fde\u8d77\u6765\u3002<\/p>\n<p><a href=\"http:\/\/yankaycom-wordpress.stor.sinaapp.com\/uploads\/2012\/12\/8221723011_9f24150b79_b.jpg\"><img decoding=\"async\" alt=\"\" src=\"http:\/\/yankaycom-wordpress.stor.sinaapp.com\/uploads\/2012\/12\/8221723011_9f24150b79_b.jpg\" title=\"Chain\" class=\"alignnone\"  \/><\/a><\/p>\n<p>\u7531\u4e8e\u6bcf\u4e2aFilter\u534f\u7a0b\u90fd\u53ef\u4ee5\u5e76\u53d1\u8fd0\u884c\uff0c\u8fd9\u6837\u7684\u7ed3\u6784\u975e\u5e38\u6709\u5229\u4e8e\u591a\u6838\u73af\u5883\u3002\u4e0b\u9762\u662f\u4e00\u4e2a\u4f8b\u5b50\uff0c\u7528\u8fd9\u79cd\u6a21\u5f0f\u6765\u4ea7\u751f\u7d20\u6570\u3002<\/p>\n<pre>\/\/ A concurrent prime sieve\n\npackage main\n\n\/\/ Send the sequence 2, 3, 4, ... to channel 'ch'.\nfunc Generate(ch chan<- int) {\n\tfor i := 2; ; i++ {\n\t\tch <- i \/\/ Send 'i' to channel 'ch'.\n\t}\n}\n\n\/\/ Copy the values from channel 'in' to channel 'out',\n\/\/ removing those divisible by 'prime'.\nfunc Filter(in <-chan int, out chan<- int, prime int) {\n\tfor {\n\t\ti := <-in \/\/ Receive value from 'in'.\n\t\tif i%prime != 0 {\n\t\t\tout <- i \/\/ Send 'i' to 'out'.\n\t\t}\n\t}\n}\n\n\/\/ The prime sieve: Daisy-chain Filter processes.\nfunc main() {\n\tch := make(chan int) \/\/ Create a new channel.\n\tgo Generate(ch)      \/\/ Launch Generate goroutine.\n\tfor i := 0; i < 10; i++ {\n\t\tprime := <-ch\n\t\tprint(prime, \"n\")\n\t\tch1 := make(chan int)\n\t\tgo Filter(ch, ch1, prime)\n\t\tch = ch1\n\t}\n}<\/pre>\n<p>\u4e0a\u9762\u7684\u7a0b\u5e8f\u521b\u5efa\u4e8610\u4e2aFilter\uff0c\u6bcf\u4e2a\u5206\u522b\u8fc7\u6ee4\u4e00\u4e2a\u7d20\u6570\uff0c\u6240\u4ee5\u53ef\u4ee5\u8f93\u51fa\u524d10\u4e2a\u7d20\u6570\u3002<\/p>\n<p>Chain-Filter\u901a\u8fc7\u7b80\u5355\u7684\u4ee3\u7801\u521b\u5efa\u5e76\u53d1\u7684\u8fc7\u6ee4\u5668\u94fe\u3002\u8fd9\u79cd\u529e\u6cd5\u8fd8\u6709\u4e00\u4e2a\u597d\u5904\uff0c\u5c31\u662f\u6bcf\u4e2a\u901a\u9053\u53ea\u6709\u4e24\u4e2a\u534f\u7a0b\u4f1a\u8bbf\u95ee\uff0c\u5c31\u4e0d\u4f1a\u6709\u6fc0\u70c8\u7684\u7ade\u4e89\uff0c\u6027\u80fd\u4f1a\u6bd4\u8f83\u597d\u3002<\/p>\n<h4>\u5171\u4eab\u53d8\u91cf<\/h4>\n<h4><\/h4>\n<p>&nbsp;<\/p>\n<p>\u534f\u7a0b\u4e4b\u95f4\u7684\u901a\u4fe1\u53ea\u80fd\u591f\u901a\u8fc7\u901a\u9053\u3002\u4f46\u662f\u6211\u4eec\u4e60\u60ef\u4e8e\u5171\u4eab\u53d8\u91cf\uff0c\u800c\u4e14\u5f88\u591a\u65f6\u5019\u4f7f\u7528\u5171\u4eab\u53d8\u91cf\u80fd\u8ba9\u4ee3\u7801\u66f4\u7b80\u6d01\u3002\u6bd4\u5982\u4e00\u4e2aServer\u6709\u4e24\u4e2a\u72b6\u6001\u5f00\u548c\u5173\u3002\u5176\u4ed6\u4ec5\u4ec5\u5e0c\u671b\u83b7\u53d6\u6216\u6539\u53d8\u5176\u72b6\u6001\uff0c\u90a3\u53c8\u8be5\u5982\u4f55\u505a\u5462\u3002\u53ef\u4ee5\u5c06\u8fd9\u4e2a\u53d8\u91cf\u81f3\u4e8e0\u901a\u9053\u4e2d\uff0c\u5e76\u4f7f\u7528\u4e00\u4e2a\u534f\u7a0b\u6765\u7ef4\u62a4\u3002<\/p>\n<p><a href=\"http:\/\/yankaycom-wordpress.stor.sinaapp.com\/uploads\/2012\/12\/8221722957_c37a8f856b_b.jpg\"><img decoding=\"async\" alt=\"\" src=\"http:\/\/yankaycom-wordpress.stor.sinaapp.com\/uploads\/2012\/12\/8221722957_c37a8f856b_b.jpg\" title=\"\u5171\u4eab\u53d8\u91cf\" class=\"alignnone\"  \/><\/a><\/p>\n<p>\u4e0b\u9762\u7684\u4f8b\u5b50\u63cf\u8ff0\u5982\u4f55\u7528\u8fd9\u4e2a\u65b9\u5f0f\uff0c\u5b9e\u73b0\u4e00\u4e2a\u5171\u4eab\u53d8\u91cf\u3002<\/p>\n<pre>\/\/\u5171\u4eab\u53d8\u91cf\u6709\u4e00\u4e2a\u8bfb\u901a\u9053\u548c\u4e00\u4e2a\u5199\u901a\u9053\u7ec4\u6210\ntype sharded_var struct {\n\treader chan int\n\twriter chan int\n}\n\n\/\/\u5171\u4eab\u53d8\u91cf\u7ef4\u62a4\u534f\u7a0b\nfunc sharded_var_whachdog(v sharded_var) {\n\tgo func() {\n\t\t\/\/\u521d\u59cb\u503c\n\t\tvar value int = 0\n\t\tfor {\n\t\t\t\/\/\u76d1\u542c\u8bfb\u5199\u901a\u9053\uff0c\u5b8c\u6210\u670d\u52a1\n\t\t\tselect {\n\t\t\tcase value = <-v.writer:\n\t\t\tcase v.reader <- value:\n\t\t\t}\n\t\t}\n\t}()\n}\n\nfunc main() {\n\t\/\/\u521d\u59cb\u5316\uff0c\u5e76\u5f00\u59cb\u7ef4\u62a4\u534f\u7a0b\n\tv := sharded_var{make(chan int), make(chan int)}\n\tsharded_var_whachdog(v)\n\n\t\/\/\u8bfb\u53d6\u521d\u59cb\u503c\n\tfmt.Println(<-v.reader)\n\t\/\/\u5199\u5165\u4e00\u4e2a\u503c\n\tv.writer <- 1\n\t\/\/\u8bfb\u53d6\u65b0\u5199\u5165\u7684\u503c\n\tfmt.Println(<-v.reader)\n}<\/pre>\n<p>\u8fd9\u6837\uff0c\u5c31\u53ef\u4ee5\u5728\u534f\u7a0b\u548c\u901a\u9053\u7684\u57fa\u7840\u4e0a\u5b9e\u73b0\u4e00\u4e2a\u534f\u7a0b\u5b89\u5168\u7684\u5171\u4eab\u53d8\u91cf\u4e86\u3002\u5b9a\u4e49\u4e00\u4e2a\u5199\u901a\u9053\uff0c\u9700\u8981\u66f4\u65b0\u53d8\u91cf\u7684\u65f6\u5019\uff0c\u5f80\u91cc\u5199\u65b0\u7684\u503c\u3002\u518d\u5b9a\u4e49\u4e00\u4e2a\u8bfb\u901a\u9053\uff0c\u9700\u8981\u8bfb\u7684\u65f6\u5019\uff0c\u4ece\u91cc\u9762\u8bfb\u3002\u901a\u8fc7\u4e00\u4e2a\u5355\u72ec\u7684\u534f\u7a0b\u6765\u7ef4\u62a4\u8fd9\u4e24\u4e2a\u901a\u9053\u3002\u4fdd\u8bc1\u6570\u636e\u7684\u4e00\u81f4\u6027\u3002<\/p>\n<p>\u4e00\u822c\u6765\u8bf4\uff0c\u534f\u7a0b\u4e4b\u95f4\u4e0d\u63a8\u8350\u4f7f\u7528\u5171\u4eab\u53d8\u91cf\u6765\u4ea4\u4e92\uff0c\u4f46\u662f\u6309\u7167\u8fd9\u4e2a\u529e\u6cd5\uff0c\u5728\u4e00\u4e9b\u573a\u5408\uff0c\u4f7f\u7528\u5171\u4eab\u53d8\u91cf\u4e5f\u662f\u53ef\u53d6\u7684\u3002\u5f88\u591a\u5e73\u53f0\u4e0a\u6709\u8f83\u4e3a\u539f\u751f\u7684\u5171\u4eab\u53d8\u91cf\u652f\u6301\uff0c\u5230\u5e95\u7528\u90a3\u79cd\u5b9e\u73b0\u6bd4\u8f83\u597d\uff0c\u5c31\u89c1\u4ec1\u89c1\u667a\u4e86\u3002\u53e6\u5916\u5229\u7528\u534f\u7a0b\u548c\u901a\u9053\uff0c\u53ef\u4ee5\u8fd8\u5b9e\u73b0\u5404\u79cd\u5e38\u89c1\u7684\u5e76\u53d1\u6570\u636e\u7ed3\u6784\uff0c\u5982\u9501\u7b49\u7b49\uff0c\u5c31\u4e0d\u4e00\u4e00\u8d58\u8ff0\u3002<\/p>\n<h4>\u534f\u7a0b\u6cc4\u6f0f<\/h4>\n<p>\u534f\u7a0b\u548c\u5185\u5b58\u4e00\u6837\uff0c\u662f\u7cfb\u7edf\u7684\u8d44\u6e90\u3002\u5bf9\u4e8e\u5185\u5b58\uff0c\u6709\u81ea\u52a8\u5783\u573e\u56de\u6536\u3002\u4f46\u662f\u5bf9\u4e8e\u534f\u7a0b\uff0c\u6ca1\u6709\u76f8\u5e94\u7684\u56de\u6536\u673a\u5236\u3002\u4f1a\u4e0d\u4f1a\u82e5\u5e72\u5e74\u540e\uff0c\u534f\u7a0b\u666e\u53ca\u4e86\uff0c\u534f\u7a0b\u6cc4\u6f0f\u548c\u5185\u5b58\u6cc4\u6f0f\u4e00\u6837\u6210\u4e3a\u7a0b\u5e8f\u5458\u6c38\u8fdc\u7684\u75db\u5462\uff1f\u4e00\u822c\u800c\u8a00\uff0c\u534f\u7a0b\u6267\u884c\u7ed3\u675f\u540e\u5c31\u4f1a\u9500\u6bc1\u3002\u534f\u7a0b\u4e5f\u4f1a\u5360\u7528\u5185\u5b58\uff0c\u5982\u679c\u53d1\u751f\u534f\u7a0b\u6cc4\u6f0f\uff0c\u5f71\u54cd\u548c\u5185\u5b58\u6cc4\u6f0f\u4e00\u6837\u4e25\u91cd\u3002\u8f7b\u5219\u62d6\u6162\u7a0b\u5e8f\uff0c\u91cd\u5219\u538b\u57ae\u673a\u5668\u3002<\/p>\n<p>C\u548cC++\u90fd\u662f\u6ca1\u6709\u81ea\u52a8\u5185\u5b58\u56de\u6536\u7684\u7a0b\u5e8f\u8bbe\u8ba1\u8bed\u8a00\uff0c\u4f46\u53ea\u8981\u6709\u826f\u597d\u7684\u7f16\u7a0b\u4e60\u60ef\uff0c\u5c31\u80fd\u89e3\u51b3\u89c4\u907f\u95ee\u9898\u3002\u5bf9\u4e8e\u534f\u7a0b\u662f\u4e00\u6837\u7684\uff0c\u53ea\u8981\u6709\u597d\u4e60\u60ef\u5c31\u53ef\u4ee5\u4e86\u3002<\/p>\n<p>\u53ea\u6709\u4e24\u79cd\u60c5\u51b5\u4f1a\u5bfc\u81f4\u534f\u7a0b\u65e0\u6cd5\u7ed3\u675f\u3002\u4e00\u79cd\u60c5\u51b5\u662f\u534f\u7a0b\u60f3\u4ece\u4e00\u4e2a\u901a\u9053\u8bfb\u6570\u636e\uff0c\u4f46\u65e0\u4eba\u5f80\u8fd9\u4e2a\u901a\u9053\u5199\u5165\u6570\u636e\uff0c\u6216\u8bb8\u8fd9\u4e2a\u901a\u9053\u5df2\u7ecf\u88ab\u9057\u5fd8\u4e86\u3002\u8fd8\u6709\u4e00\u79cd\u60c5\u51b5\u662f\u7a0b\u60f3\u5f80\u4e00\u4e2a\u901a\u9053\u5199\u6570\u636e\uff0c\u53ef\u662f\u7531\u4e8e\u65e0\u4eba\u76d1\u542c\u8fd9\u4e2a\u901a\u9053\uff0c\u8be5\u534f\u7a0b\u5c06\u6c38\u8fdc\u65e0\u6cd5\u5411\u4e0b\u6267\u884c\u3002\u4e0b\u9762\u5206\u522b\u8ba8\u8bba\u5982\u4f55\u907f\u514d\u8fd9\u4e24\u79cd\u60c5\u51b5\u3002<\/p>\n<p>\u5bf9\u4e8e\u534f\u7a0b\u60f3\u4ece\u4e00\u4e2a\u901a\u9053\u8bfb\u6570\u636e\uff0c\u4f46\u65e0\u4eba\u5f80\u8fd9\u4e2a\u901a\u9053\u5199\u5165\u6570\u636e\u8fd9\u79cd\u60c5\u51b5\u3002\u89e3\u51b3\u7684\u529e\u6cd5\u5f88\u7b80\u5355\uff0c\u52a0\u5165\u8d85\u65f6\u673a\u5236\u3002\u5bf9\u4e8e\u6709\u4e0d\u786e\u5b9a\u4f1a\u4e0d\u4f1a\u8fd4\u56de\u7684\u60c5\u51b5\uff0c\u5fc5\u987b\u52a0\u5165\u8d85\u65f6\uff0c\u907f\u514d\u51fa\u73b0\u6c38\u4e45\u7b49\u5f85\u3002\u53e6\u5916\u4e0d\u4e00\u5b9a\u8981\u4f7f\u7528\u5b9a\u65f6\u5668\u624d\u80fd\u7ec8\u6b62\u534f\u7a0b\u3002\u4e5f\u53ef\u4ee5\u5bf9\u5916\u66b4\u9732\u4e00\u4e2a\u9000\u51fa\u63d0\u9192\u901a\u9053\u3002\u4efb\u4f55\u5176\u4ed6\u534f\u7a0b\u90fd\u53ef\u4ee5\u901a\u8fc7\u8be5\u901a\u9053\u6765\u63d0\u9192\u8fd9\u4e2a\u534f\u7a0b\u7ec8\u6b62\u3002<\/p>\n<p><a href=\"http:\/\/yankaycom-wordpress.stor.sinaapp.com\/uploads\/2012\/12\/8221722905_fbb0e6d2cb_z.jpg\"><img decoding=\"async\" alt=\"\" src=\"http:\/\/yankaycom-wordpress.stor.sinaapp.com\/uploads\/2012\/12\/8221722905_fbb0e6d2cb_z.jpg\" title=\"\u6cc4\u6f0f\" class=\"alignnone\"  \/><\/a><\/p>\n<p>\u5bf9\u4e8e\u534f\u7a0b\u60f3\u5f80\u4e00\u4e2a\u901a\u9053\u5199\u6570\u636e\uff0c\u4f46\u901a\u9053\u963b\u585e\u65e0\u6cd5\u5199\u5165\u8fd9\u79cd\u60c5\u51b5\u3002\u89e3\u51b3\u7684\u529e\u6cd5\u4e5f\u5f88\u7b80\u5355\uff0c\u5c31\u662f\u7ed9\u901a\u9053\u52a0\u7f13\u51b2\u3002\u4f46\u524d\u63d0\u662f\u8fd9\u4e2a\u901a\u9053\u53ea\u4f1a\u63a5\u6536\u5230\u56fa\u5b9a\u6570\u76ee\u7684\u5199\u5165\u3002\u6bd4\u65b9\u8bf4\uff0c\u5df2\u77e5\u4e00\u4e2a\u901a\u9053\u6700\u591a\u53ea\u4f1a\u63a5\u6536N\u6b21\u6570\u636e\uff0c\u90a3\u4e48\u5c31\u5c06\u8fd9\u4e2a\u901a\u9053\u7684\u7f13\u51b2\u8bbe\u7f6e\u4e3aN\u3002\u90a3\u4e48\u8be5\u901a\u9053\u5c06\u6c38\u8fdc\u4e0d\u4f1a\u5835\u585e\uff0c\u534f\u7a0b\u81ea\u7136\u4e5f\u4e0d\u4f1a\u6cc4\u6f0f\u3002\u4e5f\u53ef\u4ee5\u5c06\u5176\u7f13\u51b2\u8bbe\u7f6e\u4e3a\u65e0\u9650\uff0c\u4e0d\u8fc7\u8fd9\u6837\u5c31\u8981\u627f\u62c5\u5185\u5b58\u6cc4\u6f0f\u7684\u98ce\u9669\u4e86\u3002\u7b49\u534f\u7a0b\u6267\u884c\u5b8c\u6bd5\u540e\uff0c\u8fd9\u90e8\u5206\u901a\u9053\u5185\u5b58\u5c06\u4f1a\u5931\u53bb\u5f15\u7528\uff0c\u4f1a\u88ab\u81ea\u52a8\u5783\u573e\u56de\u6536\u6389\u3002<\/p>\n<pre>func never_leak(ch chan int) {\n\t\/\/\u521d\u59cb\u5316timeout\uff0c\u7f13\u51b2\u4e3a1\n\ttimeout := make(chan bool, 1)\n\t\/\/\u542f\u52a8timeout\u534f\u7a0b\uff0c\u7531\u4e8e\u7f13\u5b58\u4e3a1\uff0c\u4e0d\u53ef\u80fd\u6cc4\u9732\n\tgo func() {\n\t\ttime.Sleep(1 * time.Second)\n\t\ttimeout <- true\n\t}()\n\t\/\/\u76d1\u542c\u901a\u9053\uff0c\u7531\u4e8e\u8bbe\u6709\u8d85\u65f6\uff0c\u4e0d\u53ef\u80fd\u6cc4\u9732\n\tselect {\n\tcase <-ch:\n\t\t\/\/ a read from ch has occurred\n\tcase <-timeout:\n\t\t\/\/ the read from ch has timed out\n\t}\n}<\/pre>\n<p>\u4e0a\u9762\u662f\u4e2a\u907f\u514d\u6cc4\u6f0f\u4f8b\u5b50\u3002\u4f7f\u7528\u8d85\u65f6\u907f\u514d\u8bfb\u5835\u585e\uff0c\u4f7f\u7528\u7f13\u51b2\u907f\u514d\u5199\u5835\u585e\u3002<\/p>\n<p>\u548c\u5185\u5b58\u91cc\u9762\u7684\u5bf9\u8c61\u4e00\u6837\uff0c\u5bf9\u4e8e\u957f\u671f\u5b58\u5728\u7684\u534f\u7a0b\uff0c\u6211\u4eec\u4e0d\u7528\u62c5\u5fc3\u6cc4\u6f0f\u95ee\u9898\u3002\u4e00\u662f\u957f\u671f\u5b58\u5728\uff0c\u4e8c\u662f\u6570\u91cf\u8f83\u5c11\u3002\u8981\u8b66\u60d5\u7684\u53ea\u6709\u90a3\u4e9b\u88ab\u4e34\u65f6\u521b\u5efa\u7684\u534f\u7a0b\uff0c\u8fd9\u4e9b\u534f\u7a0b\u6570\u91cf\u5927\u4e14\u751f\u547d\u5468\u671f\u77ed\uff0c\u5f80\u5f80\u662f\u5728\u5faa\u73af\u4e2d\u521b\u5efa\u7684\uff0c\u8981\u5e94\u7528\u524d\u9762\u63d0\u5230\u7684\u529e\u6cd5\uff0c\u907f\u514d\u6cc4\u6f0f\u53d1\u751f\u3002\u534f\u7a0b\u4e5f\u662f\u628a\u53cc\u5203\u5251\uff0c\u5982\u679c\u51fa\u95ee\u9898\uff0c\u4e0d\u4f46\u6ca1\u80fd\u63d0\u9ad8\u7a0b\u5e8f\u6027\u80fd\uff0c\u53cd\u800c\u4f1a\u8ba9\u7a0b\u5e8f\u5d29\u6e83\u3002\u4f46\u5c31\u50cf\u5185\u5b58\u4e00\u6837\uff0c\u540c\u6837\u6709\u6cc4\u6f0f\u7684\u98ce\u9669\uff0c\u4f46\u8d8a\u7528\u8d8a\u6e9c\u4e86\u3002<\/p>\n<h3>\u5e76\u53d1\u6a21\u5f0f\u4e4b\u5b9e\u73b0<\/h3>\n<p>\u5728\u5e76\u53d1\u7f16\u7a0b\u5927\u884c\u5176\u9053\u7684\u4eca\u5929\uff0c\u5bf9\u534f\u7a0b\u548c\u901a\u9053\u7684\u652f\u6301\u6210\u4e3a\u5404\u4e2a\u5e73\u53f0\u6bd4\u4e0d\u53ef\u5c11\u7684\u4e00\u90e8\u5206\u3002\u867d\u7136\u5404\u5bb6\u6709\u5404\u5bb6\u7684\u53eb\u6cd5\uff0c\u4f46\u90fd\u80fd\u6ee1\u8db3\u534f\u7a0b\u7684\u57fa\u672c\u8981\u6c42\u2014\u5e76\u53d1\u6267\u884c\u548c\u53ef\u5927\u91cf\u521b\u5efa\u3002\u7b14\u8005\u5bf9\u4ed6\u4eec\u7684\u5b9e\u73b0\u65b9\u5f0f\u603b\u7ed3\u4e86\u4e00\u4e0b\u3002<\/p>\n<p>\u4e0b\u9762\u5217\u4e3e\u4e00\u4e9b\u5df2\u7ecf\u652f\u6301\u534f\u7a0b\u7684\u5e38\u89c1\u7684\u8bed\u8a00\u548c\u5e73\u53f0\u3002<\/p>\n<td \"=\"\"&gt;\u5907\u6ce8\n\n\n<table border=\"1\" cellspacing=\"0\" cellpadding=\"0\">\n<tbody>\n<tr>\n<td>\u8bed\u8a00\/\u5e73\u53f0<\/td>\n<td>\u5b9e\u73b0\u65f6\u95f4<\/td>\n<td>\u534f\u7a0b\u540d\u79f0<\/td>\n<td>\u5907\u6ce8<\/td>\n<\/tr>\n<tr>\n<td>GoLang<\/td>\n<td>\u539f\u751f\u652f\u6301<\/td>\n<td>goroutines<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Erlang<\/td>\n<td>\u539f\u751f\u652f\u6301<\/td>\n<td>process<\/td>\n<td>\u51fd\u6570\u5f0f\u8bed\u8a00<\/td>\n<\/tr>\n<tr>\n<td>Scala<\/td>\n<td>\u539f\u751f\u652f\u6301<\/td>\n<td>actor<\/td>\n<td>\u51fd\u6570\u5f0f\u7f16\u7a0b<\/td>\n<\/tr>\n<tr>\n<td>Python<\/td>\n<td>2.5\u7248\u672c\u540e<\/td>\n<td>coroutine<\/td>\n<td>\u5b98\u65b9Python\u4e0d\u5b8c\u5168\u5b9e\u73b0<br \/>\nStackless Python\u652f\u6301<\/td>\n<\/tr>\n<tr>\n<td>Perl<\/td>\n<td>6.0\u7248\u672c\u540e<\/td>\n<td>coroutine<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Ruby<\/td>\n<td>1.9 \u7248\u672c\u540e<\/td>\n<td>fiber<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>Lua<\/td>\n<td>\u539f\u751f\u652f\u6301<\/td>\n<td>coroutine<\/td>\n<td><\/td>\n<\/tr>\n<tr>\n<td>C#<\/td>\n<td>.net 2.0\u7248\u672c\u540e<\/td>\n<td>fiber<\/td>\n<td><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>GoLang \u548cScala\u4f5c\u4e3a\u6700\u65b0\u7684\u8bed\u8a00\uff0c\u4e00\u51fa\u751f\u5c31\u6709\u5b8c\u5584\u7684\u57fa\u4e8e\u534f\u7a0b\u5e76\u53d1\u529f\u80fd\u3002Erlang\u6700\u4e3a\u8001\u8d44\u683c\u7684\u5e76\u53d1\u7f16\u7a0b\u8bed\u8a00\uff0c\u8fd4\u8001\u8fd8\u7ae5\u3002\u5176\u4ed6\u4e8c\u7ebf\u8bed\u8a00\u5219\u51e0\u4e4e\u5168\u90e8\u5728\u65b0\u7684\u7248\u672c\u4e2d\u52a0\u5165\u4e86\u534f\u7a0b\u3002<\/p>\n<p>\u4ee4\u4eba\u60ca\u5947\u7684\u662fC\/C++\u548cJava\u8fd9\u4e09\u4e2a\u4e16\u754c\u4e0a\u6700\u4e3b\u6d41\u7684\u5e73\u53f0\u6ca1\u6709\u5728\u5bf9\u534f\u7a0b\u63d0\u4f9b\u8bed\u8a00\u7ea7\u522b\u7684\u539f\u751f\u652f\u6301\u3002\u4ed6\u4eec\u90fd\u80cc\u8d1f\u7740\u539a\u91cd\u7684\u5386\u53f2\uff0c\u65e0\u6cd5\u6539\u53d8\uff0c\u4e5f\u65e0\u9700\u6539\u53d8\u3002\u4f46\u4ed6\u4eec\u8fd8\u6709\u5176\u4ed6\u7684\u529e\u6cd5\u4f7f\u7528\u534f\u7a0b\u3002<\/p>\n<p>Java\u5e73\u53f0\u6709\u5f88\u591a\u65b9\u6cd5\u5b9e\u73b0\u534f\u7a0b\uff1a<\/p>\n<ul>\n<li> \u4fee\u6539\u865a\u62df\u673a\uff1a\u5bf9JVM\u6253\u8865\u4e01\u6765\u5b9e\u73b0\u534f\u7a0b\uff0c\u8fd9\u6837\u7684\u5b9e\u73b0\u6548\u679c\u597d\uff0c\u4f46\u662f\u5931\u53bb\u4e86\u8de8\u5e73\u53f0\u7684\u597d\u5904<\/li>\n<li>\u4fee\u6539\u5b57\u8282\u7801\uff1a\u5728\u7f16\u8bd1\u5b8c\u6210\u540e\u589e\u5f3a\u5b57\u8282\u7801\uff0c\u6216\u8005\u4f7f\u7528\u65b0\u7684JVM\u8bed\u8a00\u3002\u7a0d\u7a0d\u589e\u52a0\u4e86\u7f16\u8bd1\u7684\u96be\u5ea6\u3002<\/li>\n<li>\u4f7f\u7528JNI\uff1a\u5728Jar\u5305\u4e2d\u4f7f\u7528JNI\uff0c\u8fd9\u6837\u6613\u4e8e\u4f7f\u7528\uff0c\u4f46\u662f\u4e0d\u80fd\u8de8\u5e73\u53f0\u3002<\/li>\n<li>\u4f7f\u7528\u7ebf\u7a0b\u6a21\u62df\u534f\u7a0b\uff1a\u4f7f\u534f\u7a0b\u91cd\u91cf\u7ea7\uff0c\u5b8c\u5168\u4f9d\u8d56JVM\u7684\u7ebf\u7a0b\u5b9e\u73b0\u3002<\/li>\n<\/ul>\n<p>\u5176\u4e2d\u4fee\u6539\u5b57\u8282\u7801\u7684\u65b9\u5f0f\u6bd4\u8f83\u5e38\u89c1\u3002\u56e0\u4e3a\u8fd9\u6837\u7684\u5b9e\u73b0\u529e\u6cd5\uff0c\u53ef\u4ee5\u5e73\u8861\u6027\u80fd\u548c\u79fb\u690d\u6027\u3002\u6700\u5177\u4ee3\u8868\u6027\u7684JVM\u8bed\u8a00Scala\u5c31\u80fd\u5f88\u597d\u7684\u652f\u6301\u534f\u7a0b\u5e76\u53d1\u3002\u6d41\u884c\u7684Java Actor\u6a21\u578b\u7c7b\u5e93akka\u4e5f\u662f\u7528\u4fee\u6539\u5b57\u8282\u7801\u7684\u65b9\u5f0f\u5b9e\u73b0\u7684\u534f\u7a0b\u3002<\/p>\n<p>\u5bf9\u4e8eC\u8bed\u8a00\uff0c\u534f\u7a0b\u548c\u7ebf\u7a0b\u4e00\u6837\u3002\u53ef\u4ee5\u4f7f\u7528\u5404\u79cd\u5404\u6837\u7684\u7cfb\u7edf\u8c03\u7528\u6765\u5b9e\u73b0\u3002\u534f\u7a0b\u4f5c\u4e3a\u4e00\u4e2a\u6bd4\u8f83\u9ad8\u7ea7\u7684\u6982\u5ff5\uff0c\u5b9e\u73b0\u65b9\u5f0f\u5b9e\u5728\u592a\u591a\uff0c\u5c31\u4e0d\u8ba8\u8bba\u4e86\u3002\u6bd4\u8f83\u4e3b\u6d41\u7684\u5b9e\u73b0\u6709libpcl, coro,lthread\u7b49\u7b49\u3002<\/p>\n<p>\u5bf9\u4e8eC++\uff0c\u6709Boost\u5b9e\u73b0\uff0c\u8fd8\u6709\u4e00\u4e9b\u5176\u4ed6\u5f00\u6e90\u5e93\u3002\u8fd8\u6709\u4e00\u95e8\u540d\u4e3a\u03bcC++\u8bed\u8a00\uff0c\u5728C++\u57fa\u7840\u4e0a\u63d0\u4f9b\u4e86\u5e76\u53d1\u6269\u5c55\u3002<\/p>\n<p>\u53ef\u89c1\u8fd9\u79cd\u7f16\u7a0b\u6a21\u578b\u5728\u4f17\u591a\u7684\u8bed\u8a00\u5e73\u53f0\u4e2d\u5df2\u7ecf\u5f97\u5230\u4e86\u5e7f\u6cdb\u7684\u652f\u6301\uff0c\u4e0d\u518d\u5c0f\u4f17\u3002\u5982\u679c\u60f3\u4f7f\u7528\u7684\u8bdd\uff0c\u968f\u65f6\u53ef\u4ee5\u52a0\u5230\u81ea\u5df1\u7684\u5de5\u5177\u7bb1\u4e2d\u3002<\/p>\n<h3>\u7ed3\u8bed<\/h3>\n<p>\u672c\u6587\u63a2\u8ba8\u4e86\u4e00\u4e2a\u6781\u5176\u7b80\u6d01\u7684\u5e76\u53d1\u6a21\u578b\u3002\u5728\u53ea\u6709\u534f\u7a0b\u548c\u901a\u9053\u8fd9\u4e24\u4e2a\u57fa\u672c\u5143\u4ef6\u7684\u60c5\u51b5\u4e0b\u3002\u53ef\u4ee5\u63d0\u4f9b\u4e30\u5bcc\u7684\u529f\u80fd\uff0c\u89e3\u51b3\u5f62\u5f62\u8272\u8272\u5b9e\u9645\u95ee\u9898\u3002\u800c\u4e14\u8fd9\u4e2a\u6a21\u578b\u5df2\u7ecf\u88ab\u5e7f\u6cdb\u7684\u5b9e\u73b0\uff0c\u6210\u4e3a\u6f6e\u6d41\u3002\u76f8\u4fe1\u8fd9\u79cd\u5e76\u53d1\u6a21\u578b\u7684\u529f\u80fd\u8fdc\u8fdc\u4e0d\u53ca\u6b64\uff0c\u4e00\u5b9a\u4e5f\u4f1a\u6709\u66f4\u591a\u66f4\u7b80\u6d01\u7684\u7528\u6cd5\u51fa\u73b0\u3002\u6216\u8bb8\u672a\u6765CPU\u6838\u5fc3\u6570\u76ee\u5c06\u548c\u4eba\u8111\u795e\u7ecf\u5143\u6570\u76ee\u4e00\u6837\u591a\uff0c\u5230\u90a3\u4e2a\u65f6\u5019\uff0c\u6211\u4eec\u53c8\u8981\u91cd\u65b0\u601d\u8003\u5e76\u53d1\u6a21\u578b\u4e86\u3002<\/p>\n","protected":false},"excerpt":{"rendered":"<p>\u591a\u6838\u5904\u7406\u5668\u8d8a\u6765\u8d8a\u666e\u53ca\u3002\u6709\u6ca1\u6709\u4e00\u79cd\u7b80\u5355\u7684\u529e\u6cd5\uff0c\u80fd\u591f\u8ba9\u6211\u4eec\u5199\u7684\u8f6f\u4ef6\u91ca\u653e\u591a\u6838\u7684\u5a01\u529b\uff1f\u662f\u6709\u7684\u3002\u968f\u7740Golang, Erlang, Scala\u7b49\u4e3a\u5e76\u53d1\u8bbe\u8ba1\u7684\u7a0b\u5e8f\u8bed\u8a00\u7684\u5174\u8d77\uff0c\u65b0\u7684\u5e76\u53d1\u6a21\u5f0f\u9010\u6e10\u6e05\u6670\u3002<\/p>\n<p><a class=\"excerpt-more\" href=\"http:\/\/yankay.com\/go-clear-concurreny\/\">\u9605\u8bfb\u66f4\u591a......<\/a><\/p>","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[5],"tags":[39,102,115],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Go-\u7b80\u6d01\u7684\u5e76\u53d1 - \u6211\u81ea\u7136<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"http:\/\/yankay.com\/go-clear-concurreny\/\" \/>\n<meta property=\"og:locale\" content=\"zh_CN\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Go-\u7b80\u6d01\u7684\u5e76\u53d1 - \u6211\u81ea\u7136\" \/>\n<meta property=\"og:description\" content=\"\u591a\u6838\u5904\u7406\u5668\u8d8a\u6765\u8d8a\u666e\u53ca\u3002\u6709\u6ca1\u6709\u4e00\u79cd\u7b80\u5355\u7684\u529e\u6cd5\uff0c\u80fd\u591f\u8ba9\u6211\u4eec\u5199\u7684\u8f6f\u4ef6\u91ca\u653e\u591a\u6838\u7684\u5a01\u529b\uff1f\u662f\u6709\u7684\u3002\u968f\u7740Golang, Erlang, Scala\u7b49\u4e3a\u5e76\u53d1\u8bbe\u8ba1\u7684\u7a0b\u5e8f\u8bed\u8a00\u7684\u5174\u8d77\uff0c\u65b0\u7684\u5e76\u53d1\u6a21\u5f0f\u9010\u6e10\u6e05\u6670\u3002\" \/>\n<meta property=\"og:url\" content=\"http:\/\/yankay.com\/go-clear-concurreny\/\" \/>\n<meta property=\"og:site_name\" content=\"\u6211\u81ea\u7136\" \/>\n<meta property=\"article:published_time\" content=\"2012-11-28T00:00:12+00:00\" \/>\n<meta property=\"og:image\" content=\"http:\/\/yankaycom-wordpress.stor.sinaapp.com\/uploads\/2012\/12\/8221722709_681613f47b_b.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"http:\/\/yankay.com\/#website\",\"url\":\"http:\/\/yankay.com\/\",\"name\":\"\\u6211\\u81ea\\u7136\",\"description\":\"\\u989c\\u5f00\\u7684\\u535a\\u5ba2\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"http:\/\/yankay.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"zh-CN\"},{\"@type\":\"ImageObject\",\"@id\":\"http:\/\/yankay.com\/go-clear-concurreny\/#primaryimage\",\"inLanguage\":\"zh-CN\",\"url\":\"http:\/\/yankaycom-wordpress.stor.sinaapp.com\/uploads\/2012\/12\/8221722709_681613f47b_b.jpg\",\"contentUrl\":\"http:\/\/yankaycom-wordpress.stor.sinaapp.com\/uploads\/2012\/12\/8221722709_681613f47b_b.jpg\"},{\"@type\":\"WebPage\",\"@id\":\"http:\/\/yankay.com\/go-clear-concurreny\/#webpage\",\"url\":\"http:\/\/yankay.com\/go-clear-concurreny\/\",\"name\":\"Go-\\u7b80\\u6d01\\u7684\\u5e76\\u53d1 - \\u6211\\u81ea\\u7136\",\"isPartOf\":{\"@id\":\"http:\/\/yankay.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"http:\/\/yankay.com\/go-clear-concurreny\/#primaryimage\"},\"datePublished\":\"2012-11-28T00:00:12+00:00\",\"dateModified\":\"2012-11-28T00:00:12+00:00\",\"author\":{\"@id\":\"http:\/\/yankay.com\/#\/schema\/person\/f52d918e9bfa51c4454172c2caa7704f\"},\"breadcrumb\":{\"@id\":\"http:\/\/yankay.com\/go-clear-concurreny\/#breadcrumb\"},\"inLanguage\":\"zh-CN\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"http:\/\/yankay.com\/go-clear-concurreny\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"http:\/\/yankay.com\/go-clear-concurreny\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"http:\/\/yankay.com\/\",\"url\":\"http:\/\/yankay.com\/\",\"name\":\"\\u9996\\u9875\"}},{\"@type\":\"ListItem\",\"position\":2,\"item\":{\"@id\":\"http:\/\/yankay.com\/go-clear-concurreny\/#webpage\"}}]},{\"@type\":\"Person\",\"@id\":\"http:\/\/yankay.com\/#\/schema\/person\/f52d918e9bfa51c4454172c2caa7704f\",\"name\":\"yankay\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"http:\/\/yankay.com\/#personlogo\",\"inLanguage\":\"zh-CN\",\"url\":\"http:\/\/1.gravatar.com\/avatar\/426bb830224c1471011d92a830a6ed4f?s=96&d=wavatar&r=g\",\"contentUrl\":\"http:\/\/1.gravatar.com\/avatar\/426bb830224c1471011d92a830a6ed4f?s=96&d=wavatar&r=g\",\"caption\":\"yankay\"},\"sameAs\":[\"http:\/\/47.100.65.109\"],\"url\":\"http:\/\/yankay.com\/author\/yankay\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/posts\/26525"}],"collection":[{"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/comments?post=26525"}],"version-history":[{"count":0,"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/posts\/26525\/revisions"}],"wp:attachment":[{"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/media?parent=26525"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/categories?post=26525"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/tags?post=26525"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}