{"id":26097,"date":"2010-10-23T22:53:30","date_gmt":"2010-10-23T14:53:30","guid":{"rendered":"http:\/\/www.yankay.com\/?p=26097"},"modified":"2010-10-23T22:53:30","modified_gmt":"2010-10-23T14:53:30","slug":"%e3%80%8a1988%ef%bc%9a%e6%88%91%e6%83%b3%e5%92%8c%e8%bf%99%e4%b8%aa%e4%b8%96%e7%95%8c%e8%b0%88%e8%b0%88%e3%80%8b%e4%b8%ad%e4%b8%81%e4%b8%81%e5%93%a5%e5%93%a5%e7%9a%84%e6%ad%bb%e5%9b%a0","status":"publish","type":"post","link":"http:\/\/yankay.com\/%e3%80%8a1988%ef%bc%9a%e6%88%91%e6%83%b3%e5%92%8c%e8%bf%99%e4%b8%aa%e4%b8%96%e7%95%8c%e8%b0%88%e8%b0%88%e3%80%8b%e4%b8%ad%e4%b8%81%e4%b8%81%e5%93%a5%e5%93%a5%e7%9a%84%e6%ad%bb%e5%9b%a0\/","title":{"rendered":"\u300a1988\uff1a\u6211\u60f3\u548c\u8fd9\u4e2a\u4e16\u754c\u8c08\u8c08\u300b\u4e2d\u4e01\u4e01\u54e5\u54e5\u7684\u6b7b\u56e0"},"content":{"rendered":"<p>\u5728\u97e9\u5bd2\u7684\u5c0f\u8bf4\u300a1988\uff1a\u6211\u60f3\u548c\u8fd9\u4e2a\u4e16\u754c\u8c08\u8c08\u300b\uff0c\u4e01\u4e01\u54e5\u54e5\u6c38\u8fdc\u662f\u653e\u5728\u5149\u7684\uff0c\u5c31\u50cf\u97e9\u5bd2\u4e00\u6837\u653e\u7740\u5149\u3002\u8be5\u6807\u9898\u4e5f\u53d6\u81ea\u4e8e\u4e01\u4e01\u54e5\u54e5\u7684\u4e00\u6bb5\u8bdd\u3002\u4e01\u4e01\u54e5\u54e5\u6b7b\u4e8e\u4e00\u6b21\u8fdc\u884c\uff0c\u539f\u56e0\u4f5c\u8005\u5374\u6ca1\u6709\u4ea4\u4ee3\uff0c\u5176\u5b9e\u4ed6\u5df2\u7ecf\u8bf4\u7684\u5f88\u660e\u767d\u4e86\u3002<\/p>\n<p><a href=\"http:\/\/book.douban.com\/subject\/5275059\/\"><img decoding=\"async\" src=\"http:\/\/img3.douban.com\/lpic\/s4477716.jpg\" style=\"border:0\"\/><\/a><\/p>\n<h3>\u7247\u6bb5\u4e00<\/h3>\n<pre style=\"width:95%\">\n\u4e01\u4e01\u54e5\u54e5\u7684\u8eab\u6750\u5f88\u597d\uff0c\u4ed6\u548c\u90a3\u4e9b\u4e66\u5446\u5b50\u4eec\u4e0d\u540c\uff0c\u4ed6\u559c\u6b22\u4f53\u80b2\uff0c\u5f88\u65e9\u8d64\u818a\u3002\u5728\u4e94\u6708\u91cc\uff0c\u4ed6\u5c31\u5f00\u59cb\u5149\u7740\u4e0a\u8eab\uff0c\u5bf9\u7740\u7bee\u7403\u67b6\u5f15\u4f53\u5411\u4e0a\u3002\u4ed6\u53ef\u4ee5\u505a\u4e09\u5341\u4e0b\uff0c\u6211\u53ef\u4ee5\u505a\u4e09\u4e0b\u3002\u4ed6\u6559\u6211\u5982\u4f55\u53cc\u624b\u63e1\u7740\u7bee\u7403\u67b6\u4e0a\u7684\u6a2a\u6760\u5728\u4e0a\u9762\u8f6c\u4e00\u5708\uff0c\u6211\u4e00\u4e2a\u590f\u5929\u90fd\u559c\u6b22\u4f9b\u7740\u7bee\u7403\u67b6\u6253\u8f6c\uff0c\u6211\u8863\u670d\u7684\u8179\u90e8\u90fd\u662f\u9508\u6c34\u3002\u4e01\u4e01\u54e5\u54e5\u6709\u4e00\u6b21\u751a\u81f3\u628a\u7bee\u7403\u67b6\u90fd\u62d4\u4e86\u8d77\u6765\uff0c\u6362\u4e86\u4e00\u4e2a\u5730\u65b9\uff0c\u56e0\u4e3a\u4ed6\u8bf4\u7bee\u7403\u67b6\u5728\u7684\u5730\u65b9\n\u4e0d\u597d\uff0c\u4ed6\u5728\u5b66\u4e60\u7684\u65f6\u5019\u6bcf\u5929\u90fd\u8981\u770b\u5230\uff0c\u8ba9\u4ed6\u5206\u5fc3\u3002\n\u6211\u76f8\u4fe1\uff0c\u4e01\u4e01\u54e5\u54e5\u90a3\u5929\u662f\u53bb\u627e\u4e86\u4e34\u65f6\u5de5\u54e5\u54e5\uff0c\u5e76\u4e14\u628a\u4ed6\u75db\u6253\u4e00\u987f\u3002\u4f46\u662f\u4e01\u4e01\u54e5\u54e5\u540e\u6765\u544a\u8bc9\u6211\uff0c\u4ed6\u53ea\u662f\u53bb\u8c08\u4e86\u8c08\uff0c\u4ed6\u8bf4\u6253\u67b6\u5f53\u7136\u80fd\u89e3\u51b3\u95ee\u9898\uff0c\u8c08\u4e5f\u80fd\u89e3\u51b3\u95ee\u9898\u3002\u6211\u8bf4\uff0c\u90a3\u4f60\u4e3a\u4ec0\u4e48\u4e0d\u50cf\u9999\u6e2f\u7535\u5f71\u91cc\u90a3\u6837\uff0c\u76f4\u63a5\u5c31\u6253\u67b6\u5462\uff1f\n\u4e01\u4e01\u54e5\u54e5\u6c89\u601d\u8bb8\u4e45\uff0c\u610f\u5473\u6df1\u957f\u5730\u770b\u7740\u6211\uff0c\u628a\u624b\u653e\u5728\u6211\u7684\u80a9\u8180\u4e0a\uff0c\u8bf4\uff0c\u56e0\u4e3a\u4f1a\u75bc\u561b\u3002\n\u6211\u70b9\u4e86\u70b9\u5934\u3002\n\u4e01\u4e01\u54e5\u54e5\u8bf4\uff0c\u4ed6\u5728\u5b66\u6821\u91cc\u662f\u5b66\u751f\u4f1a\u7684\u4e3b\u5e2d\uff0c\u6709\u7684\u4e8b\u60c5\uff0c\u9760\u8c08\u5c31\u641e\u5b9a\u4e86\uff0c\u4ed6\u6709\u9886\u5bfc\u80fd\u529b\u3002\u4e01\u4e01\u54e5\u54e5\u8bf4\uff0c\u90a3\u5929\uff0c\u6211\u53bb\u627e\u4e86\u4e34\u65f6\u5de5\u54e5\u54e5\uff0c\u95ee\u4ed6\u7f18\u7531\uff0c\u56e0\u4e3a\u50cf\u6211\u4eec\u8fd9\u79cd\u5927\u4eba\uff0c\u662f\u4e0d\u4f1a\u6253\u5f39\u5b50\u7684\u3002\n\u6211\u770b\u7740\u4e01\u4e01\u54e5\u54e5\uff0c\u4e01\u4e01\u54e5\u54e5\u4e00\u70b9\u5934\uff0c\u7ee7\u7eed\u8bf4\uff0c\u679c\u7136\u3002\n\u6211\u4e00\u7cbe\u795e\uff0c\u95ee\uff0c\u90a3\u662f\u4e3a\u4ec0\u4e48\u5462\uff0c\u4ed6\u8981\u548c\u6211\u4eec\u6253\u5f39\u5b50\u3002\n\u4e01\u4e01\u54e5\u54e5\u8bf4\uff0c\u56e0\u4e3a\u4ed6\u8981\u8d62\u4f60\u4eec\u7684\u5f39\u5b50\uff0c\u4ed6\u4e0d\u5149\u548c\u4f60\u4eec\u6253\uff0c\u4ed6\u8fd8\u548c\u522b\u7684\u5c0f\u5b69\u5b50\u6253\uff0c\u56e0\u4e3a\u4ed6\u8981\u4e70\u4e00\u53ea\u7ea2\u706f\u724c\u5f55\u97f3\u673a\u3002\n\u6211\u8bf4\uff0c\u55ef\u3002\n\u4e01\u4e01\u54e5\u54e5\u79c0\u4e86\u4e00\u4e0b\u80b1\u4e8c\u5934\u808c\uff0c\u8bf4\u9053\uff0c\u6211\u8bf4\uff0c\u4f60\u8fd9\u662f\u4e0d\u53ef\u4ee5\u7684\uff0c\u4f60\u8fd9\u662f\u6b3a\u8d1f\u5c0f\u5b69\u5b50\u3002\u4f60\u8981\u5f55\u97f3\u673a\u5e72\u4ec0\u4e48\uff1f\u4ed6\u8bf4\uff0c\u4ed6\u8981\u5f55\u4e00\u76d8\u78c1\u5e26\uff0c\u5531\u4e00\u9996\u6b4c\u5bc4\u7ed9\u4ed6\u7684\u7b14\u53cb\u3002\n\u6211\u8bf4\uff0c\u4ed6\u53ef\u4ee5\u53bb\u501f\u4e00\u53f0\u5f55\u554a\u3002\n\u4e01\u4e01\u54e5\u54e5\u8bf4\uff0c\u603b\u662f\u6709\u79c1\u5fc3\u7684\u561b\uff0c\u4ed6\u5f53\u7136\u4e5f\u60f3\u81ea\u5df1\u542c\u542c\uff0c\u540e\u6765\u6211\u5c31\u5e26\u4ed6\u53bb\u4e86\u6587\u5316\u7ad9\uff0c\u501f\u4e86\u6211\u4e00\u4e2a\u670b\u53cb\u7684\u5f55\u97f3\u673a\u3002\n\u6211\u8bf4\uff0c\u54c7\uff0c\u6587\u5316\u7ad9\u7684\u4eba\u4f60\u4e5f\u8ba4\u8bc6\u554a\u3002\n\u4e01\u4e01\u54e5\u54e5\u4e91\u6de1\u98ce\u8f7b\u9053\uff0c\u4e00\u4e2a\u670b\u53cb\u3002\n\u6211\u8bf4\uff0c\u90a3\u4e34\u65f6\u5de5\u54e5\u54e5\u5531\u4e86\u4e00\u9996\u4ec0\u4e48\u6b4c\u554a\u3002\n\u4e01\u4e01\u54e5\u54e5\u8bf4\uff0c\u4ed6\u5f55\u4e86\u4e00\u9996\u300a\u5c18\u7f18\u300b\u3002\n\u6211\u8bf4\uff0c\u4ec0\u4e48\u662f\u300a\u5c18\u7f18\u300b\u554a\uff1f\n\u4e01\u4e01\u54e5\u54e5\u8bf4\uff0c\u4f60\u7238\u5988\u4e0d\u770b\u7535\u89c6\u554a\uff0c\u4e3b\u9898\u6b4c\u3002\n\u6211\u8bf4\uff0c\u55ef\u3002\n\u4e01\u4e01\u54e5\u54e5\u54fc\u9053\uff0c\u5c18\u7f18\u5982\u68a6\uff0c\u51e0\u756a\u8d77\u4f0f\u603b\u4e0d\u5e73\uff0c\u7e41\u534e\u843d\u5c3d\uff0c\u4e00\u8eab\u6194\u60b4\u5728\u98ce\u91cc\uff0c\u56de\u5934\u65f6\u65e0\u6674\u4e5f\u65e0\u96e8\uff0c\u6f2b\u6f2b\u957f\u8def\uff0c\u8d77\u4f0f\u4e0d\u80fd\u7531\u6211\uff0c\u4eba\u6d77\u6f02\u6cca\uff0c\u5c1d\u5c3d\u4eba\u60c5\u6de1\u8584\uff0c\u70ed\u60c5\u70ed\u5fc3\uff0c\u6362\u51b7\u6de1\u51b7\u6f20\uff0c\u4efb\u591a\u5c11\u771f\u60c5\u72ec\u5411\u5bc2\u5bde\uff0c\u4eba\u968f\u98ce\u8fc7\uff0c\u81ea\u5728\u82b1\u5f00\u82b1\u53c8\u843d\uff0c\u4e0d\u7ba1\u4e16\u95f4\u6ca7\u6851\u5982\u4f55\n\u6211\u6253\u65ad\u4e86\u4e01\u4e01\u54e5\u54e5\uff0c\u7b11\u9053\uff0c\u54c8\u54c8\u54c8\u54c8\u54c8\u54c8\uff0c\u4e34\u65f6\u5de5\u54e5\u54e5\u4e5f\u4f1a\u5531\u6b4c\uff0c\u4e34\u65f6\u5de5\u54e5\u54e5\u4e5f\u4f1a\u5531\u6b4c\u3002\n\u6211\u6ca1\u6709\u610f\u8bc6\u5230\uff0c\u90a3\u4e00\u523b\u662f\u4e01\u4e01\u54e5\u54e5\u5728\u5531\u6b4c\uff0c\u8fd9\u662f\u6211\u7b2c\u4e00\u6b21\u542c\u4ed6\u5531\u6b4c\uff0c\u4f46\u662f\u6211\u5374\u6253\u65ad\u4e86\u4ed6\uff0c\n\u4e01\u4e01\u54e5\u54e5\u770b\u7740\u6211\u8bf4\uff0c\u6f2b\u6f2b\u957f\u8def\uff0c\u8d77\u4f0f\u4e0d\u80fd\u7531\u6211\u3002\n\u6211\u8ddf\u7740\u5531\u9053\uff0c\u6f2b\u6f2b\u957f\u8def\uff0c\u8d77\u4f0f\u4e0d\u80fd\u7531\u6211\u3002\n\u4e01\u4e01\u54e5\u54e5\u8bf4\uff0c\u8fd9\u662f\u53bb\u5e74\u7684\u6b4c\uff0c\u4eca\u5e74\u5531\u7740\u8fd8\u633a\u6709\u611f\u89c9\u3002\n\u6211\u8ddf\u7740\u8bf4\uff0c\u633a\u6709\u611f\u89c9\uff01\n\u4e01\u4e01\u54e5\u54e5\u7b54\u5e94\u5728\u90a3\u4e2a\u590f\u5929\u6559\u6211\u8db3\u7403\u4e2d\u7684\u5047\u52a8\u4f5c\uff0c\u4e01\u4e01\u54e5\u54e5\u8bf4\u6211\u8e22\u7403\u592a\u8001\u5b9e\u4e86\uff0c\u5f80\u5de6\u5c31\u662f\u5f80\u5de6\uff0c\u5f80\u53f3\u5c31\u662f\u5f80\u53f3\uff0c\u4f60\u7684\u8eab\u4f53\u5df2\u7ecf\u544a\u8bc9\u4e86\u5bf9\u624b\u4e00\u5207\u3002\u4f60\u8981\u628a\u7403\u8e22\u597d\uff0c\u8981\u628a\u7403\u63a7\u5236\u5728\u81ea\u5df1\u7684\u811a\u4e0b\uff0c\u5c31\u8981\u5b66\u4f1a\u5047\u52a8\u4f5c\uff0c\u4f60\u773c\u775b\u770b\u7740\u53f3\u8fb9\uff0c\u8eab\u4f53\u6643\u5411\u53f3\u8fb9\uff0c\u4f60\u4f38\u51fa\u53f3\u811a\uff0c\u5927\u5bb6\u90fd\u4ee5\u4e3a\u4f60\u8981\u5f80\u53f3\u53bb\u4e86\uff0c\u7a81\u7136\u4e4b\u95f4\uff0c\u4f60\u7684\u5de6\u811a\u4e00\u53d1\u529b\uff0c\u4f60\u5176\u5b9e\u662f\u5411\u5de6\u53bb\u4e86\uff0c\u4f60\u5c31\u628a\u5927\u5bb6\u90fd\u9a97\u4e86\uff0c\u8e22\u7403\u8fc7\u4eba\u4e00\u5b9a\u8981\u505a\u5047\u52a8\u4f5c\u3002\u7b49\u6211\u56de\u6765\u6211\u5c31\u6559\u4f60\u5047\u52a8\u4f5c\u3002\n\u4e01\u4e01\u54e5\u54e5\u5728\u6625\u5929\u6536\u62fe\u597d\u6240\u6709\u7684\u884c\u56ca\uff0c\u63e1\u7740\u4e00\u5f20\u706b\u8f66\u7968\u5411\u6211\u544a\u522b\u3002\n\u6211\u8bf4\uff0c\u4e01\u4e01\u54e5\u54e5\uff0c\u4f60\u8981\u53bb\u5357\u65b9\u8fd8\u662f\u8981\u53bb\u5317\u65b9\u554a\u3002\n\u4e01\u4e01\u54e5\u54e5\u8bf4\uff0c\u6211\u8981\u53bb\u5317\u65b9\u3002\n\u6211\u8bf4\uff0c\u54c7\uff0c\u5e26\u6211\u4e00\u8d77\u53bb\u5427\u3002\n\u4e01\u4e01\u54e5\u54e5\u8bf4\uff0c\u4e0d\u884c\uff0c\u4f60\u592a\u5c0f\u4e86\u3002\n\u6211\u8bf4\uff0c\u6211\u5750\u706b\u8f66\u4e0d\u7528\u94b1\u7684\u3002\n\u4e01\u4e01\u54e5\u54e5\u8bf4\uff0c\u4e0d\u884c\uff0c\u4f60\u592a\u5927\u4e86\u3002\n\u6211\u8bf4\uff0c\u4e01\u4e01\u54e5\u54e5\uff0c\u4f60\u53bb\u505a\u4ec0\u4e48\u554a\uff1f\n\u4e01\u4e01\u54e5\u54e5\u8bf4\uff0c\u6211\u53bb\u548c\u4ed6\u4eec\u8c08\u8c08\u3002\n\u6211\u8bf4\uff0c\u4f60\u548c\u8c01\u8c08\u8c08\u554a\uff1f\n\u4e01\u4e01\u54e5\u54e5\u5507\u8fb9\u9732\u51fa\u5fae\u7b11\uff0c\u6025\u5207\u5730\u8bf4\uff0c\u8fd9\u4e2a\u4e16\u754c\u3002\n\u6211\u8bf4\uff0c\u54c7\u5662\u3002\n\u5982\u679c\u4e01\u4e01\u54e5\u54e5\u8fd8\u6d3b\u7740\uff0c\u73b0\u5728\u5e94\u8be5\u662f 38 \u5c81\uff1f39 \u5c81\uff1f40 \u5c81\uff1f\u6211\u5df2\u7ecf\u8ff7\u7cca\u4e86\u3002\u5a1c\u5a1c\u4e70\u4e86\u4e24\u5927\u5851\u6599\u888b\u7684\u98df\u7269\u5411\u6211\u8d70\u6765\u3002\u6ca1\u8d70\u51e0\u6b65\uff0c\u5c31\u6276\u7740\u5783\u573e\u6876\u5410\u4e86\u8d77\u6765\u3002\u6211\u8d76\u7d27\u6253\u5f00\u8f66\u95e8\uff0c\u95e8\u8fb9\u6b63\u597d\u649e\u5230\u4e00\u4e2a\u63a8\u7740\u6db2\u5316\u6c14\u7f50\u7684\u8001\u5927\u7237\u3002\u6211\u6ca1\u987e\u4e0a\uff0c\u5f84\u76f4\u7a7f\u8fc7\u9a6c\u8def\u3002\u8001\u5927\u7237\u5927\u559d\u4e00\u58f0\uff0c\u5c0f\u4f19\u5b50\uff0c\u4f60\u7ad9\u4f4f\uff0c\u649e\u4e86\u4eba\u60f3\u8dd1\uff1f\n<\/pre>\n<p>\u4ece\u8fd9\u6bb5\u8bdd\u97e9\u5bd2\u5bf9\u4e01\u4e01\u54e5\u54e5\u6709\u6bd4\u8f83\u5168\u9762\u7684\u4ecb\u7ecd\u3002\u4e01\u4e01\u54e5\u54e5\u8eab\u4f53\u5f88\u5065\u58ee\uff0c\u5e76\u4e14\u975e\u5e38\u7231\u597d\u5b66\u4e60\uff0c\u662f\u5b66\u751f\u4f1a\u7684\u4e3b\u5e2d\u3002\u4ed6\u8fd8\u8bf4\u201c\u6253\u67b6\u5f53\u7136\u80fd\u89e3\u51b3\u95ee\u9898\uff0c\u8c08\u4e5f\u80fd\u89e3\u51b3\u95ee\u9898\u201d\uff0c\u540c\u65f6\u8868\u793a\u66f4\u671f\u671b\u548c\u5e73\u89e3\u51b3\u95ee\u9898\u3002\u5531\u51fa\u90a3\u9996\u300a\u5c18\u7f18\u300b\uff0c\u9887\u6709\u8bc0\u522b\u7684\u610f\u5473\u3002\u5728\u6625\u5929\u51fa\u53d1\u53bb\u5317\u65b9\uff0c\u7b54\u5e94\u4f1a\u5728\u590f\u5929\u6765\u6559\u201c\u6211\u201d\u8e22\u7403\uff0c\u53ef\u4ee5\u5374\u6ca1\u6709\u80fd\u56de\u6765\u3002\u53bb\u5317\u65b9\u7684\u76ee\u7684\u662f\u201c\u548c\u8fd9\u4e2a\u4e16\u754c\u8c08\u8c08\u201d\u3002\u5982\u679c\u5927\u5b66\u56db\u5e74\u7684\u8bdd\uff0c\u4ed6\u4e0a\u5927\u5b66\u7684\u5e74\u4ee3\u5927\u7ea6\u57281987-1993\u4e4b\u95f4\u3002<\/p>\n<h3>\u7247\u6bb5\u4e8c<\/h3>\n<pre style=\"width:95%\">\n10 \u53f7\u7684\u6027\u683c\u4ece\u5c0f\u8fd9\u6837\uff0c\u5728\u4ed6\u5c0f\u7684\u65f6\u5019\uff0c\u5468\u56f4\u6709\u4e0d\u5c11\u4eba\u8ba8\u538c\u4ed6\uff0c\u4f46\u8fd9\u5c31\u662f\u6211\u6ca1\u6709\u8ba8\u538c\u4ed6\u7684\u539f\u56e0\uff0c \u6211\u89c9\u5f97\u4ed6\u5c31\u662f\u4e00\u4e2a\u7c97\u5236\u6ee5\u9020\u6ca1\u6709\u6587\u5316\u7684\u4e01\u4e01\u54e5\u54e5\uff0c\u4ed6\u4eec\u662f\u4e8b\u7269\u7684\u4e24\u4e2a\u65b9\u5411\uff0c\u4f46\u5374\u662f\u540c\u4e00\u6837\u4e8b\u7269\u300210 \u53f7\u90a3\u6837\u6ee5\uff0c\u4f46\u6709\u65f6\u5019\u80fd\u6cdb\u51fa\u4eae\u5149\u3002\u4e01\u4e01\u54e5\u54e5\u867d\u7136\u603b\u662f\u5145\u6ee1\u5149\n\u8292\uff0c\u4f46\u4ed6\u4e5f\u6709\u80cc\u5bf9\u7740\u6211\u4eec\u7684\u5149\u6591\u3002\n\u5728\u8fd9\u4e2a\u590f\u5929\u6e7f\u6f09\u6f09\u7684\u591c\u665a\uff0c10 \u53f7\u76f4\u63a5\u62bd\u51fa\u4e00\u628a\u67aa\uff0c\u8bf4\uff0c\u5144\u5f1f\uff0c\u4f60\u73a9\u73a9\u3002\n\u6211\u5fd9\u6446\u624b\uff0c\u95ee\u4ed6\uff0c\u771f\u7684\u5047\u7684\u3002\n10 \u53f7\u8bf4\uff0c\u5f53\u7136\u662f\u771f\u5bb6\u4f19\uff0c\u5047\u7684\u5e26\u5728\u8eab\u4e0a\uff0c\u90a3\u8fd8\u4e0d\u88ab\u5144\u5f1f\u4eec\u7b11\u6b7b\u3002\n\u6211\u8bf4\uff0c\u4f60\u54ea\u91cc\u6765\u7684\u3002\n10 \u53f7\u8bf4\uff0c\u4f60\u4e0d\u77e5\u9053\u5427\uff0c\u5c0f\u65f6\u5019\u5c0f\u5b66\u7684\u6821\u529e\u5382\uff0c\u5b83\u539f\u6765\u5c31\u662f\u751f\u4ea7\u67aa\u7684\u3002\u6211\u4ed6\u5988\u4e5f\u662f\u5230\u540e\u6765\u624d\u77e5\u9053\uff0c\u4f60\u770b\uff0c\u6211\u8981\u4e86\u8fd9\u4e2a\u578b\u53f7\uff0c\u9646\u56db\u5f0f\uff0c\u2014\u67aa\u2014\u4e2a\u3002\n\u6211\u770b\u4e86\u4e00\u773c\uff0c\u8bf4\uff0c\u4f60\u5f00\u8fc7\u4e48\uff1f\n10 \u53f7\u4e3e\u8d77\u67aa\uff0c\u671d\u5929\u7830\u7684\u4e00\u67aa\uff0c\u56de\u58f0\u5728\u8fd9\u4e2a\u5c0f\u9547\u4e0a\u98d8\u8361\u649e\u51fb\u4e86\u4e09\u56db\u6b21\uff0c\u6211\u62ac\u5934\u671b\u53bb\uff0c\u523a\u773c\u7684\u6708\u5149\u548c\u82e5\u9690\u82e5\u73b0\u7684\u6811\u53f6\u6447\u66f3\u7740\u300210 \u53f7\u4e50\u4e0d\u53ef\u652f\uff0c\u770b\u7740\u6211\uff0c\u8bf4\uff0c\u5f00\u8fc7\u4e86\u3002\n10 \u53f7\u6402\u7740\u6211\u7684\u80a9\u8180\uff0c\u6211\u4eec\u5750\u5728\u4e00\u4e2a\u516c\u5171\u6c7d\u8f66\u7ad9\u524d\uff0c10 \u53f7\u8bf4\uff0c\u5a18\u7684\uff0c\u8fd9\u4e2a\u5a18\u4eec\u3002\u6211\u6700\u8fd1\u64a9\u4e0a\u4e86\u4e00\u4e2a\u5973\u7684\u3002\u54e6\uff0c\u6211\u5148\u8ddf\u4f60\u8bf4\uff0c\u524d\u4e24\u5929\u6211\u8fd8\u770b\u5230\u4e86\u4e00\u4e2a\u7247\u5b50\uff0e\u4e00\u4e2a\u7535\u5f71\uff0c\u8bb2\u5c11\u5e74\u6740\u4eba\u4e8b\u4ef6\u7684\uff0c\u4f46\u662f\u6211\u88ab\u9a97\u4e86\uff0c\u8fd9\u6839\u672c\u5c31\u4e0d\u662f\u4e00\u4e2a\u67aa\u6218\u7247\uff0c\u8fd9\u7247\u5b50\u592a\u81ed\u4e86\uff0c\u592a\u95f7\u4e86\uff0c\u4f46\u6211\u6bcf\u6b21\u90fd\u60f3\uff0c\u6211\u8981\u662f\u4e0d\u770b\u4e86\uff0c \u6211\u5c31\u5bf9\u4e0d\u8d77\u6211\u521a\u624d\u6d6a\u8d39\u7684\u65f6\u95f4\uff0c\u6211\u5c31\u770b\u5b8c\u4e86\uff0c \u7ed3\u679c\u8fd8\u662f\u4e2a\u95f7\u5c41\uff0c\u4e09\u4e2a\u591a\u5c0f\u65f6\u3002\n\u4f46\u662f\u6211\u91cc\u9762\u5b66\u4f1a\u4e86\u4e00\u53e5\u8bdd\uff0c\u4e00\u53e5\u53f0\u8bcd\uff0c\u4e5f\u662f\u4e00\u4e2a\u5a18\u4eec\u8bf4\u7684\uff0c\u6211\u5c31\u628a\u8fd9\u4e2a\u53f0\u8bcd\u53d1\u7ed9\u4e86\u6211\u64a9\u7684\u90a3\u4e2a\u5973\u7684\uff0c\u6211\u53d1\u77ed\u4fe1\u544a\u8bc9\u5979\uff0c\u6211\u5c31\u50cf\u8fd9\u4e2a\u4e16\u754c\uff0c\u8fd9\u4e2a\u4e16\u754c\u662f\u4e0d\u4f1a\u53d8\u7684\uff0c\u6765\u9002\u5e94\u8fd9\u4e2a\u4e16\u754c\u5427\uff0c\u54c8\u54c8\u54c8\u54c8\u54c8\u3002\n\u6211\u8bf4\uff0c\u55ef\uff0c\u8fd8\u633a\u6587\u827a\u7684\uff0c\u64a9\u90a3\u4e9b\u7231\u5531\u6b4c\u5199\u4e1c\u897f\u7684\u5973\u7684\u8fd8\u884c\u3002\n<\/pre>\n<p>10\u53f7\u5c31\u662f\u4e01\u4e01\u54e5\u54e5\u7684\u4e00\u4e2a\u52a3\u8d28\u4eff\u5236\u54c1\u3002\u76f8\u6bd4\u4e8e\u4e01\u4e01\u54e5\u54e5\u9009\u62e9\u548c\u8fd9\u4e2a\u4e16\u754c\u8c08\u8c08\uff0c10\u53f7\u9009\u62e9\u9002\u5e94\u8fd9\u4e2a\u4e16\u754c\u3002\u4e8e\u662f\u4ed6\u624b\u91cc\u6709\u4e00\u628a\u201c\u9646\u56db\u5f0f\u201d\u624b\u67aa\u3002<\/p>\n<p>\u201c\u9646\u56db\u5f0f\u201d\u624b\u67aa\u6bd4\u8f83\u8001\u4e86\uff0c\u6027\u80fd\u4e0d\u597d\uff0c10\u53f7\u6ca1\u6709\u7406\u7531\u7279\u5730\u9009\u8fd9\u4e2a\u578b\u53f7\u3002<br \/>\n\u4e01\u4e01\u54e5\u54e5\u6b7b\u4e8e\u4f55\u4e8b\uff0c\u60f3\u5fc5\u4e0d\u7528\u518d\u8d58\u8ff0\u4e86\u3002<\/p>\n<p>\u201c\u6211\u8f88\u6267\u7b14\u6587\u4eba\uff0c\u6bcf\u89c9\u6211\u6c11\u65cf\u6587\u5316\u53ea\u662f\u4e00\u5927\u9171\u7f38\uff0c\u80ae\u810f\u6c61\u67d3\u4e4b\u5916\uff0c\u4e00\u65e0\u53ef\u53d6\uff0c\u679c\u5c14\uff0c\u5219\u543e\u4eba\u5bf9\u4e0a\u8ff0\u5343\u5343\u4e07\u4e07\u4e4b\u70c8\u58eb\u5723\u8d24\uff0c\u53c8\u4f55\u4ee5\u4ea4\u4ee3\uff1f\u6b63\u56e0\u4e3a\u6211\u6c11\u65cf\u4e2d\u4e5f\u591a\u7684\u662f\u9ec4\u5174\u4e00\u7c7b\u7684\u8d24\u4eba\u70c8\u58eb\uff0c\u624d\u80fd\u62b5\u5236\u90a3\u4e9b\u6c11\u65cf\u8d25\u7c7b\u3001\u6587\u5316\u6e23\u6ed3\u3001\u660f\u541b\u72ec\u592b\u3001\u515a\u68cd\u5b98\u50da\u3001\u571f\u8c6a\u52a3\u7ec5\u548c\u5e02\u4fa9\u6587\u75de\uff0c\u800c\u4f7f\u6211\u6c11\u65cf\u6587\u5316\u7ef5\u5ef6\u4e94\u5343\u5e74\u800c\u672a\u81f3\u4e8e\u7edd\u4ee3\u4e5f\u3002\u8a00\u5ff5\u53ca\u6b64\uff0c\u6bcf\u4e8e\u5348\u591c\u6e05\u6668\uff0c\u8bd5\u6eaf\u65e7\u53f2\uff0c\u8f84\u81f3\u611f\u6168\u4e07\u7aef\uff0c\u6709\u65f6\u4e14\u5782\u6d95\u505c\u7b14\uff0c\u4e0d\u80fd\u81ea\u5df2\u3002\u5386\u53f2\u5b66\u5bb6\u4e5f\u662f\u4eba\u561b\uff01\u867d\u5c3d\u91cf\u538b\u6291\u4eba\u7686\u6709\u4e4b\u7684\u60c5\u611f\uff0c\u4ecd\u96be\u671f\u5176\u5165\u81f3\u5584\u4e4b\u5883\u4e5f\u3002\u201d<br \/>\n&#8211;\u5510\u5fb7\u521a<\/p>\n<p>\u8bfb\u8fd9\u90e8\u5c0f\u8bf4\u7684\u65f6\u5019\uff0c\u6211\u611f\u5230\u4e00\u80a1\u83ab\u540d\u7684\u538b\u6291\u611f\uff0c\u538b\u6291\u7684\u8fde\u60b2\u4f24\u90fd\u6ca1\u6709\u4e86\u3002\u4e5f\u8bb8\u6211\u60f3\u6210\u4e3a\u4e01\u4e01\u54e5\u54e5\uff0c\u505a\u4e0d\u6210\uff0c\u6700\u540e\u5728\u4e16\u754c\u7684\u538b\u8feb\u4e0b\uff0c\u5815\u5165\u4e86\u9171\u7f38\uff0c\u54c8\u54c8\u54c8\u54c8\u54c8\u3002<br \/>\n[audio:http:\/\/yankay-static.googlecode.com\/svn\/trunk\/music\/Hitomi%20-%20Stories.mp3]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>\u5728\u97e9\u5bd2\u7684\u5c0f\u8bf4\u300a1988\uff1a\u6211\u60f3\u548c\u8fd9\u4e2a\u4e16\u754c\u8c08\u8c08\u300b\uff0c\u4e01\u4e01\u54e5\u54e5\u6c38\u8fdc\u662f\u653e\u5728\u5149\u7684\uff0c\u5c31\u50cf\u97e9\u5bd2\u4e00\u6837\u653e\u7740\u5149\u3002\u8be5\u6807\u9898\u4e5f\u53d6\u81ea\u4e8e\u4e01\u4e01\u54e5\u54e5\u7684\u4e00\u6bb5\u8bdd\u3002\u4e01\u4e01\u54e5\u54e5\u6b7b\u4e8e\u4e00\u6b21\u8fdc\u884c\uff0c\u539f\u56e0\u4f5c\u8005\u5374\u6ca1\u6709\u4ea4\u4ee3\uff0c\u5176\u5b9e\u4ed6\u5df2\u7ecf\u8bf4\u7684\u5f88\u660e\u767d\u4e86\u3002<\/p>\n<p><a class=\"excerpt-more\" href=\"http:\/\/yankay.com\/%e3%80%8a1988%ef%bc%9a%e6%88%91%e6%83%b3%e5%92%8c%e8%bf%99%e4%b8%aa%e4%b8%96%e7%95%8c%e8%b0%88%e8%b0%88%e3%80%8b%e4%b8%ad%e4%b8%81%e4%b8%81%e5%93%a5%e5%93%a5%e7%9a%84%e6%ad%bb%e5%9b%a0\/\">\u9605\u8bfb\u66f4\u591a......<\/a><\/p>","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>\u300a1988\uff1a\u6211\u60f3\u548c\u8fd9\u4e2a\u4e16\u754c\u8c08\u8c08\u300b\u4e2d\u4e01\u4e01\u54e5\u54e5\u7684\u6b7b\u56e0 - \u6211\u81ea\u7136<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"http:\/\/yankay.com\/\u300a1988\uff1a\u6211\u60f3\u548c\u8fd9\u4e2a\u4e16\u754c\u8c08\u8c08\u300b\u4e2d\u4e01\u4e01\u54e5\u54e5\u7684\u6b7b\u56e0\/\" \/>\n<meta property=\"og:locale\" content=\"zh_CN\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"\u300a1988\uff1a\u6211\u60f3\u548c\u8fd9\u4e2a\u4e16\u754c\u8c08\u8c08\u300b\u4e2d\u4e01\u4e01\u54e5\u54e5\u7684\u6b7b\u56e0 - \u6211\u81ea\u7136\" \/>\n<meta property=\"og:description\" content=\"\u5728\u97e9\u5bd2\u7684\u5c0f\u8bf4\u300a1988\uff1a\u6211\u60f3\u548c\u8fd9\u4e2a\u4e16\u754c\u8c08\u8c08\u300b\uff0c\u4e01\u4e01\u54e5\u54e5\u6c38\u8fdc\u662f\u653e\u5728\u5149\u7684\uff0c\u5c31\u50cf\u97e9\u5bd2\u4e00\u6837\u653e\u7740\u5149\u3002\u8be5\u6807\u9898\u4e5f\u53d6\u81ea\u4e8e\u4e01\u4e01\u54e5\u54e5\u7684\u4e00\u6bb5\u8bdd\u3002\u4e01\u4e01\u54e5\u54e5\u6b7b\u4e8e\u4e00\u6b21\u8fdc\u884c\uff0c\u539f\u56e0\u4f5c\u8005\u5374\u6ca1\u6709\u4ea4\u4ee3\uff0c\u5176\u5b9e\u4ed6\u5df2\u7ecf\u8bf4\u7684\u5f88\u660e\u767d\u4e86\u3002\" \/>\n<meta property=\"og:url\" content=\"http:\/\/yankay.com\/\u300a1988\uff1a\u6211\u60f3\u548c\u8fd9\u4e2a\u4e16\u754c\u8c08\u8c08\u300b\u4e2d\u4e01\u4e01\u54e5\u54e5\u7684\u6b7b\u56e0\/\" \/>\n<meta property=\"og:site_name\" content=\"\u6211\u81ea\u7136\" \/>\n<meta property=\"article:published_time\" content=\"2010-10-23T14:53:30+00:00\" \/>\n<meta property=\"og:image\" content=\"http:\/\/img3.douban.com\/lpic\/s4477716.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"http:\/\/yankay.com\/#website\",\"url\":\"http:\/\/yankay.com\/\",\"name\":\"\\u6211\\u81ea\\u7136\",\"description\":\"\\u989c\\u5f00\\u7684\\u535a\\u5ba2\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"http:\/\/yankay.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"zh-CN\"},{\"@type\":\"ImageObject\",\"@id\":\"http:\/\/yankay.com\/%e3%80%8a1988%ef%bc%9a%e6%88%91%e6%83%b3%e5%92%8c%e8%bf%99%e4%b8%aa%e4%b8%96%e7%95%8c%e8%b0%88%e8%b0%88%e3%80%8b%e4%b8%ad%e4%b8%81%e4%b8%81%e5%93%a5%e5%93%a5%e7%9a%84%e6%ad%bb%e5%9b%a0\/#primaryimage\",\"inLanguage\":\"zh-CN\",\"url\":\"http:\/\/img3.douban.com\/lpic\/s4477716.jpg\",\"contentUrl\":\"http:\/\/img3.douban.com\/lpic\/s4477716.jpg\"},{\"@type\":\"WebPage\",\"@id\":\"http:\/\/yankay.com\/%e3%80%8a1988%ef%bc%9a%e6%88%91%e6%83%b3%e5%92%8c%e8%bf%99%e4%b8%aa%e4%b8%96%e7%95%8c%e8%b0%88%e8%b0%88%e3%80%8b%e4%b8%ad%e4%b8%81%e4%b8%81%e5%93%a5%e5%93%a5%e7%9a%84%e6%ad%bb%e5%9b%a0\/#webpage\",\"url\":\"http:\/\/yankay.com\/%e3%80%8a1988%ef%bc%9a%e6%88%91%e6%83%b3%e5%92%8c%e8%bf%99%e4%b8%aa%e4%b8%96%e7%95%8c%e8%b0%88%e8%b0%88%e3%80%8b%e4%b8%ad%e4%b8%81%e4%b8%81%e5%93%a5%e5%93%a5%e7%9a%84%e6%ad%bb%e5%9b%a0\/\",\"name\":\"\\u300a1988\\uff1a\\u6211\\u60f3\\u548c\\u8fd9\\u4e2a\\u4e16\\u754c\\u8c08\\u8c08\\u300b\\u4e2d\\u4e01\\u4e01\\u54e5\\u54e5\\u7684\\u6b7b\\u56e0 - \\u6211\\u81ea\\u7136\",\"isPartOf\":{\"@id\":\"http:\/\/yankay.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"http:\/\/yankay.com\/%e3%80%8a1988%ef%bc%9a%e6%88%91%e6%83%b3%e5%92%8c%e8%bf%99%e4%b8%aa%e4%b8%96%e7%95%8c%e8%b0%88%e8%b0%88%e3%80%8b%e4%b8%ad%e4%b8%81%e4%b8%81%e5%93%a5%e5%93%a5%e7%9a%84%e6%ad%bb%e5%9b%a0\/#primaryimage\"},\"datePublished\":\"2010-10-23T14:53:30+00:00\",\"dateModified\":\"2010-10-23T14:53:30+00:00\",\"author\":{\"@id\":\"http:\/\/yankay.com\/#\/schema\/person\/f52d918e9bfa51c4454172c2caa7704f\"},\"breadcrumb\":{\"@id\":\"http:\/\/yankay.com\/%e3%80%8a1988%ef%bc%9a%e6%88%91%e6%83%b3%e5%92%8c%e8%bf%99%e4%b8%aa%e4%b8%96%e7%95%8c%e8%b0%88%e8%b0%88%e3%80%8b%e4%b8%ad%e4%b8%81%e4%b8%81%e5%93%a5%e5%93%a5%e7%9a%84%e6%ad%bb%e5%9b%a0\/#breadcrumb\"},\"inLanguage\":\"zh-CN\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"http:\/\/yankay.com\/%e3%80%8a1988%ef%bc%9a%e6%88%91%e6%83%b3%e5%92%8c%e8%bf%99%e4%b8%aa%e4%b8%96%e7%95%8c%e8%b0%88%e8%b0%88%e3%80%8b%e4%b8%ad%e4%b8%81%e4%b8%81%e5%93%a5%e5%93%a5%e7%9a%84%e6%ad%bb%e5%9b%a0\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"http:\/\/yankay.com\/%e3%80%8a1988%ef%bc%9a%e6%88%91%e6%83%b3%e5%92%8c%e8%bf%99%e4%b8%aa%e4%b8%96%e7%95%8c%e8%b0%88%e8%b0%88%e3%80%8b%e4%b8%ad%e4%b8%81%e4%b8%81%e5%93%a5%e5%93%a5%e7%9a%84%e6%ad%bb%e5%9b%a0\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"http:\/\/yankay.com\/\",\"url\":\"http:\/\/yankay.com\/\",\"name\":\"\\u9996\\u9875\"}},{\"@type\":\"ListItem\",\"position\":2,\"item\":{\"@id\":\"http:\/\/yankay.com\/%e3%80%8a1988%ef%bc%9a%e6%88%91%e6%83%b3%e5%92%8c%e8%bf%99%e4%b8%aa%e4%b8%96%e7%95%8c%e8%b0%88%e8%b0%88%e3%80%8b%e4%b8%ad%e4%b8%81%e4%b8%81%e5%93%a5%e5%93%a5%e7%9a%84%e6%ad%bb%e5%9b%a0\/#webpage\"}}]},{\"@type\":\"Person\",\"@id\":\"http:\/\/yankay.com\/#\/schema\/person\/f52d918e9bfa51c4454172c2caa7704f\",\"name\":\"yankay\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"http:\/\/yankay.com\/#personlogo\",\"inLanguage\":\"zh-CN\",\"url\":\"http:\/\/1.gravatar.com\/avatar\/426bb830224c1471011d92a830a6ed4f?s=96&d=wavatar&r=g\",\"contentUrl\":\"http:\/\/1.gravatar.com\/avatar\/426bb830224c1471011d92a830a6ed4f?s=96&d=wavatar&r=g\",\"caption\":\"yankay\"},\"sameAs\":[\"http:\/\/47.100.65.109\"],\"url\":\"http:\/\/yankay.com\/author\/yankay\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/posts\/26097"}],"collection":[{"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/comments?post=26097"}],"version-history":[{"count":0,"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/posts\/26097\/revisions"}],"wp:attachment":[{"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/media?parent=26097"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/categories?post=26097"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/tags?post=26097"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}