{"id":26588,"date":"2013-01-03T12:20:52","date_gmt":"2013-01-03T04:20:52","guid":{"rendered":"http:\/\/www.yankay.com\/?p=26588"},"modified":"2021-03-28T20:07:57","modified_gmt":"2021-03-28T12:07:57","slug":"2012%e5%b9%b4%e5%ad%a6%e4%b9%a0%e5%b0%8f%e7%bb%93","status":"publish","type":"post","link":"http:\/\/yankay.com\/2012%e5%b9%b4%e5%ad%a6%e4%b9%a0%e5%b0%8f%e7%bb%93\/","title":{"rendered":"2012\u5e74\u5b66\u4e60\u5c0f\u7ed3"},"content":{"rendered":"<p>\u4e00\u8f6c\u8eab\u5c31\u52302013\u4e86\u3002\u8bfb\u8005\u65b0\u5e74\u5feb\u4e50\uff0c\u5e0c\u671b\u5403\u5230\u997a\u5b50\u7684\u4eba\u90fd\u5e78\u798f\u3002<br \/>\n\u65b0\u5e74\u4f0a\u59cb\uff0c\u7b14\u8005\u5728\u60f3\u505a\u70b9\u4ec0\u4e48\u4e4b\u524d\uff0c\u8fd8\u662f\u56de\u987e\u4e0b\u53bb\u5e74\u505a\u4e86\u4e9b\u4ec0\u4e48\uff0c\u597d\u6b79\u6709\u4e2a\u4ea4\u4ee3\u3002\u8bb0\u5f55\u4e0b\u5b66\u4e60\u7684\u8f68\u8ff9\uff0c\u5206\u4eab\u7ed9\u60a8\u8fd8\u6709\u672a\u6765\u7684\u81ea\u5df1\u3002<\/p>\n<p>\u53bb\u5e74\u6211\u5c0f\u534a\u5e74\u5728\u76db\u5927\u6e38\u620f\uff0c\u4e1a\u52a1\u8f83\u5c11\uff0c\u5c38\u4f4d\u7d20\u9910\uff0c\u6ca1\u505a\u4ec0\u4e48\u4e8b\u60c5\u3002\u5927\u534a\u5e74\u5728EMC\u4e2d\u56fd\u7814\u7a76\u9662\uff0c\u867d\u7136\u73b0\u5728\u6709\u4e9b\u5c0f\u5fd9\uff0c\u4f46\u4e4b\u524d\u9002\u5e94\u9879\u76ee\u548c\u56e2\u961f\u82b1\u4e86\u597d\u4e45\u3002\u56e0\u6b64\u6709\u5927\u628a\u5927\u628a\u7684\u65f6\u95f4\u6765\u5b66\u4e60\u3002\u8fd9\u662f\u6211\u7684\u5b66\u4e60\u9ec4\u91d1\u5e74\uff0c\u8bfb\u4e8660\u8bfb\u672c\u4e66\uff0c\u770b\u4e86\u4e0d\u5c11\u5f00\u6e90\u9879\u76ee\u5982Kalfa,CloudFoundry\u7684\u6e90\u4ee3\u7801\u3002\u5b66\u5230\u4e86\u4e0d\u5c11\u7684\u77e5\u8bc6\uff0c\u771f\u5f00\u5fc3\u3002<\/p>\n<p>\u5b66\u77e5\u8bc6\u7684\u8bdd\uff0c\u4ee5\u524d\u6bd4\u8f83\u559c\u6b22\u4e0a\u7f51\uff0c\u73b0\u5728\u6bd4\u8f83\u559c\u6b22\u770b\u4e66\u3002\u7f51\u7edc\u6587\u5b57\u5f88\u591a\u6bd4\u8f83\u6982\u7565\uff0c\u6563\u4e71\u3002\u800c\u4e00\u672c\u597d\u4e66\u5f80\u5f80\u503e\u5c3d\u4e00\u4e2a\u4eba\u7684\u76f8\u5173\u4e13\u957f\u4e0a\u5168\u90e8\u624d\u80fd\u3002\u8bfb\u8bfb\u4e66\uff0c\u7701\u65f6\u7701\u529b\u3002<\/p>\n<p><strong>\u7cfb\u7edf\u7f16\u7a0b<\/strong><\/p>\n<p>\u4eca\u5e74\u5e74\u521d\u524d\uff0c\u6211\u505a\u7684\u7a0b\u5e8f\u7684Bug\u5927\u591a\u96c6\u4e2d\u5728\u7cfb\u7edf\u548c\u7f51\u7edc\u90e8\u5206\uff0c\u518d\u52a0\u4e0a\u9700\u8981\u7ef4\u62a4\u6539\u8fdb\u4e00\u4e2aC++\u7684\u6a21\u5757\u3002\u6240\u4ee5\u6211\u5148\u597d\u597d\u5b66\u4e60\u4e86\u4e0b\u7cfb\u7edf\u7f16\u7a0b\uff0c\u7f51\u7edc\uff0c\u548cC++\u65b9\u9762\u7684\u77e5\u8bc6\u3002\u867d\u7136\u90fd\u662f\u5927\u9aa8\u5934\uff0c\u4f46\u662f\u56e0\u4e3a\u65f6\u95f4\u5145\u88d5\uff0c\u5b66\u7684\u4e5f\u624e\u5b9e\u3002<\/p>\n<p>\u7b14\u8005\u4ee5\u524d\u5b66\u8fc7\u4e00\u4e9b\u7cfb\u7edf\u7f16\u7a0b\uff0c\u4f46\u5e0c\u671b\u4e86\u89e3\u5f97\u66f4\u6df1\u5165\u4e00\u4e9b\u3002\u6240\u4ee5\u5148\u8bfb\u4e86\u7684\u300a\u6df1\u5165\u7406\u89e3\u8ba1\u7b97\u673a\u7cfb\u7edf\u300b\uff0c\u8fd9\u672c\u4e66\u91cc\u201c\u5b58\u50a8\u5668\u5c71\u201d\u7684\u6982\u5ff5\u8ba9\u6211\u8305\u820d\u987f\u5f00\u3002\u6559\u6388\u5148\u751f\u522b\u51fa\u5fc3\u88c1\u7684\u5c06\u5b58\u50a8\u5668\u7684\u541e\u5410\u91cf\uff0c\u753b\u6210\u4e86\u4e00\u5ea7\u5c71\u3002\u5e76\u81ea\u5df1\u505a\u4e86\u4e9b\u6d4b\u8bd5\uff0c\u5199\u4e86\u300a<a href=\"http:\/\/www.yankay.com\/%E5%86%85%E5%AD%98%E7%A9%B6%E7%AB%9F%E6%9C%89%E5%A4%9A%E5%BF%AB%EF%BC%9F\/\">\u5185\u5b58\u7a76\u7adf\u6709\u591a\u5feb\uff1f<\/a>\u300b\u4e00\u6587\u3002\u5982\u679c\u7ec6\u7ec6\u5728\u5c71\u4e0a\u54c1\uff0c\u53ef\u4ee5\u8003\u8651\u5982\u4f55\u6700\u597d\u7684\u4f7f\u7528\u5b58\u50a8\u5668\u3002\u7136\u540e\u770b\u4e86\u4e9bUNIX\u7f16\u7a0b\u7684\u5185\u5bb9\uff0c\u5305\u62ec\u7cfb\u7edf\u63d0\u4f9bAPI\u548c\u4ed6\u4eec\u7684\u813e\u6c14\u3002\u8fd8\u7814\u7a76\u4e86\u4e0b\u5982\u4f55\u5728Unix\u91cc\u9762\u7528GDB\u4e4b\u7c7b\u7684\u5de5\u5177Debug\uff0c\u67e5\u770b\u7a0b\u5e8f\u72b6\u6001\u3002<\/p>\n<p><strong>\u7f51\u7edc<\/strong><\/p>\n<p>\u7f51\u7edc\u662f\u975e\u5e38\u91cd\u8981\u7684\u57fa\u7840\u77e5\u8bc6\u3002\u505a\u4e8b\u60c5\u7684\u65f6\u5019\uff0c\u5c31\u6015\u7f51\u7edc\u64cd\u4f5c\uff0c\u56e0\u4e3a\u603b\u662f\u4f1a\u9047\u5230\u5947\u602a\u7684\u95ee\u9898\u3002\u8eb2\u907f\u4e0d\u662f\u529e\u6cd5\uff0c\u6240\u4ee5\u7ec6\u7ec6\u5b66\u4e86\u5b66\u3002\u300a\u8ba1\u7b97\u673a\u7f51\u7edc\u300b\u8fd9\u90e8\u4e66\u5f88\u597d\uff0c\u56e0\u4e3a\u91cd\u7248\u4e86\uff0c\u6240\u4ee5\u518d\u8bfb\u4e86\u8bfb\u3002\u4e3b\u8981\u662f\u65b0\u589e\u7684\u65e0\u7ebf\u7f51\u7edc\u7684\u7bc7\u5e45\u3002\u7b14\u8005\u610f\u5916\u7684\u53d1\u73b0WIFI\u7684\u9891\u7387\u548c\u5fae\u6ce2\u7089\u540c\u6837\u662f2.4GHz\u3002\u6240\u4ee5\u840c\u751f\u4e86\u7528\u624b\u673a\u68c0\u6d4b\u5fae\u535a\u8def\u6cc4\u6f0f\u7684\u529e\u6cd5\u3002\u5e76\u4e14\u8bbe\u60f3\u4e86\u201c<a href=\"https:\/\/github.com\/yankay\/safemicrowave\">\u5fae\u6ce2\u7089\u5b89\u5168\u4e13\u5bb6<\/a>\u201d\u7684\u624b\u673a\u6e38\u620f\u3002\u7531\u4e8e\u8fd9\u4e2a\u6e38\u620f\u5b9e\u5728\u592a\u51b7\u7b11\u8bdd\u4e86\uff0c \u6240\u4ee5\u4e00\u76f4\u6ca1\u5b9e\u73b0\u3002:-)\u7f51\u7edc\u4e5f\u8d8a\u6765\u8d8a\u6ce8\u91cd\u5b89\u5168\u6027\uff0c\u5bf9\u5bc6\u7801\u5b66\u7684\u5b66\u4e60\u4e5f\u662f\u8981\u4e0d\u9057\u4f59\u529b\u5730\u3002<\/p>\n<p><strong>\u7f16\u7a0b\u98ce\u683c<\/strong><\/p>\n<p>\u7f16\u7a0b\u98ce\u683c\u662f\u4e2a\u8bf4\u4e0d\u6e05\u9053\u4e0d\u660e\u7684\u4e1c\u897f\u3002\u7b14\u8005\u4e00\u76f4\u5f88\u559c\u7231Linux\u3002\u6240\u4ee5\u5b66\u4e86\u5b66Linux\/Unix\u7684\u7f16\u7a0b\u98ce\u683c\u3002\u4e0b\u9762\u8fd9\u4e09\u672c\u4e66\u90fd\u662f\u8bb2\u8fd9\u4e2a\u3002\u867d\u7136\u4e66\u540d\u90fd\u5f88\u54d7\u4f17\u53d6\u5ba0\uff0c\u4f46\u5185\u5bb9\u4e0d\u9519\u3002\u6709\u8da3\u662f\u6700\u54d7\u4f17\u53d6\u5ba0\u7684\u300a\u7a0b\u5e8f\u5458\u4fee\u70bc\u4e4b\u9053-\u4ece\u5c0f\u5de5\u5230\u4e13\u5bb6\u300b\uff0c\u5c06Linux\u7684\u601d\u60f3\u5b9a\u4e49\u4e3a\u201c<strong>\u6ce8\u91cd\u5b9e\u6548<\/strong>\u201d\u3002\u7ed9\u4e86\u7b14\u8005\u5f53\u5934\u4e00\u68d2\uff0c\u5176\u5b9e\u7f16\u7a0b\u98ce\u683c\u4ec0\u4e48\u7684\uff0c\u5c31\u662f\u4e0d\u81ea\u5df1\u73a9\u81ea\u5df1\u3002\u505a\u4ea7\u54c1\u5e94\u8be5\u7528\u6700\u7ecf\u6d4e\u7684\uff0c\u505a\u5b66\u95ee\u5219\u8981\u662f\u6700\u6df1\u523b\u7684\u3002<\/p>\n<p><strong>Web\u6280\u672f<\/strong><\/p>\n<p>\u4e92\u8054\u7f51\u6280\u672f\u662f\u7b14\u8005\u611f\u5174\u8da3\u7684\u4f20\u7edf\u65b9\u5411\u3002\u8fd9\u65b9\u9762\u7684\u5b66\u4e60\u4e0d\u662f\u9760\u8bfb\u4e66\u4e3a\u4e3b\uff0c\u672c\u5e74\u5ea6\u8bfb\u4e86\u4e24\u672c\u3002\u4e00\u672c\u4e66\u4f5c\u8005\u662f\u817e\u8baf\u7684\u201c<a href=\"http:\/\/book.douban.com\/search\/%E6%9E%97%E6%98%8A\">\u90ed\u6b23<\/a>\u201d\uff0c\u53e6\u4e00\u672c\u662f\u65e5\u672c\u67d0\u6700\u5927\u4e92\u8054\u7f51\u4f01\u4e1a\u7684\u5de5\u7a0b\u5e08\u3002\u7b14\u8005\u662f\u4e2a\u54c8\u65e5\u9752\u5e74\uff0c\u4f46\u662f\u4e0d\u5f97\u4e0d\u8bf4\uff0c\u5728\u65e5\u672c\u4eba\u7684\u4e92\u8054\u7f51\u6280\u672f\uff0c\u6015\u662f\u6709\u70b9\u843d\u540e\u3002\u5f88\u591aWeb\u91cd\u8981\u95ee\u9898\uff0c\u6bd4\u5982MySQL\uff0c\u7f13\u5b58\u6d45\u5c1d\u8f84\u6b62\uff0c\u751a\u81f3\u53ea\u5b57\u672a\u63d0\u76d1\u63a7\u3002\u56fd\u4eba\u679c\u7136\u5f88\u5f3a\uff0c\u9762\u9762\u4ff1\u5230\uff0c\u97ad\u8f9f\u5165\u91cc\u3002<\/p>\n<p><strong>\u5e76\u53d1<\/strong><\/p>\n<p>\u5e76\u53d1\u4e5f\u662f\u7b14\u8005\u6700\u611f\u5174\u8da3\u7684\u65b9\u5411\uff0c\u7b14\u8005\u6df1\u5165\u5b66\u4e86\u5b66\u591a\u6838\u7684\u539f\u7406\u3002\u5c31\u662fAPI\u7684\u91cc\u9501\u548c\u539f\u5b50\u64cd\u4f5c\uff0c\u5982\u4f55\u6620\u5c04\u6210CPU\u7684\u6307\u4ee4\uff0c\u5e76\u4e14CPU\u662f\u5982\u4f55\u6267\u884c\u8fd9\u4e9b\u6307\u4ee4\u7684\u3002\u5f88\u591a\u95ee\u9898\uff0c\u8305\u585e\u987f\u5f00\u3002\u540e\u6765\u5199\u4e86\u7bc7\u6587\u7ae0\u300a<a href=\"http:\/\/www.yankay.com\/\u5e76\u53d1\u7f16\u7a0b\u4e4b\u5de7\u7528\u9501\">\u5e76\u53d1\u7f16\u7a0b\u4e4b\u5de7\u7528\u9501<\/a>\u300b\u3002\u7ecf\u8fc7\u4e0d\u5c11\u77e5\u8bc6\u79ef\u7d2f\u540e\uff0c\u89c9\u5f97\u5e76\u53d1\u4e0d\u662f\u5f88\u7b80\u5355\u3002\u591a\u6838\u5e76\u53d1\u672c\u5c31\u662f\u4e3a\u4e86\u63d0\u5347\u6027\u80fd\uff0c\u4f46\u4ee5\u63d0\u5347\u6027\u80fd\u4e3a\u76ee\u6807\u5199\u5e76\u53d1\u7a0b\u5e8f\u5e76\u4e0d\u7b80\u5355\u3002\u81ea\u5df1\u4e0d\u5e94\u8be5\u8f7b\u6613\u64cd\u4f5c\u5e95\u5c42\u5e76\u53d1\u5143\u7d20\uff0c\u6216\u8005\u4e0d\u4f7f\u7528\u65e0\u8c13\u7684\u5e76\u53d1\u3002\u5982\u679c\u8981\u7528\u4e00\u4e0b\uff0c\u4f30\u8ba1\u5f97\u6df1\u601d\u719f\u8651\u597d\u51e0\u5929\u624d\u884c\u3002<\/p>\n<p><strong>\u6570\u636e\u5e93<\/strong><\/p>\n<p>\u76db\u5927\u6e38\u620f\u7684&#8221;\u7cfb\u7edf\u5e73\u53f0\u90e8&#8221;\u8fd0\u7ef4\u4e86\u5927\u91cf\u7684MySQL\u3002\u7b14\u8005\u5728\u91cc\u5934\u8033\u6fe1\u76ee\u67d3\uff0c\u4e5f\u61c2\u4e86\u4e00\u4e9b\u3002\u5f53\u7136\u770b\u4e66\u4e5f\u662f\u5b66\u4e60MySQL\u7684\u4e00\u90e8\u5206\u3002\u5c24\u5176\u63a8\u8350\u7b80\u671d\u9633\u7684\u8fd9\u90e8\uff0c\u6709\u5f88\u591a\u963f\u91cc\u5df4\u5df4\u81ea\u8eab\u7684\u5b9e\u8df5\u7cbe\u9ad3\u5728\u91cc\u5934\u3002\u56fd\u4eba\u8fd8\u662f\u5f88\u597d\u5f88\u5f3a\u5927\u3002\u300aSQL\u53cd\u6a21\u5f0f\u300b\u662f\u6211\u6700\u559c\u7231\u7684\u56fe\u4e66\uff0c\u8584\u8584\u4e00\u672c\u5c0f\u518c\u5b50\uff0c\u8bb2\u8bbe\u8ba1\u6570\u636e\u5e93Schema\u7684\u65f6\u5019\u5bb9\u6613\u72af\u7684\u9519\u8bef\u3002\u5c3d\u7ba1\u81ea\u8ba4\u4e3a\u5bf9\u6570\u636e\u5e93\u9887\u6709\u89c1\u89e3\uff0c\u4f46\u662f\u53d1\u73b0\u51e0\u4e4e\u6bcf\u4e00\u53cd\u6a21\u5f0f\u81ea\u5df1\u90fd\u78b0\u5230\u8fc7\uff0c\u500d\u53d7\u6253\u51fb\u3002\u4ece\u6b64\u9022\u4eba\u5c31\u63a8\u8350\u8fd9\u672c\u300aSQL\u53cd\u6a21\u5f0f\u300b\u3002\u770b\u8fc7\u7684\u4eba\u90fd\u8868\u793a\u5927\u8d5e\u3002<\/p>\n<p><strong>\u786c\u4ef6\u5b58\u50a8<\/strong><\/p>\n<p>\u7b14\u8005\u521a\u5230EMC\u540e\u5bf9SAN,FCoE\u7b49\u7b49\u5b58\u50a8\u76f8\u5173\u7684\u77e5\u8bc6\u8fd8\u4e00\u65e0\u6240\u77e5\u3002\u5982\u679c\u8fc7\u4e86\u6bb5\u65f6\u95f4\u8fd8\u4e0d\u61c2\uff0c\u5c82\u4e0d\u8ba9\u4eba\u7b11\u6389\u5927\u7259\u3002\u6240\u4ee5\u82b1\u4e86\u4e9b\u65f6\u95f4\u7cfb\u7edf\u7684\u79d1\u666e\u4e0b\u5b58\u50a8\u76f8\u5173\u7684\u77e5\u8bc6\u3002\u518d\u5f97\u6613\u4e8e\u516c\u53f8\u5185\u90e8\u73af\u5883\uff0c\u8fd8\u6709\u57f9\u8bad\u6388\u8bfe\u3002\u7b14\u8005\u5bf9\u5b58\u50a8\u7b97\u662f\u521d\u7aa5\u95e8\u5f84\u4e86\u3002<\/p>\n<p><strong>\u8ba1\u7b97\u673a\u8bed\u8a00<\/strong><\/p>\n<p>C++<\/p>\n<p>\u4e0d\u6015\u7b11\u8bdd\uff0c\u7b14\u8005\u5bf9\u6280\u672f\u6709\u6d01\u7656\uff0c\u5bf9C++\u6709\u70b9\u6392\u65a5\uff0c\u6240\u4ee5\u4e0d\u7b97\u7cbe\u901a\u3002\u4f46\u5de5\u4f5c\u9700\u8981\uff0c\u603b\u5f52\u8fd8\u662f\u5f97\u8ba4\u771f\u770b\u770b\u7684\u3002\u4f46\u8bfb\u4e86\u8bfb\u300aEffective C++\u300b\u540e\uff0c\u7231\u4e0d\u91ca\u624b\uff0c\u53c8\u53cd\u590d\u8bfb\u4e86\u4e24\u904d\u3002\u5c3d\u7ba1C++\u63d0\u4f9b\u4e86\u90a3\u4e48\u591a\u4e71\u4e03\u516b\u7cdf\u7684\u8bed\u8a00\u7ea7\u5de5\u5177\uff0c\u6709\u5f88\u591a\u9677\u9631\uff0c\u7528\u597d\u4ed6\u4eec\u4e0d\u5bb9\u6613\uff0c\u4f46\u5982\u679c\u5faa\u89c4\u8e48\u77e9\u7684\u4f7f\u7528\uff0c\u8fd8\u662f\u5f88\u987a\u624b\u7684\u3002\u300aEffective C++\u300b\u5c31\u662f\u7ed9\u6211\u63d0\u4f9b\u8fd9\u4e9b\u5faa\u89c4\u8e48\u77e9\u7684\u65b9\u6cd5\uff0c\u8ba9\u4eba\u53ef\u4ee5\u8212\u670d\u70b9\u3002\u7136\u540e\u6211\u8feb\u4e0d\u53ca\u5f85\u7684\u8bfb\u4e86\u300aMore Effective C++\u300b\u611f\u89c9\u5927\u4e0d\u5982\u524d\u4f5c\u5b9e\u7528\uff0c\u4f5c\u8005\u5927\u6709\u6c5f\u90ce\u624d\u5c3d\u7684\u611f\u89c9\u3002\u4e0d\u8fc7\u8fd8\u662f\u633a\u4e0d\u9519\u7684\u3002<\/p>\n<p>Ruby<\/p>\n<p>\u5904\u4e8e\u5bf9CloudFoundry\u9879\u76ee\u7684\u9700\u8981\uff0c\u7b14\u8005\u4e5f\u770b\u4e86\u770bRuby\u3002\u5c3d\u7ba1Ruby\u5f88\u6d41\u884c\uff0c\u5f88\u591a\u4eba\u5728\u4f7f\u7528\u3002\u53ef\u6211\u611f\u89c9\u4ed6\u5c31\u50cf\u6df7\u6c34\u4e00\u822c\uff0c\u4e0d\u5e72\u51c0\u3002\u7531\u4e8e\u8bed\u8a00\u672c\u8eab\u6bd4\u8f83\u52a8\u6001\uff0c\u5bf9\u4e8e\u4e00\u884c\u4ee3\u7801\uff0c\u4f1a\u600e\u6837\u6267\u884c\uff0c\u5b8c\u5168\u4e0d\u6e05\u695a\u3002\u4e0d\u8fc7\u5e73\u5fc3\u800c\u8bba\uff0c\u8fd8\u662f\u633a\u597d\u7528\u7684\u3002\u53bb\u5e74\u677e\u672c\u6765\u4e0a\u6d77\uff0c\u7b14\u8005\u4e5f\u53bb\u671d\u5723\uff0c\u4ed6\u4e00\u76f4\u7a7f\u7740\u8fd9\u5957\u810f\u516e\u516e\u7684\u9ec4\u8272\u897f\u88c5\uff0c\u63a8\u9500\u81ea\u5df1\u7684\u624b\u673aRuby\u3002\u6211\u7a81\u7136\u89c9\u5f97\u4e1c\u65b9\u4eba\u5f04\u51fa\u4e2a\u73a9\u610f\u4e0d\u5bb9\u6613\uff0c\u810f\u5c31\u810f\u70b9\uff0c\u5e72\u51c0\u4e0d\u8fc7\u4eba\u5bb6(\u897f\u65b9\u4eba)\uff0c\u8fd8\u908b\u9062\u4e0d\u8fc7\u5417\u3002<\/p>\n<p>GO<\/p>\n<p>GO\u662fGoogle\u7684\u65b0\u8bed\u8a00\u3002\u5bf9Go\u7684\u5b66\u4e60\u662f\u5341\u5206\u6109\u5feb\u3002\u7b14\u8005\u5f80\u5f80\u770b\u8fd9\u65b9\u9762\u7684\u8d44\u6599\u5230\u51cc\u6668\u4e8c\u4e09\u70b9\u5fd8\u4e86\u7761\u7720\u3002\u629b\u5f03\u7b80\u4ecb\u7684\u8bed\u6cd5\u4e0d\u8c08\uff0cGo\u7684\u8bbe\u8ba1\u8003\u8651\u5230\u6027\u80fd\u8981\u6c42\u3002\u5f88\u591a\u52a8\u6001\u6027\u5728\u7f16\u8bd1\u91cc\u89e3\u51b3\uff0c\u6267\u884c\u7684\u4ee3\u7801\u5f88\u5927\u7a0b\u5ea6\u4e0a\u662f\u9759\u6001\u7684\u3002\u548cC\u98ce\u683c\u5f88\u50cf\uff0c\u7b80\u5355\u8212\u670d\u3002\u5e76\u4e14\u5e76\u53d1\u4e5f\u505a\u5f97\u4e0d\u9519\u3002\u611f\u89c9\u5047\u4ee5\u65f6\u65e5\uff0c\u4ed6\u4f1a\u5bf9\u6027\u80fd\u654f\u611f\u7684\u7cfb\u7edf\u7f16\u7a0b\u9886\u57df\u9020\u6210\u51b2\u51fb\u3002\u7b14\u8005\u603b\u7ed3\u4e86Go\u8bed\u8a00\u534f\u7a0b\u7684\u7f16\u7a0b\u6a21\u578b\uff0c\u8bb0\u5f55\u4e0b\u4e00\u6587\u300a<a href=\"http:\/\/www.yankay.com\/go-clear-concurreny\/\">Go\u7b80\u6d01\u7684\u5e76\u53d1<\/a>\u300b\u3002\u53e6\u5916\u8bb8\u5f0f\u4f1f\u7684\u7684\u8fd9\u90e8\u4e66\u4e5f\u662f\u4e0d\u9519\u7684\u8bfb\u7269\u3002<\/p>\n<p><strong>\u6570\u636e\u6316\u6398<\/strong><\/p>\n<p>\u5de5\u4f5c\u9700\u8981\uff0c\u7b14\u8005\u63a5\u89e6\u5230\u4e86&#8221;\u5927\u6570\u636e&#8221;\u3002\u51b3\u5fc3\u4e0b\u5927\u529b\u6c14\u5b66\u5b66\u6570\u636e\u6316\u6398\u548c\u673a\u5668\u5b66\u4e60\u65b9\u9762\u7684\u77e5\u8bc6\u3002\u521a\u597d\u6709\u672c\u65af\u5766\u798f\u7684\u300a\u5927\u6570\u636e\u300b\u7684\u4e66\uff0c\u8fd9\u672c\u4e66\u5f88\u597d\uff0c\u6839\u636e\u73b0\u5b9e\u4e2d\u4e8b\u4f8b\u5207\u5165\uff0c\u6df1\u5165\u6d45\u51fa\u3002\u968f\u5373\u5012\u817e\u4e86\u51e0\u4e2a\u7b97\u6cd5\u3002\u51c6\u5907\u5728\u51e0\u65e5\u540e\u63a8\u51fa\u4e00\u4e2a\u57fa\u4e8e\u76d1\u7763\u5b66\u4e60\u7684&#8221;\u516b\u5366\u673a\u5668\u4eba\u6e38\u620f&#8221;\uff0c\u656c\u8bf7\u671f\u5f85\u3002<\/p>\n<p><strong>\u624b\u673a<\/strong><\/p>\n<p>\u5de5\u4f5c\u4e0a\u7684\u9700\u8981\uff0c\u7b14\u8005\u7a0d\u5fae\u770b\u4e86\u770bAndroid\u7cfb\u7edf\u7684\u8fd0\u4f5c\u65b9\u5f0f\u3002\u53ea\u6c42\u7565\u77e5\u4e00\u4e8c\u3002<\/p>\n<p><strong>\u975e\u8ba1\u7b97\u673a\u7c7b<\/strong><\/p>\n<p>\u8fd9\u7bc7\u5c0f\u7ed3\u672c\u610f\u4e0d\u5305\u62ec\u975e\u8ba1\u7b97\u673a\u7c7b\u7684\u4e1c\u897f\u3002\u4e0d\u8fc7\u65e2\u7136\u662f\u4e2a\u4eba\u5c0f\u7ed3\uff0c\u4e5f\u5199\u4e0a\u4e00\u4e9b\u3002\u9676\u63a8\u8350\u7684\u300a\u7ecf\u6d4e\u5b66\u601d\u7ef4\u65b9\u5f0f\u662f\u300b\u662f\u672c\u5f88\u597d\u7684\u7ecf\u6d4e\u5b66\u5165\u95e8\u56fe\u4e66\uff0c\u544a\u8bc9\u6211\u8fb9\u9645\u6210\u672c\u662f\u4ec0\u4e48\u3002\u300a\u82cf\u83f2\u7684\u4e16\u754c\u300b\u662f\u672c\u975e\u5e38\u975e\u5e38\u597d\u7684\u54f2\u5b66\u5165\u95e8\u56fe\u4e66\uff0c\u7b1b\u5361\u5c14\u201c\u6211\u601d\u6545\u6211\u5728\u201d\u7684\u601d\u8003\u632f\u804b\u53d1\u8069\u3002\u300a\u7231\u4f60\u5c31\u50cf\u7231\u751f\u547d\u300b\u662f\u738b\u6653\u6ce2\u5199\u7684\u60c5\u4e66\uff0c\u5199\u60c5\u4e66\u7684\u4eba\u4e5f\u662f\u5f97\u5b66\u4e60\u5b66\u4e60\u7684\u3002<\/p>\n<p>\u8fd9\u7bc7\u5b66\u4e60\u5c0f\u7ed3\u610f\u5916\u7684\u957f\uff0c\u672c\u4ee5\u4e3a\u53ea\u6709\u4e00\u70b9\u70b9\u7684\u3002\u901a\u8fc7\u5199\u4ed6\uff0c\u7b14\u8005\u4e5f\u987a\u4fbf\u6e29\u4e60\u4e86\u4e00\u4e9b\u3002\u4e0d\u8fc7\u53bb\u5e74\u5b66\u7684\u4e1c\u897f\u867d\u7136\u591a\uff0c\u4f46\u751f\u4ea7\u7684\u4f18\u79c0\u4ea7\u54c1\u6bd4\u8f83\u5c11\u3002\u5e0c\u671b\u6765\u5e74\u6539\u8fdb\u6539\u8fdb\u3002<\/p>\n","protected":false},"excerpt":{"rendered":"<p>\u4e00\u8f6c\u8eab\u5c31\u52302013\u4e86\u3002\u8bfb\u8005\u65b0\u5e74\u5feb\u4e50\uff0c\u5e0c\u671b\u5403\u5230\u997a\u5b50\u7684\u4eba\u90fd\u5e78\u798f\u3002<br \/>\n\u65b0\u5e74\u4f0a\u59cb\uff0c\u7b14\u8005\u5728\u60f3\u505a\u70b9\u4ec0\u4e48\u4e4b\u524d\uff0c\u8fd8\u662f\u56de\u987e\u4e0b\u53bb\u5e74\u505a\u4e86\u4e9b\u4ec0\u4e48\uff0c\u597d\u6b79\u6709\u4e2a\u4ea4\u4ee3\u3002\u8bb0\u5f55\u4e0b\u5b66\u4e60\u7684\u8f68\u8ff9\uff0c\u5206\u4eab\u7ed9\u60a8\u8fd8\u6709\u672a\u6765\u7684\u81ea\u5df1\u3002<\/p>\n<p><a class=\"excerpt-more\" href=\"http:\/\/yankay.com\/2012%e5%b9%b4%e5%ad%a6%e4%b9%a0%e5%b0%8f%e7%bb%93\/\">\u9605\u8bfb\u66f4\u591a......<\/a><\/p>","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[5],"tags":[11,100],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>2012\u5e74\u5b66\u4e60\u5c0f\u7ed3 - \u6211\u81ea\u7136<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"http:\/\/yankay.com\/2012\u5e74\u5b66\u4e60\u5c0f\u7ed3\/\" \/>\n<meta property=\"og:locale\" content=\"zh_CN\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"2012\u5e74\u5b66\u4e60\u5c0f\u7ed3 - \u6211\u81ea\u7136\" \/>\n<meta property=\"og:description\" content=\"\u4e00\u8f6c\u8eab\u5c31\u52302013\u4e86\u3002\u8bfb\u8005\u65b0\u5e74\u5feb\u4e50\uff0c\u5e0c\u671b\u5403\u5230\u997a\u5b50\u7684\u4eba\u90fd\u5e78\u798f\u3002 \u65b0\u5e74\u4f0a\u59cb\uff0c\u7b14\u8005\u5728\u60f3\u505a\u70b9\u4ec0\u4e48\u4e4b\u524d\uff0c\u8fd8\u662f\u56de\u987e\u4e0b\u53bb\u5e74\u505a\u4e86\u4e9b\u4ec0\u4e48\uff0c\u597d\u6b79\u6709\u4e2a\u4ea4\u4ee3\u3002\u8bb0\u5f55\u4e0b\u5b66\u4e60\u7684\u8f68\u8ff9\uff0c\u5206\u4eab\u7ed9\u60a8\u8fd8\u6709\u672a\u6765\u7684\u81ea\u5df1\u3002\" \/>\n<meta property=\"og:url\" content=\"http:\/\/yankay.com\/2012\u5e74\u5b66\u4e60\u5c0f\u7ed3\/\" \/>\n<meta property=\"og:site_name\" content=\"\u6211\u81ea\u7136\" \/>\n<meta property=\"article:published_time\" content=\"2013-01-03T04:20:52+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-03-28T12:07:57+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"http:\/\/yankay.com\/#website\",\"url\":\"http:\/\/yankay.com\/\",\"name\":\"\\u6211\\u81ea\\u7136\",\"description\":\"\\u989c\\u5f00\\u7684\\u535a\\u5ba2\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"http:\/\/yankay.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"zh-CN\"},{\"@type\":\"WebPage\",\"@id\":\"http:\/\/yankay.com\/2012%e5%b9%b4%e5%ad%a6%e4%b9%a0%e5%b0%8f%e7%bb%93\/#webpage\",\"url\":\"http:\/\/yankay.com\/2012%e5%b9%b4%e5%ad%a6%e4%b9%a0%e5%b0%8f%e7%bb%93\/\",\"name\":\"2012\\u5e74\\u5b66\\u4e60\\u5c0f\\u7ed3 - \\u6211\\u81ea\\u7136\",\"isPartOf\":{\"@id\":\"http:\/\/yankay.com\/#website\"},\"datePublished\":\"2013-01-03T04:20:52+00:00\",\"dateModified\":\"2021-03-28T12:07:57+00:00\",\"author\":{\"@id\":\"http:\/\/yankay.com\/#\/schema\/person\/f52d918e9bfa51c4454172c2caa7704f\"},\"breadcrumb\":{\"@id\":\"http:\/\/yankay.com\/2012%e5%b9%b4%e5%ad%a6%e4%b9%a0%e5%b0%8f%e7%bb%93\/#breadcrumb\"},\"inLanguage\":\"zh-CN\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"http:\/\/yankay.com\/2012%e5%b9%b4%e5%ad%a6%e4%b9%a0%e5%b0%8f%e7%bb%93\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"http:\/\/yankay.com\/2012%e5%b9%b4%e5%ad%a6%e4%b9%a0%e5%b0%8f%e7%bb%93\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"http:\/\/yankay.com\/\",\"url\":\"http:\/\/yankay.com\/\",\"name\":\"\\u9996\\u9875\"}},{\"@type\":\"ListItem\",\"position\":2,\"item\":{\"@id\":\"http:\/\/yankay.com\/2012%e5%b9%b4%e5%ad%a6%e4%b9%a0%e5%b0%8f%e7%bb%93\/#webpage\"}}]},{\"@type\":\"Person\",\"@id\":\"http:\/\/yankay.com\/#\/schema\/person\/f52d918e9bfa51c4454172c2caa7704f\",\"name\":\"yankay\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"http:\/\/yankay.com\/#personlogo\",\"inLanguage\":\"zh-CN\",\"url\":\"http:\/\/1.gravatar.com\/avatar\/426bb830224c1471011d92a830a6ed4f?s=96&d=wavatar&r=g\",\"contentUrl\":\"http:\/\/1.gravatar.com\/avatar\/426bb830224c1471011d92a830a6ed4f?s=96&d=wavatar&r=g\",\"caption\":\"yankay\"},\"sameAs\":[\"http:\/\/47.100.65.109\"],\"url\":\"http:\/\/yankay.com\/author\/yankay\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/posts\/26588"}],"collection":[{"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/comments?post=26588"}],"version-history":[{"count":2,"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/posts\/26588\/revisions"}],"predecessor-version":[{"id":27245,"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/posts\/26588\/revisions\/27245"}],"wp:attachment":[{"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/media?parent=26588"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/categories?post=26588"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/tags?post=26588"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}