{"id":26652,"date":"2013-01-25T21:03:37","date_gmt":"2013-01-25T13:03:37","guid":{"rendered":"http:\/\/www.yankay.com\/?p=26652"},"modified":"2021-03-28T20:06:56","modified_gmt":"2021-03-28T12:06:56","slug":"nosql-anti-pattern-document","status":"publish","type":"post","link":"http:\/\/yankay.com\/nosql-anti-pattern-document\/","title":{"rendered":"NoSQL\u53cd\u6a21\u5f0f &#8211; \u6587\u6863\u6570\u636e\u5e93\u7bc7"},"content":{"rendered":"<p>\u6211\u4eec\u8bbe\u8ba1\u5173\u7cfb\u6570\u636e\u5e93Schema\u7684\u90fd\u6709\u4e00\u5957\u5b8c\u6574\u7684\u65b9\u6848\uff0c\u800cNoSQL\u5374\u6ca1\u6709\u8fd9\u4e9b\u3002\u534a\u5e74\u524d\u7b14\u8005\u8bfb\u4e86\u672c\u300aSQL\u53cd\u6a21\u5f0f\u300b\u7684\u4e66\uff0c\u89c9\u5f97\u975e\u5e38\u597d\u3002\u5c31\u5f00\u59cb\u7559\u610f\uff0c\u5bf9\u4e8eNoSQL\u662f\u5426\u4e5f\u6709\u53cd\u6a21\u5f0f\uff1f\u597d\u7684\u53cd\u6a21\u5f0f\u53ef\u4ee5\u5728\u6211\u4eec\u8bbe\u8ba1Schema\u544a\u8bc9\u54ea\u91cc\u662f\u9677\u9631\u548c\u60ac\u5d16\u3002NoSQL\u5ba3\u4f20\u7684\u65f6\u5019\u5f80\u5f80\u5ba3\u79f0\u662fSchemaLess\u7684\uff0c\u8fd9\u4f1a\u8ba9\u4eba\u8bef\u89e3\u5176\u4e0d\u9700\u8981\u8bbe\u8ba1Schema\u3002\u4f46\u5982\u679c\u4e0d\u610f\u8bc6\u5230\u8bbe\u8ba1Schema\u7684\u5fc5\u8981\uff0c\u9677\u9631\u5c31\u5728\u4e00\u76f4\u5728\u9ed1\u6697\u4e2d\u7b49\u7740\u6211\u4eec\u3002\u8fd9\u7bc7\u6587\u7ae0\u5c31\u603b\u7ed3\u4e00\u4e9b\u522b\u4eba\u7684\uff0c\u4e5f\u6709\u81ea\u5df1\u72af\u8fc7\u7684\u6df1\u75db\u7684\u8bbe\u8ba1Schema\u9519\u8bef\u3002<\/p>\n<p>NoSQL\u6570\u636e\u5e93\u6700\u4e3b\u6d41\u7684\u6709\u6587\u6863\u6570\u636e\u5e93\uff0c\u5217\u5b58\u6570\u636e\u5e93\uff0c\u952e\u503c\u6570\u636e\u5e93\u3002\u4e09\u8005\u5206\u522b\u6709\u4ee3\u8868\u4f5cMongoDB\uff0cHBase\u548cRedis\u3002\u5982\u679c\u5c06NoSQL\u6bd4\u4f5c\u5175\u5668\u7684\u8bdd\uff0c\u53ef\u4ee5\u8fd9\u6837(MySQL\u662f\u5178\u578b\u7684\u5173\u7cfb\u578b\u6570\u636e\u5e93\uff0c\u4e00\u6837\u53c2\u4e0e\u6bd4\u8f83)\uff1a<\/p>\n<ul>\n<li><strong>MySQL<\/strong>\u4ea7\u751f\u5e74\u4ee3\u8f83\u65e9\uff0c\u800c\u4e14\u968f\u7740LAMP\u5927\u6f6e\u5f97\u4ee5\u6210\u719f\u3002\u5c3d\u7ba1\u5176\u6ca1\u6709\u4ec0\u4e48\u5927\u7684\u6539\u8fdb\uff0c\u4f46\u662f\u65b0\u5174\u7684\u4e92\u8054\u7f51\u4f7f\u7528\u7684\u6700\u591a\u7684\u6570\u636e\u5e93\u3002\u5c31\u50cf\u4f20\u7edf\u7684\u83dc\u5200\uff0c\u7ed3\u6784\u7b80\u5355\uff0c\u51e0\u767e\u5e74\u6ca1\u6709\u6539\u8fdb\u3002\u4f46\u662f\u4e0d\u59a8\u788d\u4ea7\u751f\u5404\u5f0f\u5404\u6837\u7684\u5200\u6cd5\uff0c\u53ea\u8981\u6709\u4e00\u628a\uff0c\u5c31\u80fd\u80dc\u4efb\u53a8\u623f\u91cc\u7684\u5927\u90e8\u5206\u4e8b\u52a1\u3002MySQL\u4e5f\u662f\u4e00\u6837\uff0c\u6838\u5fc3\u5df2\u7ecf\u7a33\u5b9a\u3002\u4f46\u662f\u5207\u5e93\uff0c\u5206\u8868\uff0c\u5907\u4efd\uff0c\u76d1\u63a7\uff0c\u7b49\u7b49\u624b\u6bb5\u4e00\u5e94\u4ff1\u5168\u3002<\/li>\n<li><strong>MongoDB<\/strong>\u662f\u4e2a\u65b0\u751f\u4e8b\u7269\uff0c\u63d0\u4f9b\u66f4\u7075\u6d3b\u7684Schema\uff0cCapped Collection\uff0c\u5f02\u6b65\u63d0\u4ea4\uff0c\u5730\u7406\u4f4d\u7f6e\u7d22\u5f15\u7b49\u4e94\u82b1\u5341\u8272\u7684\u529f\u80fd\u3002\u5c31\u50cf\u745e\u58eb\u519b\u5200\uff0c\u4e0d\u4f46\u53ef\u4ee5\u5f53\u5200\u7528\uff0c\u8fd8\u53ef\u4ee5\u5f00\u74f6\u76d6\uff0c\u526a\u6307\u7532\u3002\u4f46\u662f\u4ed6\u4e5f\u4e0d\u6bd4MySQL\u5f3a\uff0c\u56e0\u4e3a\u8fd8\u7f3a\u4e4f\u65f6\u95f4\u7684\u78e8\u783a\u3002\u4e00\u662f\u7cfb\u7edf\u672c\u8eab\u7684\u7a33\u5b9a\u6027\uff0c\u4e8c\u662f\u5f00\u53d1\uff0c\u8fd0\u7ef4\u9700\u8981\u66f4\u591a\u7ecf\u9a8c\u624d\u80fd\u6d41\u884c\u3002<\/li>\n<li><strong>HBase<\/strong>\u662f\u4e2a\u4ed7\u52bf\u6b3a\u4eba\u7684\u5927\u8c61\u5175\u3002\u4f9d\u4ed7\u7740Hadoop\u7684\u751f\u6001\u73af\u5883\uff0c\u53ef\u4ee5\u6709\u5f88\u597d\u7684\u6269\u5c55\u6027\u3002\u4f46\u662f\u5c31\u50cf\u8c61\u5175\u4e00\u6837\uff0c\u4f7f\u7528\u8005\u9700\u8981\u517b\u4e00\u5934\u5927\u8c61(Hadoop),\u624d\u80fd\u9a71\u4f7f\u4ed6\u3002<\/li>\n<li><strong>Redis<\/strong>\u662f\u952e\u503c\u5b58\u50a8\u7684\u4ee3\u8868\uff0c\u529f\u80fd\u6700\u7b80\u5355\u3002\u63d0\u4f9b\u968f\u673a\u6570\u636e\u5b58\u50a8\u3002\u5c31\u50cf\u4e00\u6839\u68d2\u5b50\u4e00\u6837\uff0c\u6ca1\u6709\u591a\u4f59\u7684\u6784\u9020\u3002\u4f46\u662f\u4e5f\u6b63\u662f\u56e0\u6b64\uff0c\u4ed6\u7684\u4f38\u7f29\u6027\u7279\u522b\u597d\u3002\u5c31\u50cf\u609f\u7a7a\u624b\u91cc\u7684\u91d1\u7b8d\u68d2\uff0c\u5927\u53ef\u6345\u7834\u5929\uff0c\u5c0f\u80fd\u6210\u7f29\u6210\u9488\u3002<\/li>\n<\/ul>\n<h3>\u6587\u6863\u6570\u636e\u5e93\u7684\u5f97\u5931<\/h3>\n<p>\u5173\u7cfb\u6a21\u578b\u8bd5\u56fe\u5c06\u6570\u636e\u5e93\u6a21\u578b\u548c\u6570\u636e\u5e93\u5b9e\u73b0\u5206\u5f00\uff0c\u8ba9\u5f00\u53d1\u8005\u53ef\u4ee5\u8131\u79bb\u5e95\u5c42\u5f88\u597d\u7684\u64cd\u4f5c\u6570\u636e\u3002\u4f46\u7b14\u8005\u4ee5\u4e3a\u5173\u7cfb\u6a21\u578b\u5728\u4e00\u4e9b\u5e94\u7528\u573a\u666f\u4e0b\u6709\u5f31\u70b9\uff0c\u73b0\u5728\u5df2\u7ecf\u4e0d\u5f97\u4e0d\u9762\u5bf9\u3002<\/p>\n<ul>\n<li><strong><strong><strong>SQL<\/strong><\/strong>\u5f31\u70b9\u4e00\uff1a\u5fc5\u987b\u652f\u6301Join<\/strong>\u3002\u56e0\u4e3a\u6570\u636e\u4e0d\u80fd\u591f\u6709\u91cd\u590d\u3002\u6240\u4ee5\u4f7f\u7528\u8303\u5f0f\u7684\u5173\u7cfb\u6a21\u578b\u4f1a\u4e0d\u53ef\u907f\u514d\u7684\u5927\u91cfJoin\u3002\u5982\u679c\u53c2\u4e0eJoin\u7684\u662f\u4e00\u5f20\u6bd4\u5185\u5b58\u5c0f\u7684\u8868\u8fd8\u597d\u3002\u4f46\u662f\u5982\u679c\u5927\u8868Join\u6216\u8005\u8868\u5206\u5e03\u5728\u591a\u53f0\u673a\u5668\u4e0a\u7684\u8bdd\uff0cJoin\u5c31\u662f\u6027\u80fd\u7684\u5669\u68a6\u3002<\/li>\n<li><strong><strong>SQL\u5f31\u70b9\u4e8c\uff1a<\/strong>\u8ba1\u7b97\u548c\u5b58\u50a8\u8026\u5408<\/strong>\u3002\u5173\u7cfb\u6a21\u578b\u4f5c\u4e3a\u7edf\u4e00\u7684\u6570\u636e\u6a21\u578b\u65e2\u53ef\u4ee5\u7528\u4e8e\u6570\u636e\u5206\u6790\uff0c\u4e5f\u53ef\u4ee5\u7528\u4e8e\u5728\u7ebf\u4e1a\u52a1\u3002\u4f46\u8fd9\u4e24\u8005\u4e00\u4e2a\u5f3a\u8c03\u9ad8\u541e\u5410\uff0c\u4e00\u4e2a\u5f3a\u8c03\u4f4e\u5ef6\u65f6\uff0c\u5df2\u7ecf\u6f14\u5316\u51fa\u5b8c\u5168\u4e0d\u540c\u7684\u67b6\u6784\u3002\u7528\u540c\u4e00\u5957\u6a21\u578b\u6765\u62bd\u8c61\u663e\u7136\u662f\u4e0d\u5408\u9002\u7684\u3002Hadoop\u9488\u5bf9\u7684\u5c31\u662f\u8ba1\u7b97\u7684\u90e8\u5206\u3002MongoDB,Redis\u7b49\u9488\u5bf9\u5728\u7ebf\u4e1a\u52a1\u3002\u4e24\u8005\u90fd\u629b\u5f03\u4e86\u5173\u7cfb\u6a21\u578b\u3002<\/li>\n<\/ul>\n<p>\u9488\u5bf9\u8fd9\u4e24\u4e2a\u68a6\u9b47\u3002\u6587\u6863\u6570\u636e\u5e93\u5982MongoDB\u7684\u7684\u4e3b\u8981\u76ee\u7684\u662f<strong>\u00a0\u63d0\u4f9b\u66f4\u4e30\u5bcc\u7684\u6570\u636e\u7ed3\u6784\u6765\u629b\u5f03Join\u6765\u9002\u5e94\u5728\u7ebf\u4e1a\u52a1<\/strong>\u3002\u5f53\u7136\u4e5f\u4e0d\u662fMongoDB\u5b8c\u5168\u4e0d\u80fd\u7528Join\uff0c\u4e0d\u80fd\u62ff\u6765\u505a\u6570\u636e\u5206\u6790\uff0c\u8ba8\u8bba\u8fd9\u4e2a\u53ea\u662f\u89c1\u4ec1\u89c1\u667a\u7684\u95ee\u9898\u3002\u6240\u4ee5\u6587\u6863\u6570\u636e\u5e93\u5e76\u4e0d\u6bd4\u5173\u7cfb\u6570\u636e\u5e93\u5f3a\u5927\uff0c\u7531\u4e8e\u5bf9Join\u7684\u5f31\u652f\u6301\uff0c\u529f\u80fd\u4f1a\u5f31\u8bb8\u591a\u3002\u8bbe\u8ba1\u5173\u7cfb\u6a21\u578b\u7684\u65f6\u5019\uff0c\u901a\u5e38\u53ea\u9700\u8981\u8003\u8651\u597d\u6570\u636e\u76f4\u63a5\u7684\u5173\u7cfb\uff0c\u5b9a\u4e49\u6570\u636e\u6a21\u578b\u3002\u800c\u8bbe\u8ba1\u6587\u6863\u6570\u636e\u5e93\u6a21\u578b\u7684\u65f6\u5019\uff0c\u8fd8\u9700\u8981\u8003\u8651\u5e94\u7528\u5982\u4f55\u4f7f\u7528\u3002\u56e0\u6b64\u8bbe\u8ba1\u597d\u4e00\u4e2a\u7684\u6587\u6863\u6570\u636e\u5e93Schema\u6bd4\u8bbe\u8ba1\u5173\u7cfb\u6a21\u578b\u66f4\u52a0\u7684\u56f0\u96be\u3002\u9664\u6b64\u4e4b\u5916\uff0c\u7531\u4e8e\u6587\u6863\u6570\u636e\u5e93\u4e8b\u52a1\u7684\u652f\u6301\u4e5f\u662f\u6bd4\u8f83\u5f31\uff0c\u4e00\u822cNoSQL\u53ea\u4f1a\u63d0\u4f9b\u4e00\u4e2a\u884c\u9501\u3002\u8fd9\u4e5f\u7ed9\u8bbe\u8ba1Schema\u66f4\u52a0\u589e\u52a0\u4e86\u96be\u5ea6\u3002\u5bf9\u4e8e\u6587\u6863\u6570\u636e\u5e93\u7684\u4f7f\u7528\u6709\u5f88\u591a\u9700\u8981\u6ce8\u610f\u7684\u5730\u65b9\uff0c\u672c\u6587\u53ea\u5173\u6ce8\u6a21\u578b\u8bbe\u8ba1\u7684\u90e8\u5206\u3002<\/p>\n<h3>\u53cd\u6a21\u5f0f\u4e00\uff1a\u60ef\u6027\u601d\u7ef4\/\u6cbf\u7528\u5173\u7cfb\u6a21\u578b<\/h3>\n<p>\u5173\u7cfb\u6a21\u578b\u662f\u6570\u636e\u5b58\u50a8\u7684\u7ecf\u5178\u6a21\u578b\uff0c\u4f7f\u7528\u6570\u636e\u6a21\u578b\u8303\u5f0f\u7684\u597d\u5904\u975e\u5e38\u7684\u660e\u663e\u3002\u4f46\u662f\u7531\u4e8e\u6587\u6863\u6570\u636e\u5e93\u4e0d\u652f\u6301Join(\u5305\u62ec\u548c\u5916\u952e\u606f\u606f\u76f8\u5173\u7684\u5916\u952e\u7ea6\u675f)\u7b49\u7279\u6027\uff0c\u4e60\u60ef\u6027\u7684\u6cbf\u7528\u5173\u7cfb\u6a21\u578b\u6709\u7684\u65f6\u5019\u4f1a\u51fa\u73b0\u95ee\u9898\u3002\u9700\u8981\u5229\u7528\u8d77\u6587\u6863\u6570\u636e\u5e93\u63d0\u4f9b\u7684\u4e30\u5bcc\u7684\u6570\u636e\u6a21\u578b\u6765\u5e94\u5bf9\u3002<\/p>\n<p>\u503c\u5f97\u4e00\u63d0\u7684\u662f\u6587\u6863\u6570\u636e\u5e93\u7684\u8bbe\u8ba1\u548c\u5173\u7cfb\u6a21\u578b\u4e0d\u540c\uff0c\u662f\u7075\u6d3b\u591a\u6837\u7684\u3002\u5bf9\u4e8e\u540c\u4e00\u4e2a\u60c5\u5f62\uff0c\u53ef\u4ee5\u8bbe\u8ba1\u51fa\u6709\u591a\u79cd\u80fd\u591f\u5de5\u4f5c\u7684\u6a21\u578b\uff0c\u6ca1\u6709\u7edd\u5bf9\u610f\u4e49\u4e0a\u6700\u597d\u7684\u6a21\u578b\u3002<\/p>\n<p>\u4e0b\u56fe\u662f\u5173\u7cfb\u6a21\u578b\u548c\u6587\u6863\u6a21\u578b\u7684\u5bf9\u6bd4\u3002<\/p>\n<p>\u8fd9\u4e2a\u4e00\u4e2a\u535a\u5ba2\u7684\u6570\u636e\u6a21\u578b\uff0c\u6709Blog,User\u7b49\u8868\u3002\u5de6\u4fa7\u662f\u5173\u7cfb\u6a21\u578b\uff0c\u53f3\u4fa7\u662f\u6587\u6863\u6a21\u578b\u3002\u8fd9\u4e2a\u6587\u6863\u6a21\u578b\u5e76\u4e0d\u662f\u5b8c\u5168\u5408\u7406\uff0c\u53ef\u4ee5\u4f5c\u4e3a\u201c\u6b63\u53cd\u4e24\u9762\u6559\u6750\u201d\u5728\u4e0b\u6587\u4e0d\u65ad\u9610\u8ff0\u3002<\/p>\n<p><strong>\u95ee\u9898\u4e00\uff1a\u5b58\u5728\u63cf\u8ff0\u591a\u5bf9\u591a\u7684\u5173\u7cfb\u8868<\/strong><br \/>\n\u75c7\u72b6\uff1a\u6587\u6863\u6570\u636e\u5e93\u4e2d\u5b58\u50a8\u5728\u6709\u7eaf\u7cb9\u7684\u5173\u7cfb\u8868\uff0c\u4f8b\u5982\uff1a<\/p>\n<table>\n<tbody>\n<tr>\n<td valign=\"top\" width=\"213\">id<\/td>\n<td valign=\"top\" width=\"213\">user_id<\/td>\n<td valign=\"top\" width=\"213\">blog_id<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"213\">0<\/td>\n<td valign=\"top\" width=\"213\">0<\/td>\n<td valign=\"top\" width=\"213\">0<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"213\">1<\/td>\n<td valign=\"top\" width=\"213\">0<\/td>\n<td valign=\"top\" width=\"213\">1<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>\u8fd9\u6837\u7684\u8868\u5c31\u7b97\u5728\u5173\u7cfb\u6a21\u578b\u4e2d\u4e5f\u662f\u4e0d\u59a5\u7684\uff0c\u56e0\u4e3a\u8fd9\u4e2aID\u975e\u5e38\u7684\u591a\u4f59\uff0c\u53ef\u4ee5\u7528\u8054\u5408\u4e3b\u952e\u6765\u89e3\u51b3\u3002\u4f46\u662f\u5728\u6587\u6863\u6570\u636e\u5e93\u4e2d\uff0c\u7531\u4e8e\u5fc5\u987b\u5f3a\u5236\u5355\u4e3b\u952e\uff0c\u4e0d\u5f97\u4e0d\u91c7\u53d6\u8fd9\u6837\u7684\u8bbe\u8ba1\u3002<\/p>\n<p>\u574f\u5904\uff1a<\/p>\n<ol>\n<li><span style=\"line-height: 22px;\">\u7834\u574f\u6570\u636e\u5b8c\u5907\u6027\u3002\u7531\u4e8eID\u662f\u4e3b\u952e\uff0c\u5728\u6570\u636e\u6a21\u578b\u4e0a\u6ca1\u6709\u7ea6\u675f\u6765\u4fdd\u8bc1\u4e0d\u51fa\u73b0\u91cd\u590d\u7684user_id,blog_id\u5bf9\u3002\u4e00\u65e6\u6570\u636e\u51fa\u73b0\u91cd\u590d\uff0c\u66f4\u65b0\u5220\u9664\u90fd\u662f\u95ee\u9898\u3002<\/span><\/li>\n<li><span style=\"line-height: 22px;\">\u7d22\u5f15\u8fc7\u591a\u3002\u7531\u4e8e\u662f\u5173\u7cfb\u8868\uff0c\u5fc5\u987b\u5728user_id\u548cblog_id\u4e0a\u9762\u5206\u522b\u5efa\u4e00\u4e2a\u7d22\u5f15\u3002\u5f71\u54cd\u6027\u80fd\u3002<\/span><\/li>\n<\/ol>\n<p>\u89e3\u51b3\u65b9\u6848\uff1a<br \/>\n\u4f7f\u7528\u6587\u6863\u6570\u636e\u5e93\u5178\u578b\u7684\u5904\u7406\u591a\u5bf9\u591a\u7684\u529e\u6cd5\u3002\u4e0d\u662f\u5efa\u7acb\u4e00\u5f20\u5173\u7cfb\u8868\uff0c\u800c\u662f\u5728\u5176\u4e2d\u4e00\u4e2a\u6587\u6863(\u5982User)\u4e2d\uff0c\u52a0\u5165\u4e00\u4e2aList\u5b57\u6bb5\u3002<\/p>\n<div><\/div>\n<table>\n<tbody>\n<tr>\n<td valign=\"top\" width=\"160\">user_id<\/td>\n<td valign=\"top\" width=\"160\">user_name<\/td>\n<td valign=\"top\" width=\"160\">blog_id[]<\/td>\n<td valign=\"top\" width=\"160\">\u2026\u2026<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"160\">0<\/td>\n<td valign=\"top\" width=\"160\">Jake<\/td>\n<td valign=\"top\" width=\"160\">0,1<\/td>\n<td valign=\"top\" width=\"160\">\u2026\u2026<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"160\">1<\/td>\n<td valign=\"top\" width=\"160\">Rose<\/td>\n<td valign=\"top\" width=\"160\">1,2<\/td>\n<td valign=\"top\" width=\"160\">\u2026\u2026<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p><strong>\u95ee\u9898\u4e8c:\u6ca1\u6709\u533a\u5206&#8221;\u4e00\u5bf9\u591a\u5173\u7cfb&#8221;\u548c\u201c\u591a\u5bf9\u4e00\u5173\u7cfb\u201d<\/strong><br \/>\n\u75c7\u72b6\uff1a\u5173\u7cfb\u6a21\u578b\u4e0d\u533a\u5206\u201c\u4e00\u5bf9\u591a\u201d\u548c\u201c\u591a\u5bf9\u4e00\u201d\uff0c\u5bf9\u4e8e\u6587\u6863\u6570\u636e\u5e93\u6765\u8bb2\uff0c\u5173\u7cfb\u6a21\u578b\u53ea\u6709\u201c\u591a\u5bf9\u4e00\u201d\u3002\u5c31\u50cf\u8fd9\u5f20Comment\u8868\uff1a<\/p>\n<table>\n<tbody>\n<tr>\n<td valign=\"top\" width=\"160\">comment_id<\/td>\n<td valign=\"top\" width=\"160\">user_id<\/td>\n<td valign=\"top\" width=\"160\">content<\/td>\n<td valign=\"top\" width=\"160\">\u2026\u2026<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"160\">0<\/td>\n<td valign=\"top\" width=\"160\">0<\/td>\n<td valign=\"top\" width=\"160\">\u201cNoSQL\u53cd\u6a21\u5f0f\u662f\u597d\u6587\u7ae0\u201d<\/td>\n<td valign=\"top\" width=\"160\">\u2026\u2026<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"160\">1<\/td>\n<td valign=\"top\" width=\"160\">0<\/td>\n<td valign=\"top\" width=\"160\">\u201c\u662f\u554a\u201d<\/td>\n<td valign=\"top\" width=\"160\">\u2026\u2026<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>\u5982\u679c\u6574\u4e2a\u6a21\u578b\u90fd\u662f\u8fd9\u6837\u7684\u201c\u591a\u5bf9\u4e00\u201d\u5173\u7cfb\u5c31\u9700\u8981\u53cd\u601d\u4e86\u3002<\/p>\n<p>\u574f\u5904\uff1a<\/p>\n<ol>\n<li><span style=\"line-height: 22px;\">\u989d\u5916\u7d22\u5f15\u3002\u5982\u679c\u5ba2\u6237\u7aef\u5df2\u77e5user_id,\u9700\u8981\u83b7\u5f97User\u4fe1\u606f\u548cComment\u4fe1\u606f\uff0c\u9700\u8981\u6267\u884c\u4e24\u6b21\u67e5\u8be2\u3002\u5176\u4e2d\u4e00\u6b21\u67e5\u8be2\u9700\u8981\u4f7f\u7528\u7d22\u5f15\u3002\u5e76\u4e14\u8981\u5728\u5ba2\u6237\u7aef\u81ea\u5df1Join\u3002\u8fd9\u6837\u53ef\u80fd\u6709\u6f5c\u5728\u6027\u80fd\u95ee\u9898\u3002<\/span><\/li>\n<\/ol>\n<p>\u89e3\u51b3\u65b9\u6848\uff1a<br \/>\n\u95ee\u9898\u7684\u6838\u5fc3\u5728\u4e8e\u662f\u5df2\u77e5user_id\u67e5\u8be2\u4e24\u5f20\u8868\uff0c\u8fd8\u662f\u5df2\u77e5comment_id\u67e5\u8be2\u4e24\u5f20\u8868\u3002\u5982\u679c\u662f\u5df2\u77e5comment_id\u8fd9\u6837\u7684\u8bbe\u8ba1\u5c31\u662f\u5408\u7406\u7684\uff0c\u4f46\u662f\u5982\u679c\u662f\u5df2\u77e5user_id\u6765\u67e5\u8be2\uff0c\u628a\u5173\u7cfb\u653e\u5728user\u8868\u91cc\u7684\u8bbe\u8ba1\u66f4\u5408\u7406\u4e00\u4e9b\u3002<\/p>\n<div><\/div>\n<table>\n<tbody>\n<tr>\n<td valign=\"top\" width=\"160\">user_id<\/td>\n<td valign=\"top\" width=\"160\">user_name<\/td>\n<td valign=\"top\" width=\"160\">comment_id[]<\/td>\n<td valign=\"top\" width=\"160\">\u2026\u2026<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"160\">0<\/td>\n<td valign=\"top\" width=\"160\">Jake<\/td>\n<td valign=\"top\" width=\"160\">0,1<\/td>\n<td valign=\"top\" width=\"160\">\u2026\u2026<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"160\">1<\/td>\n<td valign=\"top\" width=\"160\">Rose<\/td>\n<td valign=\"top\" width=\"160\">1,2<\/td>\n<td valign=\"top\" width=\"160\">\u2026\u2026<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>\u8fd9\u6837\u7684\u8bbe\u8ba1\uff0c\u5c31\u53ef\u4ee5\u907f\u514d\u4e00\u4e2a\u7d22\u5f15\u3002\u540c\u7406\uff0c\u5bf9\u4e8e\u591a\u5bf9\u591a\u4e5f\u662f\u4e00\u6837\u7684\uff0c\u901a\u8fc7\u5408\u7406\u7684\u5b89\u6392\u5b57\u6bb5\u7684\u4f4d\u7f6e\u53ef\u4ee5\u907f\u514d\u7d22\u5f15\u3002<\/p>\n<p>\u6b63\u786e\u4f7f\u7528\u7684\u573a\u5408\uff1a<\/p>\n<p>\u5173\u7cfb\u578b\u6a21\u578b\u662f\u975e\u5e38\u6210\u529f\u7684\u6570\u636e\u6a21\u578b\uff0c\u5408\u7406\u7684\u6cbf\u7528\u662f\u975e\u5e38\u597d\u7684\u3002\u4f46\u662f\u7531\u4e8e\u6587\u6863\u6570\u636e\u5e93\u7684\u7279\u70b9\uff0c\u9700\u8981\u9002\u5f53\u7684\u8c03\u6574\uff0c\u8fd9\u6837\u5f97\u51fa\u7684\u6570\u636e\u6a21\u578b\uff0c\u5c3d\u7ba1\u6027\u80fd\u4e0d\u662f\u6700\u4f18\uff0c\u4f46\u662f\u6709\u6700\u597d\u7684\u7075\u6d3b\u6027\u3002\u5e76\u4e14\u4e5f\u6709\u5229\u4e8e\u548c\u5173\u7cfb\u6570\u636e\u5e93\u8f6c\u6362\u3002<\/p>\n<h3>\u53cd\u6a21\u5f0f\u4e8c\uff1a\u5904\u5904\u5f15\u7528\u5ba2\u6237\u7aefJoin<\/h3>\n<p>\u75c7\u72b6\uff1a\u6570\u636e\u5e93\u8bbe\u8ba1\u4e2d\u5145\u6ee1\u4e86xx_id\u7684\u5b57\u7aef\uff0c\u5728\u67e5\u8be2\u7684\u65f6\u5019\u9700\u8981\u5927\u91cf\u7684\u624b\u52a8Join\u64cd\u4f5c\u3002\u5c31\u6d89\u53ca\u5230\u4e86\u8fd9\u4e2a\u53cd\u6a21\u5f0f\u3002\u6b63\u5982\u4e0a\u9762\u63d0\u5230\u7684\u535a\u5ba2\u7684\u5173\u7cfb\u6a21\u578b\uff0c\u5982\u679c\u5df2\u77e5blog_id\u67e5\u8be2comments\uff0c\u9700\u8981\u81f3\u5c11\u6267\u884c3\u6b21\u67e5\u8be2\uff0c\u5e76\u4e14\u624b\u52a8Join\u3002<\/p>\n<p>\u574f\u5904\uff1a<\/p>\n<ol>\n<li><span style=\"line-height: 22px;\">\u624b\u52a8Join\uff0c\u9ebb\u70e6\u4e14\u6613\u51fa\u9519\u3002\u6587\u6863\u6570\u636e\u5e93\u4e0d\u652f\u6301Join\u4e14\u6ca1\u6709\u5916\u952e\u4fdd\u8bc1\u3002\u56e0\u6b64\u9700\u8981\u5728\u5ba2\u6237\u7aefJoin\uff0c\u8fd9\u6837\u7684\u64cd\u4f5c\u5bf9\u4e8e\u8f6f\u4ef6\u5f00\u53d1\u6765\u8bb2\u662f\u6bd4\u8f83\u7e41\u7410\u7684\u3002\u7531\u4e8e\u6ca1\u6709\u5916\u952e\u4fdd\u8bc1\uff0c\u56e0\u6b64\u4e0d\u80fd\u4fdd\u8bc1\u53d6\u5f97\u7684ID\u5728\u6570\u636e\u5e93\u91cc\u9762\u662f\u6709\u6570\u636e\u7684\u3002\u5728\u5904\u7406\u7684\u65f6\u5019\u9700\u8981\u4e0d\u65ad\u5224\u65ad\uff0c\u5bb9\u6613\u51fa\u9519\u3002<\/span><\/li>\n<li><span style=\"line-height: 22px;\">\u591a\u6b21\u67e5\u8be2\u3002\u5982\u679c\u5f15\u7528\u8fc7\u591a\uff0c\u67e5\u8be2\u7684\u65f6\u5019\u9700\u8981\u591a\u6b21\u67e5\u8be2\u624d\u80fd\u67e5\u5230\u8db3\u591f\u7684\u6570\u636e\u3002\u672c\u6765\u6587\u6863\u6570\u636e\u5e93\u662f\u5f88\u5feb\u7684\uff0c\u4f46\u662f\u7531\u4e8e\u591a\u6b21\u67e5\u8be2\uff0c\u7ed9\u6570\u636e\u5e93\u589e\u52a0\u4e86\u538b\u529b\uff0c\u83b7\u53d6\u5168\u90e8\u6570\u636e\u7684\u65f6\u95f4\u4e5f\u4f1a\u589e\u52a0\u3002<\/span><\/li>\n<li><span style=\"line-height: 22px;\">\u4e8b\u52a1\u5904\u7406\u7e41\u7410\u3002\u6587\u6863\u6570\u636e\u5e93\u4e00\u822c\u4e0d\u652f\u6301\u4e00\u822c\u610f\u4e49\u4e0a\u4e8b\u52a1\uff0c\u53ea\u652f\u6301\u884c\u9501\u3002\u5982\u679c\u6587\u6863\u6570\u636e\u5e93\u6709\u7ed9\u591a\u4e2a\u8fde\u63a5\u3002\u5728\u63d2\u5165\u7684\u65f6\u5019\uff0c\u4e8b\u52a1\u7684\u5904\u7406\u5c31\u662f\u5669\u68a6\u3002\u5728\u6587\u6863\u6570\u636e\u5e93\u4e2d\u4f7f\u7528\u4e8b\u52a1\uff0c\u9700\u8981\u4f7f\u7528\u884c\u9501\uff0c\u5728\u8fdb\u884c\u5927\u91cf\u7684\u5904\u7406\u3002\u592a\u8fc7\u7e41\u7410\uff0c\u611f\u5174\u8da3\u7684\u8bfb\u8005\u53ef\u4ee5\u641c\u4e00\u4e0b\u3002<\/span><\/li>\n<\/ol>\n<p>\u89e3\u51b3\u65b9\u6848\uff1a<br \/>\n\u9002\u5f53\u4f7f\u7528\u5185\u8054\u6570\u636e\u7ed3\u6784\u3002\u7531\u4e8e\u6587\u6863\u6570\u636e\u5e93\u652f\u6301\u66f4\u590d\u6742\u7684\u6570\u636e\u7ed3\u6784\u53ef\u4ee5\u5c06\u5f15\u7528\u8f6c\u6362\u4e3a\u5185\u8054\u7684\u6570\u636e\uff0c\u800c\u4e0d\u7528\u65b0\u5efa\u4e00\u5f20\u8868\u3002\u8fd9\u6837\u505a\u53ef\u4ee5\u89e3\u51b3\u4e0a\u9762\u7684\u4e00\u4e9b\u95ee\u9898\uff0c\u662f\u4e00\u4e2a\u63a8\u8350\u7684\u65b9\u6848\u3002\u5c31\u50cf\u4e0a\u9762\u535a\u5ba2\u7684\u4f8b\u5b50\u4e00\u6837\u3002\u5c06\u4e94\u5f20\u8868\u7b80\u5316\u6210\u4e86\u4e24\u5f20\u8868\u3002\u90a3\u4ec0\u4e48\u65f6\u5019\u4f7f\u7528\u5185\u8054\u5462\uff1f\u4e00\u822c\u8ba4\u4e3a<\/p>\n<div>\n<ul>\n<li><span style=\"line-height: 19px;\">\u4f7f\u7528\u5185\u8054\u53ef\u4ee5\u89e3\u51b3\u8bfb\u6027\u80fd\u95ee\u9898\uff0c\u660e\u663e\u51cf\u5c11Query\u7684\u6b21\u6570\u7684\u65f6\u5019\u3002<\/span><\/li>\n<li><span style=\"line-height: 19px;\">\u53ef\u4ee5\u7b80\u5316\u6570\u636e\u6a21\u578b\uff0c\u5316\u7b80\u8868\u4e4b\u95f4\u7684\u5173\u7cfb\uff0c\u800c\u540c\u65f6\u4e0d\u4f1a\u5f71\u54cd\u7075\u6d3b\u6027\u7684\u65f6\u5019\u3002<\/span><\/li>\n<li><span style=\"line-height: 19px;\">\u4e8b\u52a1\u53ef\u4ee5\u5f97\u5230\u7b80\u5316\u4e3a\u5355\u884c\u4e8b\u52a1\u7684\u65f6\u5019<\/span><\/li>\n<\/ul>\n<\/div>\n<div>\u6b63\u786e\u4f7f\u7528\u7684\u573a\u5408\uff1a<\/div>\n<p>\u8303\u5f0f\u5316\u7684\u4f7f\u7528\u573a\u666f\uff0c\u6587\u6863\u6570\u636e\u5e93\u4f1a\u88ab\u591a\u4e2a\u5e94\u7528\u4f7f\u7528\u3002\u7531\u4e8e\u6570\u636e\u5e93\u8bbe\u8ba1\u65e0\u6cd5\u4f30\u8ba1\u591a\u4e2a\u5e94\u7528\u73b0\u5728\u53ca\u5c06\u6765\u7684\u67e5\u8be2\u60c5\u51b5\uff0c\u9700\u8981\u6781\u5927\u7684\u7075\u6d3b\u6027\u3002\u5728\u8fd9\u4e2a\u65f6\u5019\uff0c\u4f7f\u7528\u5f15\u7528\u6bd4\u5185\u8054\u9760\u8c31\u3002<\/p>\n<h3>\u53cd\u6a21\u5f0f\u4e09 \u6ee5\u7528\u5185\u8054\u540e\u60a3\u65e0\u7a77<\/h3>\n<p><strong>\u95ee\u9898\u4e00 \u59a8\u788d\u5230\u67e5\u8be2\u7684\u5185\u8054<\/strong><br \/>\n\u75c7\u72b6\uff1a\u9891\u7e41\u67e5\u8be2\u4e00\u4e9b\u5185\u8054\u5b57\u6bb5\uff0c\u4e22\u5f03\u5176\u4ed6\u5b57\u6bb5\u3002<\/p>\n<p>\u574f\u5904\uff1a<\/p>\n<ol>\n<li><span style=\"line-height: 22px;\">\u65e0ID\u7ea6\u675f\uff1a\u4f7f\u7528\u5185\u8054\u5b57\u6bb5\u548c\u5f15\u7528\u4e0d\u540c\uff0c\u662f\u6ca1\u6709ID\u7ea6\u675f\u7684\u3002\u56e0\u6b64\u4e0d\u80fd\u901a\u8fc7ID(\u4e3b\u952e)\u6765\u7ba1\u7406\uff0c\u5982\u679c\u7ecf\u5e38\u9700\u8981\u5355\u72ec\u64cd\u4f5c\u5185\u8054\u5bf9\u8c61\u4f1a\u975e\u5e38\u4e0d\u4fbf\u3002<\/span><\/li>\n<li><span style=\"line-height: 22px;\">\u7d22\u5f15\u6cdb\u6ee5\uff1a\u5982\u679c\u4ee5\u5185\u8054\u5b57\u6bb5\u4e3a\u6761\u4ef6\u8fdb\u884c\u67e5\u8be2\uff0c\u9700\u8981\u5efa\u7acb\u7d22\u5f15\u3002\u6709\u53ef\u80fd\u9020\u6210\u7d22\u5f15\u6cdb\u6ee5\u3002<\/span><\/li>\n<li><span style=\"line-height: 22px;\">\u6027\u80fd\u6d6a\u8d39\uff1a\u5927\u90e8\u5206\u6587\u6863\u6570\u636e\u5e93\u7684\u5b9e\u73b0\u662f\u6309\u884c\u5b58\u50a8\u7684\uff0c\u4e5f\u5c31\u610f\u5473\u7740\uff0c\u5c3d\u7ba1\u53ea\u67e5\u8be2\u4e00\u4e2a\u5b57\u6bb5\uff0c\u4f46\u662fDB\u9700\u8981\u5c06\u6574\u884c\u4ece\u78c1\u76d8\u4e2d\u53d6\u51fa\u3002\u5982\u679c\u5b57\u6bb5\u591f\u5c0f\uff0c\u6587\u6863\u591f\u5927\uff0c\u662f\u5f88\u4e0d\u5408\u7b97\u7684\u3002<\/span><\/li>\n<\/ol>\n<p>\u89e3\u51b3\u65b9\u6848\uff1a<br \/>\n\u5982\u679c\u51fa\u73b0\u4ee5\u4e0a\u7684\u75c7\u7ed3\uff0c\u5c31\u53ef\u4ee5\u8003\u8651\u4f7f\u7528\u5f15\u7528\u4ee3\u66ff\u5185\u8054\u4e86\u3002\u5185\u8054\u7279\u6027\u4e3b\u8981\u7684\u7528\u9014\u5728\u4e8e\u63d0\u9ad8\u6027\u80fd\uff0c\u5982\u679c\u51fa\u73b0\u6027\u80fd\u4e0d\u5347\u53cd\u964d\uff0c\u90a3\u5c31\u6ca1\u6709\u610f\u4e49\u4e86\u3002\u5982\u679c\u5bf9\u6027\u80fd\u6709\u5f88\u5f3a\u70c8\u7684\u8981\u6c42\uff0c\u53ef\u4ee5\u8003\u8651\u4f7f\u7528\u91cd\u590d\u6570\u636e\uff0c\u540c\u6837\u7684\u6570\u636e\u5373\u5728\u5185\u8054\u5b57\u6bb5\u4e2d\u4e5f\u5728\u5f15\u7528\u7684\u8868\u91cc\u9762\u3002\u8fd9\u6837\u53ef\u4ee5\u7ed3\u5408\u5185\u8054\u548c\u5f15\u7528\u7684\u6027\u80fd\u4f18\u52bf\u3002\u7f3a\u70b9\u662f\u6570\u636e\u51fa\u73b0\u91cd\u590d\uff0c\u7ef4\u62a4\u4f1a\u6bd4\u8f83\u9ebb\u70e6\u3002<\/p>\n<p><strong>\u95ee\u9898\u4e8c \u65e0\u9650\u81a8\u80c0\u7684\u5185\u8054<\/strong><br \/>\n\u75c7\u72b6\uff1aList,Map\u7c7b\u578b\u7684\u5185\u8054\u5b57\u6bb5\u4e0d\u65ad\u81a8\u80c0\uff0c\u800c\u4e14\u6ca1\u6709\u9650\u5236\u3002\u5c31\u50cf\u524d\u9762\u63d0\u5230\u7684Blog\u7684\u5185\u8054\u5b57\u6bb5Comment\u3002\u5982\u679c\u5bf9\u6bcf\u4e00\u7bc7Blog\u7684Comment\u6570\u91cf\u6ca1\u6709\u9650\u5236\u7684\u8bdd\uff0cComment\u4f1a\u65e0\u9650\u81a8\u80c0\u3002\u8f7b\u5219\u5f71\u54cd\u6027\u80fd\uff0c\u91cd\u5219\u63d2\u5165\u5931\u8d25\u3002<\/p>\n<table>\n<tbody>\n<tr>\n<td valign=\"top\" width=\"160\">Blog_id<\/td>\n<td valign=\"top\" width=\"160\">content<\/td>\n<td valign=\"top\" width=\"160\">Comment[]<\/td>\n<td valign=\"top\" width=\"160\">\u2026\u2026<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"160\">0<\/td>\n<td valign=\"top\" width=\"160\">\u201c\u2026\u201d<\/td>\n<td valign=\"top\" width=\"160\">\u201cNoSQL\u53cd\u6a21\u5f0f\u662f\u597d\u6587\u7ae0\u201d, \u201c\u662f\u554a\u201d,\u201d\u65e0\u9650\u589e\u957f\u4e2d\u201d\u2026<\/td>\n<td valign=\"top\" width=\"160\">\u2026\u2026<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>\u574f\u5904\uff1a<\/p>\n<ol>\n<li><span style=\"line-height: 22px;\">\u63d2\u5165\u5931\u8d25\u3002\u6587\u6863\u6570\u636e\u5e93\u7684\u6bcf\u6761\u8bb0\u5f55\u90fd\u6709\u6700\u5927\u5927\u5c0f\uff0c\u5e76\u4e14\u4e5f\u6709\u63a8\u8350\u6700\u4f73\u7684\u5927\u5c0f\u3002\u4e00\u822c\u4e0d\u4f1a\u8d85\u8fc74M\u3002\u5c31\u50cf\u521a\u521a\u63d0\u5230\u7684\u4f8b\u5b50\uff0c\u5982\u679c\u662f\u7bc7\u70ed\u95e8\u7684\u535a\u6587\u7684\u8bdd\uff0c\u8bc4\u8bba\u7684\u5927\u5c0f\u5f88\u5bb9\u6613\u5c31\u8d85\u8fc74M\u3002\u5c4a\u65f6\u6587\u6863\u5c06\u65e0\u6cd5\u66f4\u65b0\uff0c\u65b0\u7684\u8bc4\u8bba\u65e0\u6cd5\u63d2\u5165\u3002<\/span><\/li>\n<li><span style=\"line-height: 22px;\">\u6027\u80fd\u62d6\u6cb9\u74f6\u3002\u7531\u4e8e\u5185\u8054\u5b57\u6bb5\u81a8\u80c0\uff0c\u5176\u5927\u5c0f\u5c06\u8fdc\u8fdc\u8d85\u8fc7\u5176\u4ed6\u90e8\u5206\uff0c\u5f71\u54cd\u5176\u4ed6\u90e8\u5206\u7684\u6027\u80fd\u8868\u73b0\u3002\u5e76\u4e14\u56e0\u6b64\u5bfc\u81f4\u8be5\u8bb0\u5f55\u5927\u5c0f\u9891\u7e41\u53d8\u5316\uff0c\u5bf9\u6863\u6570\u636e\u5e93\u7684\u6570\u636e\u6587\u4ef6\u5185\u90e8\u53ef\u80fd\u56e0\u6b64\u4ea7\u751f\u5f88\u591a\u788e\u7247\u3002<\/span><\/li>\n<\/ol>\n<p>\u89e3\u51b3\u65b9\u6848\uff1a<br \/>\n\u8bbe\u5b9a\u6700\u5927\u6570\u76ee\u6216\u8005\u4f7f\u7528\u5f15\u7528\u3002\u8fd8\u662fBlog\u548cComment\u7684\u4f8b\u5b50\uff0c\u53ef\u4ee5\u5c06Comment\u4eceBlog\u4e2d\u5265\u79bb\u51fa\u6210\u4e00\u5f20\u8868\u3002\u5982\u679c\u8003\u8651\u5230\u6027\u80fd\uff0c\u53ef\u4ee5\u5728Blog\u8868\u4e2d\u65b0\u5efa\u4e00\u4e2a\u5b57\u6bb5\u5982\u6700\u8fd1\u7684\u8bc4\u8bba\u3002\u8fd9\u6837\u65e2\u4fdd\u8bc1\u4e86\u6027\u80fd\uff0c\u53c8\u80fd\u591f\u9884\u9632\u81a8\u80c0\u3002<\/p>\n<table>\n<tbody>\n<tr>\n<td valign=\"top\" width=\"160\">Blog_id<\/td>\n<td valign=\"top\" width=\"160\">content<\/td>\n<td valign=\"top\" width=\"160\">last_five_comment[]<\/td>\n<td valign=\"top\" width=\"160\">\u2026\u2026<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"160\">0<\/td>\n<td valign=\"top\" width=\"160\">\u201c\u2026\u201d<\/td>\n<td valign=\"top\" width=\"160\">\u201cNoSQL\u53cd\u6a21\u5f0f\u662f\u597d\u6587\u7ae0\u201d, \u201c\u662f\u554a\u201d,\u201d\u6700\u591a5\u6761\u201d\u2026<\/td>\n<td valign=\"top\" width=\"160\">\u2026\u2026<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p><strong>\u95ee\u9898\u4e09 \u65e0\u6cd5\u7ef4\u62a4\u7684\u5185\u8054<\/strong><br \/>\n\u75c7\u72b6\uff1aDBA\u60f3\u5355\u72ec\u7ef4\u62a4\u5185\u8054\u5b57\u6bb5\uff0c\u4f46\u65e0\u6cd5\u505a\u5230\u3002<\/p>\n<p>\u574f\u5904\uff1a<\/p>\n<ol>\n<li><span style=\"line-height: 22px;\">\u6743\u9650\u7ba1\u7406\u96be\u3002\u6570\u636e\u5e93\u7684\u6743\u9650\u7ba1\u7406\u7684\u6700\u5c0f\u7c92\u5ea6\u662f\u8868\u3002\u5982\u679c\u4f7f\u7528\u5185\u8054\u6280\u672f\uff0c\u5c31\u610f\u5473\u7740\u5185\u8054\u90e8\u5206\u5fc5\u987b\u548c\u5176\u4ed6\u5b57\u6bb5\u7528\u540c\u4e00\u4e2a\u6743\u9650\u6765\u7ba1\u7406\u3002\u6ca1\u6709\u529e\u6cd5\u5728DB\u7ea7\u522b\u9690\u85cf\u3002<\/span><\/li>\n<li><span style=\"line-height: 22px;\">\u5207\u8868\u96be\u3002\u5982\u679c\u53d1\u73b0\u4e00\u5f20\u8868\u7684\u5e9e\u5927\u9700\u8981\u5207\u8868\u3002\u8fd9\u4e2a\u65f6\u5019\u5c31\u6bd4\u8f83\u7ea0\u7ed3\u4e86\u3002\u5982\u679c\u4e00\u5200\u5207\uff0cpartion Key\u7684\u9009\u62e9\uff1b\u7d22\u5f15\u7684\u5931\u6548\u90fd\u4f1a\u6210\u4e3a\u95ee\u9898\u3002\u5982\u679c\u89c9\u5f97\u62c6\u4e3a\u4e24\u5f20\u8868\uff0c\u5c31\u4f1a\u5f88\u597d\u64cd\u4f5c\u7684\u8bdd\uff0c\u5c31\u662f\u5185\u8054\u7684\u8fc7\u5ea6\u4f7f\u7528\u4e86 \u3002<\/span><\/li>\n<li><span style=\"line-height: 22px;\">\u5907\u4efd\u96be\u3002\u5173\u7cfb\u6570\u636e\u5e93\u4e2d\u6bcf\u5f20\u8868\u53ef\u4ee5\u6709\u4e0d\u540c\u7684\u5907\u4efd\u7b56\u7565\u3002\u4f46\u662f\u5982\u679c\u5185\u8054\u8d77\u6765\uff0c\u8fd9\u6837\u7684\u5907\u4efd\u5c31\u505a\u4e0d\u5230\u4e86\u3002<\/span><\/li>\n<\/ol>\n<div><span style=\"line-height: 22px;\">\u89e3\u51b3\u529e\u6cd5\uff1a<\/span><\/div>\n<div>\u8bbe\u8ba1\u6570\u636e\u5e93\u6a21\u578b\u7684\u65f6\u5019\u9700\u8981\u8003\u91cf\u4e4b\u540e\u7684\u7ef4\u62a4\u64cd\u4f5c\uff0c\u5c24\u5176\u662f\u5185\u8054\u7684\u5b57\u6bb5\u9700\u4e0d\u9700\u8981\u5355\u72ec\u7684\u7ef4\u62a4\u3002\u9700\u8981\u548c\u8fd0\u7ef4\u5546\u91cf\u3002\u5982\u679c\u5bf9\u5185\u8054\u7684\u5b57\u6bb5\u6709\u5355\u72ec\u7ef4\u62a4\u7684\u8981\u6c42\uff0c\u53ef\u4ee5\u62c6\u5206\u51fa\u6765\u4f5c\u4e3a\u5f15\u7528\u3002<\/div>\n<p><strong>\u95ee\u9898\u56db \u76ef\u6b7b\u5e94\u7528\u7684\u5185\u8054<\/strong><br \/>\n\u75c7\u72b6\uff1a\u5e94\u7528\u53ef\u4ee5\u975e\u5e38\u597d\u7684\u8fd0\u884c\u5728\u6570\u636e\u5e93\u4e0a\u3002\u4f46\u662f\u5f53\u65b0\u7684\u5e94\u7528\u63a5\u5165\u7684\u65f6\u5019\u4f1a\u5f88\u9ebb\u70e6\u3002\u56e0\u4e3a\u8bbe\u8ba1\u6570\u636e\u6a21\u578b\u7684\u65f6\u5019\u8003\u8651\u5230\u4e86\u67e5\u8be2\u3002\u6240\u4ee5\u5f53\u6709\u65b0\u5e94\u7528\uff0c\u65b0\u67e5\u8be2\u63a5\u5165\u7684\u65f6\u5019\uff0c\u5c31\u4f1a\u96be\u4e8e\u4f7f\u7528\u539f\u6709\u7684\u6a21\u578b\u3002<\/p>\n<p>\u574f\u5904\uff1a<\/p>\n<ol>\n<li><span style=\"line-height: 22px;\">\u65b0\u5e94\u7528\u63a5\u5165\u96be\u3002\u5f53\u65b0\u7684\u5e94\u7528\u8bd5\u56fe\u4f7f\u7528\u540c\u4e00\u4e2a\u6570\u636e\u5e93\u7684\u65f6\u5019\uff0c\u63a5\u5165\u6bd4\u8f83\u56f0\u96be\u3002\u56e0\u4e3a\u67e5\u8be2\u65f6\u4e0d\u540c\u7684\uff0c\u9700\u8981\u8c03\u6574\u6570\u636e\u6a21\u578b\u624d\u80fd\u9002\u5e94\u3002\u4f46\u662f\u8c03\u6574\u6a21\u578b\u53c8\u4f1a\u5f71\u54cd\u539f\u6709\u5e94\u7528\u3002<\/span><\/li>\n<li><span style=\"line-height: 22px;\">\u96c6\u6210\u96be\u3002\u4e0d\u540c\u7684\u5173\u7cfb\u578b\u6570\u636e\u5e93\u53ef\u4ee5\u96c6\u6210\u5728\u4e00\u8d77\uff0c\u5171\u540c\u4f7f\u7528\u3002\u4f46\u662f\u5bf9\u4e8e\u6587\u6863\u6570\u636e\u5e93\uff0c\u867d\u7136\u529f\u80fd\u4e0a\u53ef\u4ee5\u4e92\u8865\uff0c\u4f46\u662f\u7531\u4e8e\u5185\u8054\u6570\u636e\u7ed3\u6784\u7684\u5dee\u5f02\uff0c\u4e5f\u6bd4\u8f83\u96be\u4e8e\u96c6\u6210\u3002<\/span><\/li>\n<li><span style=\"line-height: 22px;\">ETL\u96be\u3002\u73b0\u5728\u5927\u90e8\u5206\u7684\u6570\u636e\u5206\u6790\u7cfb\u7edf\u4f7f\u7528\u7684\u662f\u5173\u7cfb\u6a21\u578b\uff0c\u5c31\u8fdeHadoop\u867d\u7136\u4e0d\u7528\u5173\u7cfb\u6a21\u578b\uff0c\u4f46\u662f\u5176\u4e0a\u7684Hive\u7684\u5e38\u7528\u5de5\u5177\u4e5f\u662f\u6309\u5173\u7cfb\u6a21\u578b\u8bbe\u8ba1\u7684\u3002<br \/>\n<\/span><\/li>\n<\/ol>\n<p>\u89e3\u51b3\u65b9\u6848\uff1a<\/p>\n<p>\u4f7f\u7528\u8303\u5f0f\u8bbe\u8ba1\u6570\u636e\u5e93\uff0c\u5373\u7528\u5f15\u7528\u4ee3\u66ff\u5185\u8054\u3002\u6216\u8005\u5728\u4f7f\u7528\u5185\u8054\u7684\u65f6\u5019\uff0c\u7ed9\u6bcf\u4e2a\u5185\u8054\u5bf9\u8c61\u4e00\u4e2a\u5168\u5c40\u552f\u4e00\u7684Key\uff0c\u4fdd\u8bc1\u5176\u548c\u5173\u7cfb\u6a21\u578b\u76f4\u63a5\u53ef\u4ee5\u5b58\u5728\u6620\u5c04\u5173\u7cfb\uff0c\u8fd9\u6837\u53ef\u4ee5\u63d0\u9ad8\u6570\u636e\u6a21\u578b\u7684\u7075\u6d3b\u6027\u3002\u5982Blog\u8868\uff1a<\/p>\n<div>\n<table>\n<tbody>\n<tr>\n<td valign=\"top\" width=\"160\">Blog_id<\/td>\n<td valign=\"top\" width=\"160\">content<\/td>\n<td valign=\"top\" width=\"160\">Comment[]<\/td>\n<td valign=\"top\" width=\"160\">\u2026\u2026<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"160\">0<\/td>\n<td valign=\"top\" width=\"160\">\u201c\u2026\u201d<\/td>\n<td valign=\"top\" width=\"160\">[{&#8220;id&#8221;=1,&#8221;content&#8221;=\u201cNoSQL\u53cd\u6a21\u5f0f\u662f\u597d\u6587\u7ae0\u201d}, {&#8220;id&#8221;=2,&#8221;content&#8221;=\u201c\u662f\u554a\u201d}\u2026]<\/td>\n<td valign=\"top\" width=\"160\">\u2026\u2026<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<\/div>\n<div><\/div>\n<div>\u8fd9\u6837\u7684\u8bbe\u8ba1\u65e2\u53ef\u4ee5\u5229\u7528\u5230\u5185\u8054\u7684\u597d\u5904\uff0c\u53c8\u80fd\u5c06\u5176\u548c\u5173\u7cfb\u6a21\u578b\u6620\u5c04\u8d77\u6765\u3002\u786e\u5b9a\u662f\u9700\u8981\u624b\u52a8\u7ef4\u62a4comment_id\uff0c\u4fdd\u8bc1\u5176\u5168\u5c40\u552f\u4e00\u6027\u3002<\/div>\n<h3>\u53cd\u6a21\u5f0f\u56db\uff1a\u5728\u7ebf\u8ba1\u7b97<\/h3>\n<p>\u75c7\u72b6\uff1a\u6709\u4e00\u4e9b\u8fd0\u884c\u65f6\u95f4\u5f88\u957f\u7684Query,\u7531\u4e8e\u6709\u805a\u5408\u8ba1\u7b97\uff0c\u7d22\u5f15\u4e5f\u4e0d\u80fd\u89e3\u51b3\u3002\u968f\u7740\u6570\u636e\u91cf\u7684\u589e\u957f\uff0c\u9010\u6e10\u6210\u4e3a\u6027\u80fd\u74f6\u9888\u3002<\/p>\n<p>\u574f\u5904\uff1a<\/p>\n<ol>\n<li><span style=\"line-height: 22px;\">\u5f71\u54cd\u7528\u6237\u4f53\u9a8c\u3002\u5728\u7ebf\u4e1a\u52a1\u4e2d\uff0c\u5982\u679c\u4e00\u4e2a\u67e5\u8be2\u5927\u4e8e4s\uff0c\u7528\u6237\u4f53\u9a8c\u4f1a\u6025\u5267\u4e0b\u964d\u3002\u6309\u4e3b\u952e\u548c\u6309\u7d22\u5f15\u7684\u67e5\u8be2\u90fd\u80fd\u6ee1\u8db3\u8981\u6c42\u3002\u4f46\u662f\u805a\u5408\u64cd\u4f5c\u5f80\u5f80\u9700\u8981\u626b\u63cf\u5168\u8868\u6216\u8005\u5927\u91cf\u7684\u6570\u636e\uff0c\u968f\u7740\u6570\u636e\u91cf\u7684\u589e\u52a0\uff0c\u67e5\u8be2\u65f6\u95f4\u4f1a\u53d8\u957f\uff0c\u7528\u6237\u4e0d\u53ef\u5bb9\u5fcd\u3002<\/span><\/li>\n<li><span style=\"line-height: 22px;\">\u5f71\u54cd\u6570\u636e\u5e93\u6027\u80fd\u3002\u957f\u67e5\u8be2\u7684\u574f\u5904\u6570\u4e0d\u6e05\u3002\u5728\u7ebf\u4e0a\u5e94\u7528\u4e2d\uff0c\u5982\u679c\u51fa\u73b0\u957f\u67e5\u8be2\uff0c\u53ef\u80fd\u4f1a\u9738\u5360\u6570\u636e\u7684\u5927\u90e8\u5206\u8d44\u6e90\uff0c\u5305\u62ecIO\uff0c\u8fde\u63a5\uff0cCPU\u7b49\u7b49\u3002\u5bfc\u81f4\u5176\u4ed6\u5f88\u597d\u7684\u67e5\u8be2\uff0c\u8f7b\u5219\u6027\u80fd\u4e5f\u4e0b\u964d\uff0c\u91cd\u8005\u65e0\u6cd5\u4f7f\u7528\u6570\u636e\u5e93\u3002\u957f\u67e5\u8be2\u53ef\u4ee5\u79f0\u4e4b\u4e3aDB\u6740\u624b\u3002<\/span><\/li>\n<\/ol>\n<p>\u89e3\u51b3\u65b9\u6848\uff1a<br \/>\n\u9996\u5148\u8981\u6743\u8861\uff0c\u8fd9\u4e2a\u805a\u5408\u64cd\u4f5c\u662f\u4e0d\u662f\u5fc5\u8981\u7684\uff0c\u5fc5\u987b\u5b9e\u65f6\u5b8c\u6210\u3002\u5982\u679c\u6ca1\u6709\u5fc5\u8981\u5b9e\u65f6\u5b8c\u6210\u7684\u8bdd\uff0c\u53ef\u4ee5\u91c7\u53d6\u79bb\u7ebf\u64cd\u4f5c\u7684\u65b9\u6848\u3002\u5728\u591c\u6df1\u4eba\u9759\u7684\u65f6\u5019\uff0c\u8dd1\u4e00\u4e2a\u957f\u67e5\u8be2\uff0c\u5c06\u7ed3\u679c\u7f13\u5b58\u8d77\u6765\uff0c\u7ed9\u7b2c\u4e8c\u5929\u4f7f\u7528\u3002\u5982\u679c\u5fc5\u987b\u5b9e\u65f6\u5b8c\u6210\uff0c\u5219\u53ef\u4ee5\u65b0\u5efa\u4e00\u4e2a\u5b57\u6bb5\uff0c\u7528\u201cincr\u201d\u8fd9\u6837\u7684\u64cd\u4f5c\uff0c\u5728\u8fd0\u884c\u7684\u65f6\u5019\uff0c\u5b9e\u65f6\u805a\u5408\u7ed3\u679c\u3002\u800c\u4e0d\u662f\u67e5\u8be2\u7684\u65f6\u5019\u6267\u884c\u4e00\u6b21\u957f\u67e5\u8be2\u3002\u5982\u679c\u903b\u8f91\u6bd4\u8f83\u590d\u6742\uff0c\u6216\u8005\u89c9\u5f97\u5927\u91cf\u201cincr\u201d\u64cd\u4f5c\u7ed9\u6570\u636e\u5e93\u7cfb\u7edf\u5e26\u6765\u4e86\u538b\u529b\uff0c\u53ef\u4ee5\u4f7f\u7528Storm\u4e4b\u7c7b\u7684\u5b9e\u65f6\u6570\u636e\u5904\u7406\u6846\u67b6\u3002\u603b\u4e4b\uff0c\u8981\u614e\u7528\u957f\u67e5\u8be2\u3002<\/p>\n<h3>\u53cd\u6a21\u5f0f\u4e94\uff1a\u628a\u5185\u8054Map\u5bf9\u8c61\u7684Key\u5f53\u4f5cID\u7528<\/h3>\n<p>\u75c7\u72b6\uff1a\u6587\u6863\u6570\u636e\u5e93\u652f\u6301\u5185\u8054Map\u7c7b\u578b\u3002\u5c06\u5176\u4e2dMap\u7684Key\u5f53\u4f5c\u6570\u636e\u5e93\u7684\u4e3b\u952e\u6765\u7528\u3002<\/p>\n<table>\n<tbody>\n<tr>\n<td valign=\"top\" width=\"160\">Blog_id<\/td>\n<td valign=\"top\" width=\"160\">content<\/td>\n<td valign=\"top\" width=\"160\">Comment{}<\/td>\n<td valign=\"top\" width=\"160\">\u2026\u2026<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"160\">0<\/td>\n<td valign=\"top\" width=\"160\">\u201c\u2026\u201d<\/td>\n<td valign=\"top\" width=\"160\">{&#8220;1&#8243;=\u201cNoSQL\u53cd\u6a21\u5f0f\u662f\u597d\u6587\u7ae0\u201d, &#8220;2&#8221;=\u201c\u662f\u554a\u201d}<\/td>\n<td valign=\"top\" width=\"160\">\u2026\u2026<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>\u8fd9\u4e2a\u53cd\u6a21\u5f0f\u5f88\u5bb9\u6613\u72af\uff0c\u56e0\u4e3a\u5728\u7f16\u7a0b\u8bed\u8a00\u4e2dMap\u6570\u636e\u7ed3\u6784\u5c31\u662f\u8fd9\u4e48\u7528\u7684\u3002\u4f46\u662f\u5bf9\u4e8e\u6570\u636e\u5e93\u6a21\u578b\u6765\u8bf4\uff0c\u8fd9\u662f\u4e0d\u6298\u4e0d\u6263\u7684\u53cd\u6a21\u5f0f\u3002<\/p>\n<p>\u574f\u5904\uff1a<\/p>\n<ol>\n<li><span style=\"line-height: 22px;\">\u65e0\u6cd5\u901a\u8fc7\u6570\u636e\u5e93\u505a\u5404\u79cd(&gt;&lt;=)\u67e5\u8be2\u3002\u5bf9\u4e8e\u5173\u7cfb\u578b\u6570\u636e\u5e93\u6765\u8bf4\uff0c\u867d\u7136\u6570\u636e\u7ed3\u6784\u53ef\u4ee5\u5f88\u7075\u6d3b\uff0c\u4f46\u67e5\u8be2\u7684\u65f6\u5019\u90fd\u662f\u6309\u5c42\u6b21\u7684\u3002\u6bd4\u5982comment.id\uff0ccomment.content\u3002\u4e5f\u5c31\u662f\u8bf4\u5176Map\u7c7b\u578b\u4e2d\u7684Key\u53ef\u4ee5\u7406\u89e3\u4e3a\u5c5e\u6027\u540d\u7684\uff0c\u800c\u4e0d\u662f\u7528\u4f5cID\u3002\u56e0\u6b64\u4e00\u65e6\u8fd9\u6837\u4f7f\u7528\uff0c\u5c31\u8131\u79bb\u7684\u6570\u636e\u5e93\u7ba1\u5236\uff0c\u65e0\u6cd5\u4f7f\u7528\u5404\u79cd\u67e5\u8be2\u529f\u80fd\u3002<\/span><\/li>\n<li><span style=\"line-height: 22px;\">\u65e0\u6cd5\u901a\u8fc7\u7d22\u5f15\u67e5\u8be2\u3002\u6587\u6863\u6570\u636e\u53ef\u5efa\u7acb\u7d22\u5f15\u662f\u9700\u8981\u5217\u540d\u7684\u3002\u6bd4\u5982comment.id\u3002\u800c\u8fd9\u6837\u7684\u6570\u636e\u7ed3\u6784\u6ca1\u6709\u56fa\u5b9a\u7684\u5217\u540d\uff0c\u56e0\u6b64\u65e0\u6cd5\u5efa\u7acb\u7d22\u5f15\u3002<\/span><\/li>\n<\/ol>\n<p>\u89e3\u51b3\u65b9\u6848\uff1a<br \/>\n\u4f7f\u7528\u6570\u7ec4+Map\u6765\u89e3\u51b3\u3002\u5982\uff1a<\/p>\n<div>\n<table>\n<tbody>\n<tr>\n<td valign=\"top\" width=\"160\">Blog_id<\/td>\n<td valign=\"top\" width=\"160\">content<\/td>\n<td valign=\"top\" width=\"160\">Comment[]<\/td>\n<td valign=\"top\" width=\"160\">\u2026\u2026<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"160\">0<\/td>\n<td valign=\"top\" width=\"160\">\u201c\u2026\u201d<\/td>\n<td valign=\"top\" width=\"160\">[{&#8220;id&#8221;=1,&#8221;content&#8221;=\u201cNoSQL\u53cd\u6a21\u5f0f\u662f\u597d\u6587\u7ae0\u201d}, {&#8220;id&#8221;=2,&#8221;content&#8221;=\u201c\u662f\u554a\u201d}\u2026]<\/td>\n<td valign=\"top\" width=\"160\">\u2026\u2026<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<\/div>\n<div><\/div>\n<div>\u8fd9\u6837\uff0c\u5c31\u53ef\u4ee5\u4f7f\u7528comment.id\u4f5c\u4e3a\u7d22\u5f15\uff0c\u4e5f\u53ef\u4ee5\u4f7f\u7528\u6570\u636e\u5e93\u7684\u67e5\u8be2\u529f\u80fd\u3002\u7b80\u5355\u6709\u6548\u3002Map\u7c7b\u578b\u4e2d\u7684Key\u662f\u5c5e\u6027\u540d\uff0cValue\u662f\u5c5e\u6027\u503c\u3002\u8fd9\u6837\u7684\u7528\u6cd5\u662f\u6587\u6863\u6570\u636e\u5e93\u6570\u636e\u6a21\u578b\u7684\u672c\u610f\uff0c\u56e0\u6b64\u5176\u63d0\u4f9b\u7684\u5404\u79cd\u529f\u80fd\u624d\u80fd\u5229\u7528\u4e0a\u3002\u5426\u5219\u5c31\u65e0\u6cd5\u4f7f\u7528\u3002<\/div>\n<h3>\u53cd\u6a21\u5f0f\u516d\uff1a\u4e0d\u5408\u7406\u7684ID<\/h3>\n<p>\u75c7\u72b6\uff1a\u4f7f\u7528String\u751a\u81f3\u66f4\u590d\u6742\u6570\u636e\u7ed3\u6784\u4f5c\u4e3a\u7684ID\uff0c\u6216\u8005\u5168\u90e8\u4f7f\u7528\u6570\u636e\u5e93\u63d0\u4f9b\u7684\u81ea\u751f\u6210ID\u3002\u5982\uff1a<\/p>\n<div>\n<table>\n<tbody>\n<tr>\n<td valign=\"top\" width=\"160\">id(\u8be5ID\u7cfb\u7cfb\u7edf\u81ea\u751f\u6210\uff09<\/td>\n<td valign=\"top\" width=\"160\">Blog_id<\/td>\n<td valign=\"top\" width=\"160\">content<\/td>\n<td valign=\"top\" width=\"160\">\u2026\u2026<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"160\">0<\/td>\n<td valign=\"top\" width=\"160\">0<\/td>\n<td valign=\"top\" width=\"160\">&#8230;<\/td>\n<td valign=\"top\" width=\"160\">\u2026\u2026<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<\/div>\n<p>\u574f\u5904:<\/p>\n<ol>\n<li><span style=\"line-height: 22px;\">ID\u6df7\u4e71\u3002\u5982\u679c\u4f7f\u7528\u6570\u636e\u5e93\u63d0\u4f9b\u7684\u81ea\u751f\u6210ID\uff0c\u540c\u65f6\u8868\u4e2d\u8fd8\u6709\u4e00\u4e2a\u7c7b\u4f3c\u6709\u4e3b\u952e\u542b\u4e49\u7684Blog_id\uff0c\u8fd9\u6837\u5f88\u4e0d\u597d\uff0c\u5bb9\u6613\u9020\u6210\u903b\u8f91\u6df7\u4e71\u3002\u7531\u4e8e\u6587\u6863\u6570\u636e\u5e93\u4e0d\u652f\u6301ID\u7684\u91cd\u547d\u540d\uff0c\u4e60\u60ef\u5173\u7cfb\u6570\u636e\u5e93\u505a\u6cd5\u7684\u4eba\u53ef\u80fd\u4f1a\u518d\u5efa\u7acb\u4e00\u4e2a\u81ea\u5df1\u7684\u903b\u8f91ID\u5b57\u6bb5\u3002\u8fd9\u662f\u6ca1\u6709\u5fc5\u8981\u7684\u3002<\/span><\/li>\n<li><span style=\"line-height: 22px;\">\u7d22\u5f15\u5e9e\u5927\uff0c\u6027\u80fd\u4f4e\u4e0b\u3002ID\u662f\u6570\u636e\u5e93\u7684\u975e\u5e38\u91cd\u8981\u7684\u90e8\u5206\u3002ID\u7684\u957f\u5ea6\u5c06\u51b3\u5b9a\u7d22\u5f15(\u5305\u62ec\u4e3b\u952e\u7684\u7d22\u5f15)\u7684\u5927\u5c0f\uff0c\u76f4\u63a5\u5f71\u54cd\u5230\u6570\u636e\u5e93\u6027\u80fd\u3002\u5982\u679c\u7d22\u5f15\u6bd4\u5185\u5b58\u5c0f\uff0c\u6027\u80fd\u4f1a\u5f88\u597d\u3002\u4f46\u4e00\u65e6\u7d22\u5f15\u5927\u5c0f\u8d85\u8fc7\u5185\u5b58\uff0c\u51fa\u73b0\u6570\u636e\u4ea4\u6362\uff0c\u6027\u80fd\u4f1a\u6025\u5267\u4e0b\u964d\u3002\u4e00\u4e2aLong\u53608\u5b57\u8282\uff0c\u4e00\u4e2a20\u4e2a\u5b57\u7b26\u7684UTF8 String\u5360\u7528\u7ea660\u4e2a\u5b57\u8282\u3002\u76f8\u5dee10\u500d\u4e4b\u5de8\uff0c\u4e0d\u80fd\u4e0d\u8003\u8651\u3002<\/span><\/li>\n<\/ol>\n<p>\u89e3\u51b3\u65b9\u6848\uff1a<br \/>\n\u5c3d\u91cf\u4f7f\u7528\u6709\u4e00\u5b9a\u610f\u4e49\u7684\u5b57\u6bb5\u505aID\uff0c\u5e76\u4e14\u4e0d\u5728\u5176\u4ed6\u5b57\u6bb5\u4e2d\u91cd\u590d\u51fa\u73b0\u3002\u4e0d\u4f7f\u7528\u590d\u6742\u7684\u6570\u636e\u7c7b\u578b\u505aID\uff0c\u53ea\u4f7f\u7528int,long\u6216\u8005\u7cfb\u7edf\u63d0\u4f9b\u7684\u4e3b\u952e\u7c7b\u578b\u505aID\u3002<\/p>\n<h3>\u6587\u6863\u6570\u636e\u5e93\u7684\u53cd\u6a21\u5f0f\u603b\u7ed3<\/h3>\n<p>\u9610\u8ff0\u4e86\u8fd9\u4e48\u591a\u7684\u53cd\u6a21\u5f0f\uff0c\u4e0b\u9762\u6709\u4e2a\u4e00\u89c8\u8868\uff0c\u6db5\u76d6\u4e86\u4e0a\u9762\u6240\u6709\u7684\u53cd\u6a21\u5f0f\u3002\u8fd9\u4e2a\u4e00\u89c8\u8868\uff0c\u662f\u6309\u7167\u6587\u6863\u6570\u636e\u5e93\u6a21\u578b\u5efa\u7acb\u7684\u3002\u662f\u4e2a\u6587\u6863\u6570\u636e\u5e93\u6a21\u578b\u7684\u4f8b\u5b50\u3002<\/p>\n<table>\n<tbody>\n<tr>\n<td>ID<\/td>\n<td>\u53cd\u6a21\u5f0f\u540d<\/td>\n<td>\u95ee\u9898<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"55\">0<\/td>\n<td valign=\"top\" width=\"108\">\u5b58\u5728\u63cf\u8ff0\u591a\u5bf9\u591a\u7684\u5173\u7cfb\u8868<\/td>\n<td valign=\"top\" width=\"601\">[{ID\uff1a00<br \/>\n\u75c7\u72b6\uff1a\u6587\u6863\u6570\u636e\u5e93\u4e2d\u5b58\u50a8\u5728\u6709\u7eaf\u7cb9\u7684\u5173\u7cfb\u8868<br \/>\n\u574f\u5904\uff1a[\u7834\u574f\u6570\u636e\u5b8c\u5907\u6027\uff0c\u7d22\u5f15\u8fc7\u591a]<br \/>\n\u89e3\u51b3\u65b9\u6848\uff1a\u52a0\u5165\u4e00\u4e2aList\u5b57\u6bb5<br \/>\n},{<br \/>\nID\uff1a01<br \/>\n\u75c7\u72b6\uff1a\u5173\u7cfb\u6a21\u578b\u4e0d\u533a\u5206\u201c\u4e00\u5bf9\u591a\u201d\u548c\u201c\u591a\u5bf9\u4e00\u201d<br \/>\n\u574f\u5904\uff1a\u989d\u5916\u7d22\u5f15<br \/>\n\u89e3\u51b3\u65b9\u6848\uff1a\u5408\u7406\u7684\u5b89\u6392\u5b57\u6bb5\u7684\u4f4d\u7f6e<br \/>\n}]<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"55\">1<\/td>\n<td valign=\"top\" width=\"108\">\u5904\u5904\u5f15\u7528\u5ba2\u6237\u7aefJoin<\/td>\n<td valign=\"top\" width=\"601\">[{<br \/>\nID\uff1a10<br \/>\n\u75c7\u72b6\uff1a\u67e5\u8be2\u7684\u65f6\u5019\u9700\u8981\u5927\u91cf\u7684\u624b\u52a8Join\u64cd\u4f5c<br \/>\n\u574f\u5904\uff1a[\u624b\u52a8Join\uff0c\u591a\u6b21\u67e5\u8be2, \u4e8b\u52a1\u5904\u7406\u7e41\u7410]<br \/>\n\u89e3\u51b3\u65b9\u6848\uff1a\u9002\u5f53\u4f7f\u7528\u5185\u8054\u6570\u636e\u7ed3\u6784\u3002<br \/>\n}]<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"55\">2<\/td>\n<td valign=\"top\" width=\"108\">\u6ee5\u7528\u5185\u8054\u540e\u60a3\u65e0\u7a77<\/td>\n<td valign=\"top\" width=\"601\">[{<br \/>\nID\uff1a20<br \/>\n\u75c7\u72b6\uff1a\u9891\u7e41\u67e5\u8be2\u4e00\u4e9b\u5185\u8054\u5b57\u6bb5\uff0c\u4e22\u5f03\u5176\u4ed6\u5b57\u6bb5<br \/>\n\u574f\u5904\uff1a[\u65e0ID\u7ea6\u675f\uff0c\u7d22\u5f15\u6cdb\u6ee5, \u6027\u80fd\u6d6a\u8d39]<br \/>\n\u89e3\u51b3\u65b9\u6848\uff1a\u4f7f\u7528\u5f15\u7528\u4ee3\u66ff\u5185\u8054\u4e86,\u5141\u8bb8\u91cd\u590d\u6570\u636e<br \/>\n},{<br \/>\nID\uff1a21<br \/>\n\u75c7\u72b6\uff1aList,Map\u7c7b\u578b\u7684\u5185\u8054\u5b57\u6bb5\u4e0d\u65ad\u81a8\u80c0\uff0c\u800c\u4e14\u6ca1\u6709\u9650\u5236<br \/>\n\u574f\u5904\uff1a[\u63d2\u5165\u5931\u8d25, \u6027\u80fd\u62d6\u6cb9\u74f6]<br \/>\n\u89e3\u51b3\u65b9\u6848\uff1a\u8bbe\u5b9a\u6700\u5927\u6570\u76ee\u6216\u8005\u4f7f\u7528\u5f15\u7528\u3002<br \/>\n},{<br \/>\nID\uff1a22<br \/>\n\u75c7\u72b6\uff1aDBA\u60f3\u5355\u72ec\u7ef4\u62a4\u5185\u8054\u5b57\u6bb5\uff0c\u4f46\u65e0\u6cd5\u505a\u5230<br \/>\n\u574f\u5904\uff1a[\u6743\u9650\u7ba1\u7406\u96be, \u5207\u8868\u96be, \u5907\u4efd\u96be]<br \/>\n\u89e3\u51b3\u65b9\u6848\uff1a\u8bbe\u8ba1\u6570\u636e\u5e93\u6a21\u578b\u7684\u65f6\u5019\u9700\u8981\u8003\u91cf\u4e4b\u540e\u7684\u7ef4\u62a4\u64cd\u4f5c<br \/>\n},{<br \/>\nID\uff1a23<br \/>\n\u75c7\u72b6\uff1a\u5e94\u7528\u53ef\u4ee5\u975e\u5e38\u597d\u7684\u8fd0\u884c\u5728\u6570\u636e\u5e93\u4e0a\u3002\u4f46\u662f\u5f53\u65b0\u7684\u5e94\u7528\u63a5\u5165\u7684\u65f6\u5019\u4f1a\u5f88\u9ebb\u70e6\u3002\u5185\u8054\u76ef\u6b7b\u4e86\u5e94\u7528<br \/>\n\u574f\u5904\uff1a[\u65b0\u5e94\u7528\u63a5\u5165\u96be, \u96c6\u6210\u96be, ETL\u96be]<br \/>\n\u89e3\u51b3\u65b9\u6848\uff1a\u4f7f\u7528\u8303\u5f0f\u8bbe\u8ba1\u6570\u636e\u5e93\uff0c\u5373\u7528\u5f15\u7528\u4ee3\u66ff\u5185\u8054\u3002\u4fdd\u8bc1\u5176\u548c\u5173\u7cfb\u6a21\u578b\u76f4\u63a5\u53ef\u4ee5\u5b58\u5728\u6620\u5c04\u5173\u7cfb<br \/>\n}]<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"55\">3<\/td>\n<td valign=\"top\" width=\"108\">\u5728\u7ebf\u8ba1\u7b97<\/td>\n<td valign=\"top\" width=\"601\">[{<br \/>\nID\uff1a30<br \/>\n\u75c7\u72b6\uff1a\u6709\u4e00\u4e9b\u8fd0\u884c\u65f6\u95f4\u5f88\u957f\u7684Query, \u9010\u6e10\u6210\u4e3a\u6027\u80fd\u74f6\u9888\u3002<br \/>\n\u574f\u5904\uff1a[\u5f71\u54cd\u7528\u6237\u4f53\u9a8c\uff0c\u5f71\u54cd\u6570\u636e\u5e93\u6027\u80fd]<br \/>\n\u89e3\u51b3\u65b9\u6848\uff1a\u53d6\u6d88\u4e0d\u5fc5\u8981\u7684\u805a\u5408\u64cd\u4f5c. \u8fd0\u884c\u7684\u65f6\u5019\uff0c\u5b9e\u65f6\u805a\u5408\u7ed3\u679c.\u4f7f\u7528\u7b2c\u4e09\u65b9\u5b9e\u65f6\u6216\u975e\u5b9e\u65f6\u5de5\u5177\u3002\u5982Hadoop\uff0cStorm.<br \/>\n}]<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"55\">4<\/td>\n<td valign=\"top\" width=\"108\">\u628a\u5185\u8054Map\u5bf9\u8c61\u7684Key\u5f53\u4f5cID\u7528<\/td>\n<td valign=\"top\" width=\"601\">[{<br \/>\nID\uff1a40<br \/>\n\u75c7\u72b6\uff1a\u6587\u6863\u6570\u636e\u5e93\u652f\u6301\u5185\u8054Map\u7c7b\u578b\u3002\u5c06\u5176\u4e2dMap\u7684Key\u5f53\u4f5c\u6570\u636e\u5e93\u7684\u4e3b\u952e\u6765\u7528\u3002<br \/>\n\u574f\u5904\uff1a[\u65e0\u6cd5\u901a\u8fc7\u6570\u636e\u5e93\u505a\u5404\u79cd(&gt;&lt;&#8220;&#8221;&#8221; =)\u67e5\u8be2\uff0c\u65e0\u6cd5\u901a\u8fc7\u7d22\u5f15\u67e5\u8be2]<br \/>\n\u89e3\u51b3\u65b9\u6848\uff1a\u4f7f\u7528\u6570\u7ec4+Map\u6765\u89e3\u51b3\u3002<br \/>\n}]<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"55\">5<\/td>\n<td valign=\"top\" width=\"108\">\u4e0d\u5408\u7406\u7684ID<\/td>\n<td valign=\"top\" width=\"601\">[{<br \/>\nID\uff1a50<br \/>\n\u75c7\u72b6\uff1a\u7528String\u751a\u81f3\u66f4\u590d\u6742\u6570\u636e\u7ed3\u6784\u4f5c\u4e3a\u7684ID\uff0c\u6216\u8005\u5168\u90e8\u4f7f\u7528\u6570\u636e\u5e93\u63d0\u4f9b\u7684\u81ea\u751f\u6210ID\u3002<br \/>\n\u574f\u5904\uff1a[ID\u6df7\u4e71\uff0c\u7d22\u5f15\u5e9e\u5927]<br \/>\n\u89e3\u51b3\u65b9\u6848\uff1a\u5c3d\u91cf\u4f7f\u7528\u6709\u4e00\u5b9a\u610f\u4e49\u7684\u5b57\u6bb5\u505aID\u3002\u4e0d\u4f7f\u7528\u590d\u6742\u7684\u6570\u636e\u7c7b\u578b\u505aID\u3002<br \/>\n}]<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>\u672c\u6587\u8bd5\u56fe\u603b\u7ed3\u4e86\u7b14\u8005\u77e5\u9053\u7684\u91cd\u8981\u7684\u6587\u6863\u6570\u636e\u5e93\u7684\u53cd\u6a21\u5f0f\u3002\u73b0\u5728\u5173\u4e8eNoSQL\u6570\u636e\u6a21\u578b\u8bbe\u8ba1\u6a21\u5f0f\u7684\u8ba8\u8bba\u624d\u521a\u521a\u8d77\u6b65\uff0c\u5c06\u6765\u4e5f\u8bb8\u4f1a\u9010\u6e10\u81ea\u6210\u4f53\u7cfb\u3002\u5bf9\u4e8e\u5217\u6570\u636e\u5e93\u548cKey-Value\u7684\u53cd\u6a21\u5f0f\uff0c\u7b14\u8005\u7b49\u5230\u6709\u4e86\u8db3\u591f\u79ef\u7d2f\u7684\u65f6\u5019\uff0c\u518d\u548c\u5927\u5bb6\u5206\u4eab\u3002<\/p>\n<div><\/div>\n","protected":false},"excerpt":{"rendered":"<p>\u6211\u4eec\u8bbe\u8ba1\u5173\u7cfb\u6570\u636e\u5e93Schema\u7684\u90fd\u6709\u4e00\u5957\u5b8c\u6574\u7684\u65b9\u6848\uff0c\u800cNoSQL\u5374\u6ca1\u6709\u8fd9\u4e9b\u3002\u534a\u5e74\u524d\u7b14\u8005\u8bfb\u4e86\u672c\u300aSQL\u53cd\u6a21\u5f0f\u300b\u7684\u4e66\uff0c\u89c9\u5f97\u975e\u5e38\u597d\u3002\u5c31\u5f00\u59cb\u7559\u610f\uff0c\u5bf9\u4e8eNoSQL\u662f\u5426\u4e5f\u6709\u53cd\u6a21\u5f0f\uff1f<\/p>\n<p><a class=\"excerpt-more\" href=\"http:\/\/yankay.com\/nosql-anti-pattern-document\/\">\u9605\u8bfb\u66f4\u591a......<\/a><\/p>","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[7],"tags":[61,86,111],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>NoSQL\u53cd\u6a21\u5f0f - \u6587\u6863\u6570\u636e\u5e93\u7bc7 - \u6211\u81ea\u7136<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"http:\/\/yankay.com\/nosql-anti-pattern-document\/\" \/>\n<meta property=\"og:locale\" content=\"zh_CN\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"NoSQL\u53cd\u6a21\u5f0f - \u6587\u6863\u6570\u636e\u5e93\u7bc7 - \u6211\u81ea\u7136\" \/>\n<meta property=\"og:description\" content=\"\u6211\u4eec\u8bbe\u8ba1\u5173\u7cfb\u6570\u636e\u5e93Schema\u7684\u90fd\u6709\u4e00\u5957\u5b8c\u6574\u7684\u65b9\u6848\uff0c\u800cNoSQL\u5374\u6ca1\u6709\u8fd9\u4e9b\u3002\u534a\u5e74\u524d\u7b14\u8005\u8bfb\u4e86\u672c\u300aSQL\u53cd\u6a21\u5f0f\u300b\u7684\u4e66\uff0c\u89c9\u5f97\u975e\u5e38\u597d\u3002\u5c31\u5f00\u59cb\u7559\u610f\uff0c\u5bf9\u4e8eNoSQL\u662f\u5426\u4e5f\u6709\u53cd\u6a21\u5f0f\uff1f\" \/>\n<meta property=\"og:url\" content=\"http:\/\/yankay.com\/nosql-anti-pattern-document\/\" \/>\n<meta property=\"og:site_name\" content=\"\u6211\u81ea\u7136\" \/>\n<meta property=\"article:published_time\" content=\"2013-01-25T13:03:37+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-03-28T12:06:56+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"\u9884\u8ba1\u9605\u8bfb\u65f6\u95f4\" \/>\n\t<meta name=\"twitter:data1\" content=\"1\u5206\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"http:\/\/yankay.com\/#website\",\"url\":\"http:\/\/yankay.com\/\",\"name\":\"\\u6211\\u81ea\\u7136\",\"description\":\"\\u989c\\u5f00\\u7684\\u535a\\u5ba2\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"http:\/\/yankay.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"zh-CN\"},{\"@type\":\"WebPage\",\"@id\":\"http:\/\/yankay.com\/nosql-anti-pattern-document\/#webpage\",\"url\":\"http:\/\/yankay.com\/nosql-anti-pattern-document\/\",\"name\":\"NoSQL\\u53cd\\u6a21\\u5f0f - \\u6587\\u6863\\u6570\\u636e\\u5e93\\u7bc7 - \\u6211\\u81ea\\u7136\",\"isPartOf\":{\"@id\":\"http:\/\/yankay.com\/#website\"},\"datePublished\":\"2013-01-25T13:03:37+00:00\",\"dateModified\":\"2021-03-28T12:06:56+00:00\",\"author\":{\"@id\":\"http:\/\/yankay.com\/#\/schema\/person\/f52d918e9bfa51c4454172c2caa7704f\"},\"breadcrumb\":{\"@id\":\"http:\/\/yankay.com\/nosql-anti-pattern-document\/#breadcrumb\"},\"inLanguage\":\"zh-CN\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"http:\/\/yankay.com\/nosql-anti-pattern-document\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"http:\/\/yankay.com\/nosql-anti-pattern-document\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"http:\/\/yankay.com\/\",\"url\":\"http:\/\/yankay.com\/\",\"name\":\"\\u9996\\u9875\"}},{\"@type\":\"ListItem\",\"position\":2,\"item\":{\"@id\":\"http:\/\/yankay.com\/nosql-anti-pattern-document\/#webpage\"}}]},{\"@type\":\"Person\",\"@id\":\"http:\/\/yankay.com\/#\/schema\/person\/f52d918e9bfa51c4454172c2caa7704f\",\"name\":\"yankay\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"http:\/\/yankay.com\/#personlogo\",\"inLanguage\":\"zh-CN\",\"url\":\"http:\/\/1.gravatar.com\/avatar\/426bb830224c1471011d92a830a6ed4f?s=96&d=wavatar&r=g\",\"contentUrl\":\"http:\/\/1.gravatar.com\/avatar\/426bb830224c1471011d92a830a6ed4f?s=96&d=wavatar&r=g\",\"caption\":\"yankay\"},\"sameAs\":[\"http:\/\/47.100.65.109\"],\"url\":\"http:\/\/yankay.com\/author\/yankay\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/posts\/26652"}],"collection":[{"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/comments?post=26652"}],"version-history":[{"count":1,"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/posts\/26652\/revisions"}],"predecessor-version":[{"id":27243,"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/posts\/26652\/revisions\/27243"}],"wp:attachment":[{"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/media?parent=26652"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/categories?post=26652"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/yankay.com\/wp-json\/wp\/v2\/tags?post=26652"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}